[
  {
    "title": "Physical Design CAD Engineer",
    "location": "Israel, Yokneam, Israel, Tel Aviv",
    "experience_required": "",
    "job_description": "NVIDIA is looking for best-in-class Physical Design CAD Engineer to join our outstanding Networking Silicon engineering team, developing the industry's best high speed communication devices, delivering the highest throughput and lowest latency! Come and take a part in designing our groundbreaking and innovating chips, enjoy working in a meaningful, growing and highly professional environment where you make a significant impact in a technology-focused company.\nWhat you'll be doing:\nYou will be in charge of developing physical design, synthesis, STA and Logic eq methodologies for implementation of networking chips and SOCs.\nWork closely with block owners. full Chip STA engineers and project managers to assure high quality and timely convergence.\nCome up with unique and creative solutions to the state of the art physical design problems that are needed for Our chips.\nAdditional responsibilities include participating and developing flow and tool methodologies for chip floorplan, power and clock distribution, P&R, timing analysis and closure, power and noise analysis and back-end verification across multiple projects.\nWhat we need to see:\nB.SC./ M.SC. in Electrical Engineering/Computer Engineering (or equivalent experience).\nAt least 2 years of relevant experience\nProficiency using Python, Perl, Tcl, Make scripting.\nExpertise in analysing and converging crosstalk delay, noise glitch, and electrical/manufacturing rules in deep-sub micron processes.\nKnowledge in physical design and optimization e.g. placement, routing, cell sizing, buffering, logic restructuring, etc. to improve timing and power required and implementing them through ECOs is required.\nKnowledge in process variation effect modelling and experience in design convergence taking into account variations.\nSuccessful track record of delivering designs to production is necessary.\nSelf-motivation, attention to detail, and good written, verbal, and presentation skills are critical to success in this role.\nWays to stand out from the crowd:\nFamiliarity with  synthesis, place and route, STA EDA tools from Synopsys (DC/FC/PT), Cadence (Innovus/Tempus) \nExperience in methodology definition / flow owner of synthesis / Place and Route/ STA steps is an advantage.\nGreat teammate.\nOwnership, self-learning skills, and ability to work autonomously.\nNVIDIA is widely considered to be one of the technology world’s most desirable employers. We have some of the most forward-thinking people in the world working for us. Are you a creative and autonomous engineer who loves a challenge? Are you ready to become the engineer you always wanted to be? Come and be part of the best physical design team in the industry!\n#LI-Hybrid",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/Israel-Yokneam/Physical-Design-CAD-Engineer_JR1969066",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T13:24:13.541058"
  },
  {
    "title": "Chip Design Architect",
    "location": "Israel, Tel Aviv, 3 Locations, Israel, Tel Aviv",
    "experience_required": "",
    "job_description": "We are seeking a highly motivated Chip Design Architect to join our team of experts and help shape the future of high-performance computing. Our next-generation Infiniband and NVL switches will be at the forefront of connecting and powering the world's most advanced compute clusters, from supercomputers used in AI research to high-performance clusters used in industries such as finance and research labs. As a Chip Design Architect at NVIDIA, you will have the opportunity to work on some of the most cutting-edge technology and help to drive the innovation of our next generation of switches that will be used by top researchers and engineers around the world. The products you'll develop will be integrated in many leading-edge compute clusters, and supercomputers, and you'll be part of a team with a strong track record of success.\nWhat you will be doing:\nCollaborate with cross-functional teams, including other architecture teams, logic design, system software, firmware, and hardware teams, to ensure the successful execution of the project. \nDefine the HW boot, clock and Reset architecture for Switch ASIC\nDevelop slow-speed interface architecture specifications and design guidelines, conduct trade-off analysis for different architecture options, and oversee the implementation of the chosen architecture by the chip design / FW / SW teams\nWhat we need to see:\nBSc or MSc in Electrical Engineering / Computer Science or equivalent experience. \n4+ years of chip-design architect experience or chip design / design verification experience. \nDeep understanding of how to build and integrate systems with various technology components. \nCan-do attitude and high energy with leadership and excellent interpersonal skills and possess the ability to learn sophisticated concepts in a fast-paced environment. \nPossess strong managerial, problem solving and critical thinking skills.\nAttention to details on design and high focus on design quality. \nNVIDIA is widely considered to be one of the technology world’s most desirable employers. We have some of the most forward-thinking and hardworking people in the world working for us. If you're creative and autonomous, we want to hear from you!",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/Israel-Tel-Aviv/Chip-Design-Architect_JR1996141",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T13:24:16.713262"
  },
  {
    "title": "DevOps and Automation Engineer",
    "location": "India, Bengaluru, India, Remote, India, Hyderabad, India, Pune, India, Mumbai, India, Pune, India, Pune",
    "experience_required": "",
    "job_description": "NVIDIA is at the forefront of innovation in AI, high-performance computing, and visualization. Our invention—the GPU—has transformed modern computing and powers everything from scientific breakthroughs to autonomous vehicles. As we drive the next wave of artificial intelligence, we’re looking for outstanding engineers to join us.\nWe're seeking a DevOps and Automation Engineer to join our software infrastructure team. In this role, you'll build and enhance the systems that support large-scale GPU clusters—interconnected via NVLink and InfiniBand—that run today's most fast paced HPC and AI workloads.\nWhat you’ll be doing:\nBuild and maintain CI/CD pipelines that support fast, reliable integration and deployment across complex systems.\nDesign tools and automation workflows that simplify software releases, manage dependencies, and increase reliability.\nAccelerate development by modularizing systems and enabling independent release cycles.\nBuild infrastructure automation for provisioning, scaling, and maintaining GPU clusters.\nAutomate software updates and monitor system health to improve reliability and availability.\nTroubleshoot and resolve operational issues across distributed infrastructure.\nManage firmware and software rollouts to minimize downtime and ensure consistency.\nWork with global engineering teams to align infrastructure tools and support project achievements.\nWhat we need to see:\nBS or MS in Computer Science, Computer Engineering, or a related field—or equivalent hands-on experience.\n5+ years of experience managing infrastructure or systems in high-performance or distributed environments.\nExpertise in scripting and automation using Python, Ansible, and Shell.\nPractical experience with modern CI/CD tools and infrastructure-as-code frameworks.\nStrong understanding of Linux, networking, and distributed system design.\nAbility to break down monolithic systems into scalable, loosely coupled components.\nStrong cross-functional communication and collaboration skills.\nWays to stand out from the crowd:\nExperience with cluster management tools like Slurm.\nFamiliarity with NVIDIA DGX systems and GPU-based clusters.\nKnowledge of observability tools such as Prometheus and Grafana.\nProven ability to lead DevOps process improvements and drive team efficiency.\nNVIDIA is widely considered to be one of the technology world’s most desirable employers. We have some of the most forward-thinking and hardworking people on the planet working for us. If you're creative and autonomous, we want to hear from you!",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/India-Bengaluru/DevOps-and-Automation-Engineer_JR2000937",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T13:24:19.928395"
  },
  {
    "title": "Senior Software Engineer - Data Center System Bringup",
    "location": "US, CA, Santa Clara, 2 Locations, 6 Locations",
    "experience_required": "",
    "job_description": "NVIDIA has been transforming computer graphics, PC gaming, and accelerated computing for more than 25 years. It’s a unique legacy of innovation that’s fueled by great technology—and amazing people. Today, we’re tapping into the unlimited potential of AI to define the next era of computing. An era in which our GPU acts as the brains of computers, robots, and self-driving cars that can understand the world. Doing what’s never been done before takes vision, innovation, and the world’s best talent. As an NVIDIAN, you’ll be immersed in a diverse, supportive environment where everyone is inspired to do their best work. Come join the team and see how you can make a lasting impact on the world.\nWe are building innovative server systems for GPU accelerated applications, such as Deep Learning. As a Senior Software Engineer - Data Center System Bringup, you will play a crucial role in our innovative team, leading the software and firmware debug and bringup efforts of our powerful server systems like HGX, DGX and MGX. We are looking for Senior Firmware / System Software engineers who would closely work with our CSP partners to bringup and stabilize their new server systems. This is an outstanding chance to collaborate with exceptional professionals on groundbreaking technology that pushes the limits of what can be achieved.\nWhat you'll be doing:\nSpearhead the debug, bringup, and triage of bugs during the CSP's server system bringup.\nCollaborate closely with matrix teams to work on firmware and software across the entire stack.\nWork directly with major customers to solve complex technical issues.\nRefine and stabilize solutions that ensure flawless integration of server products in large scale data centers and improve performance and reliability of our data center systems.\nWork closely with product experience and documentation teams to ensure true customer delight.\nWhat we need to see:\nBachelor’s or Master’s degree in Computer Science, Electrical Engineering, or a related field, or equivalent experience.\nDemonstrated ability in system bringup, debugging, and handling complex hardware and software issues with 7+ years in the area of system software or firmware areas.\nOutstanding skills in firmware and software development with a deep understanding of end-to-end stack and server system architecture.\nExpertise in Out of Band and In-band management architectures.\nStrong ability to collaborate and communicate effectively within a diverse team of engineers.\nA track record of delivering high-quality, innovative solutions in a fast-paced, dynamic environment.\nWays to stand out from the crowd:\nStrong background in device management protocols such as Redfish, IPMI, PLDM.\nIn depth understanding of PCIE, memory management or networking stack.\nNVIDIA is leading the way in groundbreaking developments in Artificial Intelligence, High-Performance Computing, and Visualization. Our invention serves as the visual cortex of modern computers and is at the heart of our products and services. Our work opens up new universes to explore, enables amazing creativity and discovery, and powers what were once science fiction inventions from artificial intelligence to autonomous cars. NVIDIA is looking for great people like you to help us accelerate the next wave of artificial intelligence.\nYour base salary will be determined based on your location, experience, and the pay of employees in similar positions. The base salary range is 184,000 USD - 287,500 USD for Level 4, and 224,000 USD - 356,500 USD for Level 5.\nYou will also be eligible for equity and benefits.\nApplications for this job will be accepted at least until September 13, 2025.\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/US-CA-Santa-Clara/Senior-Software-Engineer---Data-Center-System-Bringup_JR1993516",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T13:24:23.259323"
  },
  {
    "title": "Senior NPI Program Manager - Datacenter Server Products",
    "location": "US, CA, Santa Clara, US, CA, Santa Clara, 2 Locations",
    "experience_required": "",
    "job_description": "Do you want to join a team of highly motivated and experienced program managers who drive the successful introduction of NVIDIA's next generation GPU/CPU based products? We work closely with internal leaders in Software, Hardware, Firmware, Marketing and Operations to ensure the SW team delivers outstanding products while operating across multiple functional units and all levels of management to achieve Time-To-Market. As part of the team, your knowledge of driver, firmware, diagnostics and the SW stack development processes and priorities will enable you to swiftly make the course adjustments needed to keep these complex projects on track!\nOur team drives the correction of any issues that impede program success via on the spot corrections, mid-program or post-mortem analysis. We closely collaborate to wring the maximum efficiency from our processes while seeking out process changes that improve both NPI and SW productivity. Do you wish you were a catalyst in a company that is defining new, globally impactful markets, while working with sharp, upbeat peers? If so, we have an opportunity for you!\nWhat You'll Be Doing:\nDriving system software releases to enable production of new systems.\nProvide up to date software readiness to cross functional team members.\n Learn the stakeholders in the program and what their needs. Plan ahead the HW, FW and SW needs for a successful outcome of the product.\nUnderstand the needs for the new product development. Plan ahead for HW, FW, and SW teams to ensure successful product outcomes.\nPrioritize resolution of issues for firmware and platform bring up.\nWhat We Need to See: \nHands on experience with the software development lifecycle, specifically for device drivers and applications\nYou have experience in product bring up\nEffective in a matrix-managed organization and work with datacenter, lab and engineering development teams\nDetail oriented and comfortable multitasking in a dynamic environment with shifting priorities and changing requirements. Excellent communication and technical presentation skills\nYou love thinking creatively to resolve novel technical issues and resource constraints\nAbility to think strategically and tactically and to build consensus to make programs successful. Thorough knowledge of software engineering and life cycle principles\nData analysis with Excel or Tableau or Smartsheets. Presenting information in more understandable and actionable formats to enhance the decision making\n 7+ years in a similar or related role with BS CE, EE or CS (or equivalent experience)\nWay to Stand Out From the Crowd: \nKnowledge of data center systems, standards and deployment a plus\nYou have shown the ability to independently deliver complex products\nKnowledge of GPUs and NICs is a plus. Having experience with Agile tools in support of this role\nNVIDIA is widely considered to be one of the technology world’s most desirable employers. We have some of the most forward-thinking and hardworking people on the planet working for us. If you're creative, passionate and self-motivated, we want to hear from you!\nYour base salary will be determined based on your location, experience, and the pay of employees in similar positions. The base salary range is 160,000 USD - 253,000 USD for Level 4, and 192,000 USD - 304,750 USD for Level 5.\nYou will also be eligible for equity and benefits.\nApplications for this job will be accepted at least until September 13, 2025.\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/US-CA-Santa-Clara/Senior-NPI-Program-Manager---Datacenter-Server-Products_JR1998353",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T13:24:26.472097"
  },
  {
    "title": "Senior System Software Bringup Engineer",
    "location": "US, CA, Santa Clara, US, Remote, 6 Locations, US, CA, Santa Clara",
    "experience_required": "",
    "job_description": "NVIDIA’s invention of the GPU in 1999 sparked the growth of the PC gaming market, redefined modern computer graphics, and revolutionized parallel computing. More recently, GPU deep learning ignited modern deep learning - the next era of computing - with the GPU acting as the brain of computers, robots, and self-driving cars that can perceive and understand the world. Today, we are increasingly known as “The AI Computing Company.” We're looking to grow our company and establish teams with the most thoughtful people in the world. \nNVIDIA HGX, MGX and DGX systems deliver the world's leading solutions for enterprise AI infrastructure at scale.  With their end-to-end performance and flexibility, these systems enable researchers and scientists to combine simulation, data analytics, and AI to drive scientific progress on the most powerful end-to-end AI supercomputing platforms. Are you ready to change the next generation of computing? Join us at the forefront of technological advancement.\nWhat you’ll be doing:\nLead and drive system bringup for GPU-centric server platforms in factory and data center environments.\nDesign and implement end-to-end factory workflows, including firmware flashing sequences, security provisioning, and deployment of software mitigations.\nCollaborate cross-functionally with data center architects, ODMs, and OEMs to define factory and data center requirements that ensure efficient and reliable production ramp.\nChampion reliability, debuggability and optimization in firmware, diagnostic and deployment tool design.\nUse AI tools to automate functionality and improve automation.\nTroubleshoot at speed of light, working closely with system bring-up teams on next generation AI systems to debug and resolve issues during bringup and deployment.\nWhat we need to see:\n10+ years of experience in data center firmware/platform software development.\nBS, MS, or PhD in EE, CS, or related technical field (or equivalent experience).\nDeep, hands-on expertise of working with ODMs/CSPs, firmware update design and out-of-band management.\nProven track record of architecting and developing server firmware and diagnostic solutions for large-scale data center deployments.\nSolid knowledge of hardware interfaces (USB, SMBus/I2C, PCIe) and protocols such as Redfish, MCTP, and PLDM.\nSolid knowledge of debugging servers for early bring up.\nAdvanced skills in C/C++ and Python, with a hands-on approach to coding and debugging during hardware bring-up.\nStrong communicator, excellent collaborator, and committed team player.\nSelf-starter with a problem-solving mindset who thrives in a fast-paced, complex technical environment.\nWays to stand out from the crowd:\nHands-on experience with ODMs/CSPs during system bring-up and volume deployment.\nDeep familiarity with x86 or ARM system architecture.\nStrong networking expertise with high-speed NICs, including bring-up and configuration in factory environment.\nNVIDIA is widely considered to be one of the technology world’s most desirable employers. We have some of the most forward-thinking and hardworking people on the planet working for us. If you're creative and autonomous, we want to hear from you!\nYour base salary will be determined based on your location, experience, and the pay of employees in similar positions. The base salary range is 184,000 USD - 287,500 USD for Level 4, and 224,000 USD - 356,500 USD for Level 5.\nYou will also be eligible for equity and benefits.\nApplications for this job will be accepted at least until September 13, 2025.\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/US-CA-Santa-Clara/Senior-System-Software-Bringup-Engineer_JR1999911",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T13:24:29.692436"
  },
  {
    "title": "Senior Software Architect - Data Center Systems",
    "location": "US, CA, Santa Clara, US, TX, Austin, US, TX, Remote, US, OR, Hillsboro, US, CA, Remote, 2 Locations, 4 Locations",
    "experience_required": "",
    "job_description": "We are building innovative server systems for GPU accelerated applications, such as Deep Learning. Data Center SW team architects and develops the end to end software and firmware stack for these systems. We are looking for a Senior Software Architect who has deep expertise in designing server platforms and has added understanding of application use cases in Deep Learning workloads. You will work with world class engineering teams, product management, Operations and Customer support to build systems that will truly delight our customers.\nWhat you’ll be doing:\nYou will lead software activities for NVIDIA's deep learning server platforms, from design through production; collaborating with teams across company to deliver software solutions\nDrive the system architecture for a complex server platform in a multi-functional environment.\nPartner across application software, libraries, system software and firmware teams to design complete software solutions for new server platforms\nWork directly with major customers to understand their requirements and work to align their roadmap with NVIDIA’s roadmap.\nWork with business partners and vendors to shape their products to meet NVIDIA’s needs.\nDevelop a roadmap of new technologies and protocols and drive their design and adoption.\nMentor architects and engineering teams to grow them into future leaders.\nMake key technical decisions for designs involving complex inter-component dependencies.\nWhat we need to see:\nDeep experience in designing architecture for scalable and performant server systems, particularly at the SW/HW interface.\nUnderstanding of HPC or Deep learning workloads and use of accelerated computing platforms.\nExpertise in Out of Band and In-band management architectures.\nKnowledge of server system architecture and implications of architecture decisions on overall performance of end applications.\nDemonstrable experience in implementing left shift strategy to de-risk program execution.\nExcellent written and verbal communication skills.\nBS or MS degree in Computer Engineering, Computer Science, or related degree or equivalent experience.\n10+ years in the area of System architecture and design.\nWays to stand out from the crowd:\nKnowledge of cloud and cluster level deployment and management systems.\nStrong background of device management protocols such as Redfish, IPMI, MCTP, PLDM and RDE.\nKnowledge in storage and networking technologies.\nNVIDIA is leading the way in groundbreaking developments in Artificial Intelligence, High-Performance Computing and Visualization. The GPU, our invention, serves as the visual cortex of modern computers and is at the heart of our products and services. Our work opens up new universes to explore, enables amazing creativity and discovery, and powers what were once science fiction inventions from artificial intelligence to autonomous cars. NVIDIA is looking for great people like you to help us accelerate the next wave of artificial intelligence.\nNVIDIA is widely considered to be one of the technology world’s most desirable employers. We have some of the most forward-thinking and hardworking people in the world working for us. Are you creative and autonomous? Do you love a challenge? If so, we want to hear from you. Come, join our Data center server systems team and help build the real-time, cost-effective computing platform driving our success in this exciting and quickly growing field.\nYour base salary will be determined based on your location, experience, and the pay of employees in similar positions. The base salary range is 224,000 USD - 356,500 USD for Level 5, and 272,000 USD - 425,500 USD for Level 6.\nYou will also be eligible for equity and benefits.\nApplications for this job will be accepted at least until September 13, 2025.\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/US-CA-Santa-Clara/Senior-Software-Architect---Data-Center-Systems_JR1973150",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T13:24:32.910357"
  },
  {
    "title": "Senior Firmware Engineer – CSP Engagements",
    "location": "US, CA, Santa Clara, US, CA, Santa Clara, US, CA, Santa Clara",
    "experience_required": "",
    "job_description": "NVIDIA is seeking a Senior Firmware Engineer to join our CSP Engagements team, focusing on system software for Datacenter products such as GB200. This role combines deep technical expertise in embedded firmware development with customer-facing responsibilities to enable cloud service providers with next-generation computing platforms. You will work at the intersection of hardware and software, driving technical solutions from concept through deployment.\nWhat you will be doing:\nDesign and develop firmware solutions for manageability and observability of data center servers.\nActively participate in hardware bring-up activities, OOB firmware development, protocol stacks (Redfish, PLDM, MCTP, NSM) and hardware-software co-design for Cloud Service Provider deployments.\nDebug and troubleshoot NVIDIA GPU firmware issues, power management, performance, and thermal control problems for data center deployments, providing active support to CSPs.\nPartner directly with CSPs to deliver technical solutions, co-develop & co-debug features and optimizations, and provide support during new product introductions.\nPerform advanced system debugging, root cause analysis, and performance optimization for large-scale data center environments.\nCollaborate with AE, FAE, and Solution Architect teams to deliver integrated customer solutions and technical documentation.\nWhat we need to see:\nDeep expertise in data center server architectures, HPC systems, and hardware-software co-design.\nDeep expertise in embedded firmware, server management controllers, and hardware bring-up with proven track record of shipping production BMC solutions\nStrong knowledge of DMTF protocols (Redfish, IPMI, PLDM, MCTP, SPDM), telemetry frameworks, and out-of-band management architectures\nExpert-level skills in C/C++ in resource-constrained embedded environments, RTOS, device drivers, and low-level protocols (I2C, SPI, UART, PCIe, MCTP).\nExperience with RAS including error handling, error injection, fault isolatio, and system health monitoring.\nBS or MS in Computer Engineering, Computer Science, or related field (or equivalent experience).\n8-12 years of system software development experience.\nWays to stand out from the crowd:\nKnowledge of cloud and cluster level deployment and management systems.\nExperience with GPU computing (CUDA), deep learning workloads.\nKnowledge of Memory fabric and CXL architectures.\nNVIDIA is leading the way in groundbreaking developments in Artificial Intelligence, High-Performance Computing and Visualization. The GPU, our invention, serves as the visual cortex of modern computers and is at the heart of our products and services. We have some of the most forward-thinking and hardworking people on the planet working for us. If you're creative, hardworking and self-motivated, we want to hear from you!\nDo you want to join a team of highly motivated and experienced program managers who drive the successful introduction of NVIDIA's next generation GPU/CPU based products? We work closely with internal leaders in Software, Hardware, Firmware, Marketing and Operations to ensure the SW team delivers outstanding products while operating across multiple functional units and all levels of management to achieve Time-To-Market. As part of the team, your knowledge of driver, firmware, diagnostics and the SW stack development processes and priorities will enable you to swiftly make the course adjustments needed to keep these complex projects on track!\nYour base salary will be determined based on your location, experience, and the pay of employees in similar positions. The base salary range is 184,000 USD - 287,500 USD for Level 4, and 224,000 USD - 356,500 USD for Level 5.\nYou will also be eligible for equity and benefits.\nApplications for this job will be accepted at least until September 13, 2025.\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/US-CA-Santa-Clara/Senior-Firmware-Engineer---CSP-Engagements_JR1999599",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T13:24:36.084342"
  },
  {
    "title": "Senior System Software Engineering Lead for Release - Base OS",
    "location": "US, CA, Santa Clara, US, TX, Remote, US, CO, Remote, US, CA, Remote, US, CA, Santa Clara, US, CA, Santa Clara",
    "experience_required": "",
    "job_description": "NVIDIA’s invention of the GPU in 1999 fueled the growth of the PC gaming market, redefined modern computer graphics, and revolutionized parallel computing. More recently, GPU deep learning ignited modern AI — the next era of computing — with the GPU acting as the brain of computers, robots, and self-driving cars that can perceive and understand the world. Today, we are increasingly known as “the AI computing company”. We're looking to grow our company, and build our teams with the most resourceful people in the world. Join us at the forefront of technological advancement.\nWhat you'll be doing:\nBase OS is the Linux platform used to enable both x86 and arm64 NVIDIA platforms. Your role as the Base OS Engineering Release Lead is to help drive Base OS across multiple programs and products.\nWork closely with external partners and customers to capture their requests!\nPartner with Hardware, Software, and Firmware development teams to align on deliverables and priorities.\nWhat we need to see:\nBS or Masters in computer science, or related field or equivalent experience.\n7+ years of experience.\nExcellent communication and planning skills.\nFamiliarity with at least one major Linux distro (Ubuntu, RedHat, SLES) is required.\nExperience with complex system-level debugging is invaluable.\nSolid understanding of GPU server architecture.\nWays to stand out from the crowd:\nUnderstanding kernel development methodologies is recommended.\nExperience writing software in GitHub with exposure to opensource development life cycle is desired.\nKnowledge of NVIDIA technologies used within NVIDIA server products is another way to be highlighted.\nNVIDIA is widely considered to be one of the technology world’s most desirable employers. We have some of the most forward-thinking and hardworking people on the planet working for us. If you're creative and autonomous, we want to hear from you!\nYour base salary will be determined based on your location, experience, and the pay of employees in similar positions. The base salary range is 184,000 USD - 287,500 USD.\nYou will also be eligible for equity and benefits.\nApplications for this job will be accepted at least until September 13, 2025.\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/US-CA-Santa-Clara/Senior-System-Software-Engineer--Base-OS-Engineering-Lead-for-Release_JR2000481",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T13:24:39.271851"
  },
  {
    "title": "Senior Network Automation Architect - DGX Cloud",
    "location": "US, CA, Santa Clara, US, WA, Remote, US, CA, Remote, 2 Locations, 3 Locations",
    "experience_required": "",
    "job_description": "We are seeking a highly skilled Senior Network Automation Architect to design, implement, and oversee end-to-end automation frameworks for provisioning Baremetal and Kubernetes clusters across hybrid and multi-cloud environments. This role blends deep networking expertise with infrastructure-as-code principles, enabling rapid, reliable, and secure deployment of Kubernetes clusters at scale.\nThe successful candidate will work closely with SREs, platform engineers, network engineers, and Tooling teams to automate cluster lifecycle management, integrate provisioning workflows with CI/CD pipelines, and ensure observability, resilience, and compliance across all automation systems.\nWhat you’ll be doing:\nDesign scalable, secure, and repeatable automation for Kubernetes cluster provisioning and network configuration across multi-cloud, on-prem, and hybrid environments.\nBuild Infrastructure-as-Code templates, automation pipelines, and CI/CD integrations to streamline provisioning and connectivity.\nAutomate networking integrations including CNI plugins, service meshes, load balancers, and ingress controllers.\nImplement policies, firewalling, routing, and self-service provisioning through API-driven workflows.\nDeliver observability with monitoring, logging, alerting, and self-healing workflows to improve resilience and performance.\nAct as the technical authority for network automation, mentoring teams and driving cross-functional automation maturity.\nWhat we need to see:\nDeep knowledge of Kubernetes networking (CNI, services, ingress, eBPF) and service meshes (Istio, Linkerd, Consul).\nStrong background in network security, firewalling, routing, and containerized environments.\nHands-on experience with IaC and automation tools (Terraform, Ansible, Pulumi), GitOps tooling (ArgoCD, Flux), and CI/CD systems.\nProficiency in Python, Go, or Bash, with experience building API-driven integrations (REST, gRPC).\nFamiliarity with Kubernetes lifecycle management and provisioning tools (CAPI, kubeadm, kops, Rancher, OpenShift, bare metal).\nExperience with observability and tracing stacks (Prometheus, Grafana, ELK/EFK, Jaeger, OpenTelemetry).\n8+ years in network engineering and automation development. 3+ years of experience with Kubernetes platform engineering.\nBachelor's degree or equivalent experience.\nWays to stand out from the crowd:\nProven track record of crafting and delivering automated provisioning solutions at scale.\nExperience with multi-cloud networking (AWS VPC, Azure VNet, GCP VPC)m\nExcellent architecture documentation and interpersonal skills. Ability to lead cross-functional technical initiatives.\nNVIDIA’s deep learning platforms have made major impact to various fields is broadly used across leading academic institutions, start-ups, and industry, including the world’s largest Internet companies. We need passionate, hard-working and creative people to help us take on more of these unique opportunities in deep learning cloud solutions. NVIDIA is widely considered to be one of the technology world’s most desirable employers. We have some of the most forward-thinking and hard-working people in the world working for us. Are you creative and autonomous? Do you love a challenge? If so, we want to hear from you.\nYour base salary will be determined based on your location, experience, and the pay of employees in similar positions. The base salary range is 168,000 USD - 264,500 USD for Level 4, and 200,000 USD - 322,000 USD for Level 5.\nYou will also be eligible for equity and benefits.\nApplications for this job will be accepted at least until September 13, 2025.\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/US-CA-Santa-Clara/Senior-Network-Automation-Architect---DGX-Cloud_JR2002388",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T13:24:42.449438"
  },
  {
    "title": "Senior Software Engineer, Deep Learning Inference Workflows",
    "location": "US, CA, Santa Clara",
    "experience_required": "",
    "job_description": "We are now looking for a Senior Software Engineer for Deep Learning Inference Workflows! Would you like to make a big impact in Deep Learning by helping build a state-of-the-art inference framework for accelerating Deep Learning models, especially Large Language Models, on NVIDIA GPUs? We are now welcoming exceptional software engineers to apply to Senior Engineering positions in the Deep Learning software team.\nWhat you’ll be doing:\nDevelop components of TensorRT, NVIDIA’s SDK for high-performance deep learning inference.\nUse C++ and Python to build graph parsers, optimizers, and tools for effective deployment of trained deep learning models.\nCollaborate with teams of deep learning experts, GPU architects and DevOps engineers across diverse teams.\nWhat we need to see:\nA Bachelor's, Master's, PhD or equivalent experience in Computer Science, Computer Engineering, Electrical Engineering or related field.\n6+ years of software development experience.\nStrong experience with C++11/C++14/C++17.\nStrong grasp of Machine Learning concepts, especially Natural Language Processing.\nExcellent communication skills, and an aptitude for collaboration and teamwork.\nWays to stand out from the crowd:\nProficiency in Python\nExperience in software performance benchmarking, profiling, and optimizations.\nBackground in compiler development\nExperience in working with TensorRT, PyTorch, ONNX Runtime, JAX, TRT-LLM, vLLM, SGLang, or other ML frameworks.\nExperience developing custom GPU kernels in OpenAI Triton or CUDA for deep learning inference.\nNVIDIA is widely considered to be one of the technology world’s most desirable employers. We have some of the most forward-thinking and hardworking people in the world working for us. If you're creative, autonomous and love a challenge, we want to hear from you. Come, join our TensorRT Workflows team and help build the real-time, cost-effective computing platform driving our success in this exciting and quickly growing field.\n#LI-Hybrid\nYour base salary will be determined based on your location, experience, and the pay of employees in similar positions. The base salary range is 184,000 USD - 287,500 USD.\nYou will also be eligible for equity and benefits.\nApplications for this job will be accepted at least until September 13, 2025.\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/US-CA-Santa-Clara/Senior-Software-Engineer--Deep-Learning-Inference-Workflows_JR1999917",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T13:24:45.618101"
  },
  {
    "title": "Solutions Architect - NVIDIA Cloud Partners",
    "location": "US, CA, Santa Clara",
    "experience_required": "",
    "job_description": "We are looking for an experienced Solutions Architect to help bridge the gap between design and deployment of large-scale AI and HPC GPU infrastructure. Do you want to be part of the team that brings GenAI, AI, ML, etc. hardware and software technologies to production in the field? We are looking for a Solutions Architect to join the NVIDIA team focused on supporting customers as they build the next-generation GPU infrastructure for their customers. As a part of the NVIDIA solutions architecture team, you will be driving end-to-end technology solution integration with some of NVIDIA's most strategic customers as well as offering recommendations for business and engineering teams based on customer feedback on product strategy.\nWhat you'll be doing:\nWorking with NVIDIA Cloud Partners to develop, deploy, and operationalize NVIDIA's groundbreaking hardware and software solutions.\nPartner with Sales Account Managers and other business leads to identify and secure business opportunities for NVIDIA products and solutions.\nBe the go-to technical resource for the customers as they develop and build large-scale GPU cloud infrastructure.\nConduct regular technical customer meetings for project/product details, feature discussions, intro to new technologies, and debugging sessions.\nWork with customers to build PoCs for solutions to address critical business needs by building out networking and compute infrastructure.\nPrepare and deliver technical content to customers including presentations, workshops, etc.\nAnalyze and develop joint solutions for customer performance and scaling issues.\nWhat we need to see:\nBS/MS/PhD in Electrical/Computer Engineering, Computer Science, Physics, or other Engineering fields or equivalent experience.\nMotivation and skills to help drive technical pre-sales activities.\n5+ years of Solution Engineering (or similar Sales Engineering, Cloud Engineering) experience\nExperience designing and deploying large-scale cluster environments\nPractical knowledge in data center design for AI and HPC\nEfficient time management and capable of balancing multiple tasks\nAbility to communicate ideas clearly through documents, presentations, etc.\nWays to stand out from the crowd:\nHands-on experience with NVIDIA hardware (including GPUs, networking, etc.) in large-scale AI and HPC cluster environments\nHands-on experience with NVIDIA systems software including (but not limited to) NCCL, DCGM, etc.\nExperience with GPU systems in general including, but not limited to, performance testing, AI benchmarking, etc.\nHands-on experience with cluster management and orchestration (SLURM, K8s, etc.).\nAble to think creatively to debug and solve problems.\nNVIDIA is widely considered to be one of the technology world’s most desirable employers. We have some of the most forward-thinking and hardworking people in the world working for us. If you're creative and autonomous, we want to hear from you!\nYour base salary will be determined based on your location, experience, and the pay of employees in similar positions. The base salary range is 148,000 USD - 235,750 USD for Level 3, and 184,000 USD - 287,500 USD for Level 4.\nYou will also be eligible for equity and benefits.\nApplications for this job will be accepted at least until September 13, 2025.\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/US-CA-Santa-Clara/Solutions-Architect---NVIDIA-Cloud-Partners_JR2003872",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T13:24:48.774570"
  },
  {
    "title": "Senior Manager, Accelerated Compute Systems",
    "location": "US, CA, Santa Clara",
    "experience_required": "",
    "job_description": "We are now looking for a Senior Manager for Accelerated Compute Systems!\nNVIDIA is currently hiring for a Sr Technical Management position focused on Accelerated Compute Systems. We are pioneering software and system architectures that power high-performance computing, scientific computing, machine learning, AI, datacenter, and automotive platforms. This role offers a unique opportunity to make a meaningful impact in a fast-paced, innovation-driven environment. Join NVIDIA and lead the future of Accelerated Computing\nWhat you’ll be doing:\nLeading a team of accelerated compute architects.\nCollaborating closely with hardware design, software engineering, product, and research teams to shape the direction of NVIDIA’s computing platforms.\nConducting in-depth performance analysis and optimization for current and next-generation NVIDIA GPUs.\nDesigning and refining core parallel algorithms, data structures, and reference implementations for GPU acceleration.\nExploring the interaction between hardware and software architectures to improve programming models and application performance.\nEngaging in software-hardware co-design through deep dives into accelerated computing applications.\nWhat we need to see:\nA Bachelors Degree (or equivalent experience) in Computer Science, Electrical Engineering, or related field.\n10+ overall years of industry experience, with at least 4 of those years in a management role\nStrong foundation in mathematics, especially linear algebra and numerical methods.\nPassion for performance optimization and system-level thinking.\nExperience with GPU programming models such as CUDA or OpenCL.\nFamiliarity with multi-node communication APIs like MPI or OpenSHMEM/NVSHMEM\nProficiency in C/C++, with a solid grasp of software design, algorithms, and programming techniques.\nExperience with threading APIs for multicore CPUs and Unix-style IPC\nWorking knowledge of Python.\nExcellent communication, organization, and problem-solving skills.\nNVIDIA is widely recognized as one of the most desirable employers in the tech industry, and is increasingly known as “the AI computing company.\" We’re home to some of the brightest minds in the world, working together to push the boundaries of what’s possible.\nAre you creative, collaborative, and excited by the challenge of pushing architectures to their limits? If so, we want to hear from you!\nYour base salary will be determined based on your location, experience, and the pay of employees in similar positions. The base salary range is 272,000 USD - 425,500 USD.\nYou will also be eligible for equity and benefits.\nApplications for this job will be accepted at least until September 13, 2025.\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/US-CA-Santa-Clara/Senior-Manager--Accelerated-Compute-Systems_JR2003723",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T13:24:51.933367"
  },
  {
    "title": "Senior System Software Engineer, Cloud Services",
    "location": "US, CA, Santa Clara, US, CA, Remote, 2 Locations, 2 Locations",
    "experience_required": "",
    "job_description": "GeForce NOW is Nvidia’s Cloud Gaming service, streaming games at the highest quality to any and every user, regardless of their device type and capabilities – low-end PCs, Macs, or mobile devices. Using the most advanced GPUs and Nvidia proprietary software, GeForce NOW transforms the gaming experience with always up-to-date games on always the latest hardware, a streaming experience rivaling that of a local PC, and near-instant launch – just click and play! For more details, see http://www.geforce.com/geforce-now. \nThe team within the group builds, operates, and maintains cloud-hosted services that provide user and service authentication/authorization across NVIDIA. Ensuring continuity of operations is critical to our mission. We are in search of a highly proficient software engineer with extensive experience in AWS service development, deployment, and observability practices. In this capacity, you will have the responsibility of ensuring the reliability, performance, and scalability of our services, while providing the team with actionable insights for continuous improvement. You will build, implement, and coordinate observability infrastructure to proactively identify, fix, and address operational issues across our services.\nWhat you’ll be doing:\nArchitect, implement, and maintain observability systems at scale to enable monitoring, alerting, logging, and tracing for our cloud-based services.\nDefine and refine service-level indicators (SLIs), service-level objectives (SLOs), and error budgets in partnership with service owners and product teams.\nInvent, construct, and uphold actionable dashboards that display important measurements, SLI/SLOs, and system health for distributed services.\nCollaborate with software, platform, and networking teams to integrate observability at all stages of the application lifecycle, from development to incident response.\nDrive automation efforts to reduce manual toil in monitoring, telemetry, and incident response workflows; build and maintain self-service observability tooling.\nAddress performance and reliability issues by bringing to bear root cause analysis, distributed tracing, and log correlation.\nParticipate in Pager Duty rotations, contribute to post-incident reviews, detailing findings and driving solutions that improve long-term system resilience and visibility.\nDevelop expertise in the functions and capabilities of our offerings, and assist in managing our support channels for other NVIDIA teams.\nWhat we need to see:\nBachelor’s or master’s degree in computer science, engineering, or equivalent experience in the field.\n8+ years in large-scale systems engineering roles with exposure to dealing with live service development, working end-to-end from service development, deployment, and observability, as well as being on-call.\nHands-on experience with modern monitoring systems (Prometheus, Grafana, Loki, Tempo, Datadog, New Relic, OpenTelemetry, etc.) within a production environment.\nAdvanced coding skills in Python, Go, or similar languages for building automation and integrating observability solutions. Comfort with JavaScript frameworks such as React and Next.js.\nProficiency in cloud platforms (AWS, GCP, Azure) and containerized environments (Kubernetes, Docker); experience with configuration-as-code tools (Terraform, Helm, Ansible).\nStrong communication and collaboration skills, with experience working in global, cross-disciplinary teams.\nDetailed, analytical problem-solving approach and high standards for operational excellence and customer happiness.\nExperience with incident management, postmortem processes.\nWays to stand out from the crowd:\nFamiliarity with the Java Spring Boot framework, hands-on experience with Apache Cassandra and HashiCorp Vault would be very advantageous.\nBesides our core duties, our team also manages multiple custom front-end services based on React for admin functions. Having relevant coding experience and being open to supporting development would be a huge plus.\nYour base salary will be determined based on your location, experience, and the pay of employees in similar positions. The base salary range is 184,000 USD - 287,500 USD.\nYou will also be eligible for equity and benefits.\nApplications for this job will be accepted at least until September 13, 2025.\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/US-CA-Santa-Clara/Senior-System-Software-Engineer--Cloud-Services_JR2003051",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T13:24:55.128808"
  },
  {
    "title": "Senior Internal Auditor",
    "location": "US, CA, Santa Clara",
    "experience_required": "",
    "job_description": "NVIDIA has been transforming computer graphics, PC gaming, and accelerated computing for more than 25 years. It’s a unique legacy of innovation that’s fueled by great technology—and amazing people. Today, we’re tapping into the unlimited potential of AI to define the next era of computing. An era in which our GPU acts as the brains of computers, robots, and self-driving cars that can understand the world. Doing what’s never been done before takes vision, innovation, and the world’s best talent. As an NVIDIAN, you’ll be immersed in a diverse, supportive environment where everyone is inspired to do their best work. Come join the team and see how you can make a lasting impact on the world.\nWe are looking for an experienced Senior Internal Auditor who is uniquely positioned to enhance business insights and processes. This role will support the Director of Internal Audit in conducting operational and compliance audits with a focus on supply chain management and operations. You will provide support by developing relationships with operational leaders throughout the organization to monitor and improve internal controls, processes, and drive operating efficiencies.\nWhat you'll be doing:\nPerform planning, risk assessment, develop detailed test plans and execute fieldwork for complex operational and compliance audits.\nApply benchmarked methodology/frameworks to assess end-to-end processes applying a risk-based approach.\nIdentify root cause and opportunities for improvement of internal controls and acquire consensus on remediation plans with key business partners.\nAssist in the preparation of audit reports with clearly presented recommendations to management.\nEasily adapt between working independently and reciprocally on a team, perform follow-up reviews, and report on the status of action plans to implement internal control improvements derived from internal audit projects.\nTravel up to 10% domestically and internationally.\nWhat we need to see:\nBachelor’s in accounting or equivalent experience required. Master’s degree or CIA/CISA/CPA preferred.\n5+ years audit experience, including time working in the Big 4 and/or in a corporate Internal Audit function of a U.S. public company.\nStrong understanding of Internal Auditing methodologies and standards and adept at assessing complex processes to identify potential financial, operational, and compliance risks warranting audit attention.\nDemonstrated knowledge of business processes, internal controls, and governance principles.\nHighly motivated, self-starter with strong supply chain management audit experience, such as demand planning, third party supplier reviews, and logistics warehouse operations.\nStrong critical thinking mentality, while demonstrating the initiative to learn new processes and business functions.\nSkilled interviewer who comes prepared and asks thoughtful, probing questions.\nWays to stand out from the crowd:\nDemonstrated experience assessing and monitoring third-party risks related to supply chain management including execution of operational audits.\nAbility to get results, including influencing business process owners and organizational change.\nUnderstanding of IT General Controls, multi-lingual skills, using SAP S4 Hana, experience with auditing, using Artificial Intelligence (AI) and technology industry experience a plus.\nNVIDIA is widely considered to be one of the technology world’s most desirable employers. We have some of the most forward-thinking and hardworking people in the world working for us. If you are creative and autonomous, we want to hear from you!\nYour base salary will be determined based on your location, experience, and the pay of employees in similar positions. The base salary range is 104,000 USD - 166,750 USD for Level 3, and 132,000 USD - 207,000 USD for Level 4.\nYou will also be eligible for equity and benefits.\nApplications for this job will be accepted at least until September 13, 2025.\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/US-CA-Santa-Clara/Senior-Internal-Auditor_JR2002666",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T13:24:58.310171"
  },
  {
    "title": "Senior Data Platform Admin - Finance",
    "location": "US, CA, Santa Clara",
    "experience_required": "",
    "job_description": "NVIDIA has been transforming computer graphics, PC gaming, and accelerated computing for more than 25 years. It’s a unique legacy of innovation that’s fueled by great technology—and amazing people. Today, we’re tapping into the unlimited potential of AI to define the next era of computing. An era in which our GPU acts as the brains of computers, robots, and self-driving cars that can understand the world. Doing what’s never been done before takes vision, innovation, and the world’s best talent. As an NVIDIAN, you’ll be immersed in a diverse, supportive environment where everyone is encouraged to do their best work. Come join the team and see how you can make a lasting impact on the world.\nNVIDIA is hiring a senior data platform administrator within the Finance AI and Data Science team. You will work alongside data scientists, data engineers, AI developers, finance, IT, and other business partners, delivering the latest data security, system administration, and data onboarding for the finance data lake. Your work will result in data that flows seamlessly from ERP and other source systems into business-critical financial processes, reporting, BI, ML, and AI.\nWhat you’ll be doing:\nOptimize the finance Databricks environment, including implementation and maintenance of access control systems and security protocols. Coordinate with technical and business partners to build finance data platform into the broader Nvidia systems architecture and finance landscape.\nAdminister cloud infrastructure on AWS and Azure. Work closely with AI developers to containerize, deploy, maintain, and monitor AI solutions and other Kubernetes clusters.\nEstablish backup and recovery procedures for critical data systems. Create and maintain clear, accessible documentation of architecture and procedures.\nMonitor platforms for security vulnerabilities, performance issues, and cost optimization.\nPartner with data architects, data engineers, and data scientists, and finance professionals on building the perfect data system for the AI age.\nWhat we need to see:\n8+ years of experience in data platform administration.\nBS/MS or equivalent experience in Computer Science, Information Systems, Software Engineering, or other technical fields. Technical Master’s with finance or business background is preferred.\nExpertise in PySpark, SparkSQL, and Linux shell scripting. Data engineering knowledge, particularly with Delta Lake, Parquet, and other formats (JSON, XML, CSV, Avro).\nFamiliarity with access control methodologies (DAC, RBAC, UBAC). Expertise in network security protocols and encryption.\nExcellent communication skills for translating technical concepts to various audiences.\nWays to stand out from the crowd:\nDatabricks, AWS, and Azure certifications and hands-on experience.\nExperience with data compliance regulations and requirements, including PII data handling and ITGC/SOX controls.\nProven history of developing and improving security monitoring frameworks. Experience recovering systems from significant incidents is a plus.\nTeaching or mentoring experience in technical domains, enthusiasm for exploring and implementing new technologies, and creative problem-solving skills.\nNVIDIA is widely considered to be one of the technology world’s most desirable employers. We have some of the most forward-thinking and hardworking people in the world working for us. If you're creative, ambitious and enjoy having fun, then what are you waiting for apply today!\nYour base salary will be determined based on your location, experience, and the pay of employees in similar positions. The base salary range is 168,000 USD - 264,500 USD for Level 4, and 200,000 USD - 322,000 USD for Level 5.\nYou will also be eligible for equity and benefits.\nApplications for this job will be accepted at least until September 13, 2025.\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/US-CA-Santa-Clara/Senior-Data-Platform-Admin---Finance_JR2002395",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T13:25:01.473589"
  },
  {
    "title": "Internal Audit Manager - Information Technology and Security",
    "location": "US, CA, Santa Clara",
    "experience_required": "",
    "job_description": "NVIDIA has been transforming computer graphics, PC gaming, and accelerated computing for more than 25 years. It’s a unique legacy of innovation that’s fueled by great technology—and amazing people. Today, we’re tapping into the unlimited potential of AI to define the next era of computing. An era in which our GPU acts as the brains of computers, robots, and self-driving cars that can understand the world. Doing what’s never been done before takes vision, innovation, and the world’s best talent. As an NVIDIAN, you’ll be immersed in a diverse, supportive environment where everyone is inspired to do their best work. Come join the team and see how you can make a lasting impact on the world.\nWe are committed to advancing our internal audit strategies and strengthening our security and technology frameworks. As we collaborate, we will set new standards in audit innovation, drive risk management excellence, and reinforce our core business goals. We seek a leader who brings curiosity and adaptability to every challenge. Are you prepared to join us in pursuing continuous improvement and maintaining our reputation for innovation and compliance? If you share our passion for learning and transformation, we invite you to partner with us at the forefront of change.\nWhat you'll be doing:\nLead audits to assess the efficiency of IT operational controls, cybersecurity practices, and compliance measures.\nManage audit projects from prioritization to reporting, prioritizing high-impact risks and delivering actionable insights.\nDesign audit testing approaches using advanced data analytics to drive data accuracy and integrity.\nCommunicate strategic findings with clear, influential reporting that resonates with senior leadership.\nMentor and develop audit team members to deepen their expertise in technology and security auditing.\nEnsure all audit work products meet the highest standards, consistent with regulatory and professional requirements.\nCollaborate closely with IT, security, and compliance teams to provide comprehensive coverage on security and IT risks.\nWhat we need to see:\nBachelor’s or Master’s degree in Computer Science, Information Security, Information Systems, or equivalent experience.\nCISA or CISSP certification, preferred.\n8+ years of experience demonstrating proficiency in IT auditing, cybersecurity assessments, and IT operations audits.\nExpert knowledge of COBIT frameworks, COSO methodologies, and SOC compliance standards.\nStrong risk management background with a capability for reviewing complex IT environments.\nExpert communication skills to translate technical audit findings into practical, actionable recommendations.\nStrong leadership skills to motivate change and cultivate agreement among senior collaborators.\nExcellent project management skills, with the ability to lead multiple concurrent audit projects.\nWays to Stand Out from the Crowd\nExperience conducting operational audits in large hardware or technology organizations with emphasis on security, cloud and information technology.\nIn-depth exposure to cybersecurity frameworks, such as ISO 27001/27002, NIST, and agile auditing practices.\nPrevious experience in leading technology companies or consulting engagements passionate about IT and security audits.\nWidely considered to be one of the technology world’s most desirable employers, NVIDIA offers highly competitive salaries and a comprehensive benefits package. We have some of the most forward-thinking and hardworking people in the world working for us and if you're creative and autonomous, we want to hear from you! As you plan your future, see what we can offer to you and your family www.nvidiabenefits.com/.\nYour base salary will be determined based on your location, experience, and the pay of employees in similar positions. The base salary range is 132,000 USD - 207,000 USD.\nYou will also be eligible for equity and benefits.\nApplications for this job will be accepted at least until September 13, 2025.\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/US-CA-Santa-Clara/Internal-Audit-Manager---Information-Technology-and-Security_JR2002297",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T13:25:04.627616"
  },
  {
    "title": "NVIDIA 2026 Internships: Deep Learning Computer Architecture - China",
    "location": "China, Shanghai, China, Beijing",
    "experience_required": "",
    "job_description": "By submitting your resume, you’re expressing interest in one of our 2026 Deep Learning Computer Architecture Internships. We’ll review resumes on an ongoing basis, and a recruiter may reach out if your experience fits one of our many internship opportunities. \n NVIDIA pioneered accelerated computing to tackle challenges no one else can solve. Our work in AI and digital twins is transforming the world's largest industries and profoundly impacting society — from gaming to robotics, self-driving cars to life-saving healthcare, climate change to virtual worlds where we can all connect and create. \n Our internships offer an excellent opportunity to expand your career and get hands on experience with one of our industry leading Deep Learning Computer Architecture teams. We’re seeking strategic, ambitious, hard-working, and creative individuals who are passionate about helping us tackle challenges no one else can solve. \n We’re looking for students pursuing Bachelor's, Master's, or PhD degree within a relevant or related field. \n What we need to see: \nMust be actively enrolled in a university pursuing a Bachelor's, Master's, or PhD degree in Electrical Engineering, Computer Engineering, or a related field, for the entire duration of the internship.     \nCourse or internship experience related to the following areas could be required:  \nComputer Architecture experience in one or more of these focus areas: GPU Architecture, CPU Architecture, Deep Learning, GPU Computing, Parallel Programming, or High-Performance Computing Systems    \nGPU Computing (CUDA, OpenCL, OpenACC), GPU Memory Systems, Deep Learning Frameworks (PyTorch, TensorFlow, Keras, Caffe), HPC (MPI, OpenMP)   \nModelling/Performance Analysis, Parallel Processing, Neural Network Architectures, GPU Acceleration, Deep Learning Neural Networks, Compiler Programming  \nPerformance Modeling, Profiling, Optimizing, and/or Analysis \nDepending on the internship role, prior experience or knowledge requirements could include the following programming skills and technologies:  \nC, C++, Python, Perl, GPU Computing (CUDA, OpenCL, OpenACC), Deep Learning Frameworks (PyTorch, TensorFlow, Caffe), HPC (MPI, OpenMP) \nClick here to learn more about NVIDIA, our early talent programs, benefits offered to students and other helpful student resources related to our latest technologies and endeavors.",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/China-Shanghai/NVIDIA-2026-Internships--Deep-Learning-Computer-Architecture---China_JR2003635",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T13:25:07.806358"
  },
  {
    "title": "NVIDIA 2026 Internships: Mixed Signal Design and Digital Circuit Design",
    "location": "US, CA, Santa Clara, US, CA, Santa Clara, US, CA, Santa Clara",
    "experience_required": "",
    "job_description": "By submitting your resume, you’re expressing interest in one of our 2026 Mixed Signal Design and Digital Circuit Design Internships. We’ll review resumes on an ongoing basis, and a recruiter may reach out if your experience fits one of our many internship opportunities. \n NVIDIA pioneered accelerated computing to tackle challenges no one else can solve. Our work in AI and digital twins is transforming the world's largest industries and profoundly impacting society — from gaming to robotics, self-driving cars to life-saving healthcare, climate change to virtual worlds where we can all connect and create.     \n Our internships offer an excellent opportunity to expand your career and get hands on experience with one of our industry leading Hardware teams. We’re seeking strategic, ambitious, hard-working, and creative individuals who are passionate about helping us tackle challenges no one else can solve. \n Throughout the 12-week full-time internship, students will work on projects that have a measurable impact on our business. We’re looking for students pursuing Bachelor's, Master's, or PhD degree within a relevant or related field. \n Potential Internships in this field include:   \nMixed Signal Design \nAnalog Fundamentals, Analog Simulation (Noise Analysis, Loop Stability Analysis, AC/DC/Transient Analysis, Monte-Carlo, etc.) \nLayout and Physical Design Fundamentals \nCMOS Analog Circuit Design (especially in FinFET), High-Speed Circuit Design, Serial Communication Standards (PLL, DAC (Digital-to-Analog Converters), ADC (Analog-to-Digital Converters), and Bandgaps) \nLab Testing Equipment (Oscilloscopes, Spectrum Analyzers) \nDigital Circuit Design  \nDigital Circuit Design and Device Fundamentals, Place and Route Design Tools, Datapath Tiling Techniques, SPICE Simulations  \nExperience with crafting Flip Flops, Level Shifters, Math Cells, Register Files, etc.    \nAutomation Methods, Algorithm and Power Distribution, Power Management Circuits/Solutions \nEDA Tools (Cadence, Synopsys) \nWhat we need to see:  \nMust be actively enrolled in a university pursuing a Bachelor's, Master's, or PhD degree in Electrical Engineering, Computer Engineering, or a related field, for the entire duration of the internship.   \nDepending on the internship role, prior experience or knowledge requirements could include the following programming skills and technologies:  \nVerilog, SystemVerilog, VHDL, Perl, Python, SPICE, HSPICE, CMOS, FinFET, Cadence, Synopsys  \nClick here to learn more about NVIDIA, our early talent programs, benefits offered to students and other helpful student resources related to our latest technologies and endeavors. \nOur internship hourly rates are a standard pay based on the position, your location, year in school, degree, and experience. The hourly rate for our interns is 20 USD - 71 USD.\nYou will also be eligible for Intern benefits. \nApplications are accepted on an ongoing basis.\n\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/US-CA-Santa-Clara/NVIDIA-2026-Internships--Mixed-Signal-Design-and-Digital-Circuit-Design_JR2003199",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T13:25:11.001827"
  },
  {
    "title": "NVIDIA 2026 Internships: Hardware Engineering",
    "location": "US, CA, Santa Clara, US, CA, Santa Clara, US, CA, Santa Clara",
    "experience_required": "",
    "job_description": "By submitting your resume, you’re expressing interest in one of our 2026 Hardware Engineering Internships. We’ll review resumes on an ongoing basis, and a recruiter may reach out if your experience fits one of our many internship opportunities. \n NVIDIA pioneered accelerated computing to tackle challenges no one else can solve. Our work in AI and digital twins is transforming the world's largest industries and profoundly impacting society — from gaming to robotics, self-driving cars to life-saving healthcare, climate change to virtual worlds where we can all connect and create.     \n Our internships offer an excellent opportunity to expand your career and get hands on experience with one of our industry leading Hardware teams. We’re seeking strategic, ambitious, hard-working, and creative individuals who are passionate about helping us tackle challenges no one else can solve. \n Throughout the 12-week full-time internship, students will work on projects that have a measurable impact on our business. We’re looking for students pursuing Bachelor's, Master's, or PhD degree within a relevant or related field. \n Potential Internships in this field include:  \nSystem Validation  \nThese teams are responsible for system validation and post-production activities for datacenter server products, such as HGX baseboards, DGX Servers or DGX Workstations. You will need to maintain a close relationship with all members of the Architecture, Hardware and Software Design teams to ensure rigorous testing and debugging of all new features and changes made during product development. \nHardware Design  \nWith strong backgrounds in electrical engineering and a curiosity about hardware product design, Hardware Design Interns work with a close-knit, multi-disciplinary team, enjoying hands-on work, with cutting-edge visual computing platforms. Primary responsibilities may include Hardware Testing, Debugging, and Validation of new products to ensure they meet performance, functional, and quality objectives. \nMechanical Engineering \nThis team helps craft and test new NVIDIA products. You will be part of a diverse, multi-functional team researching and developing new concepts and materials for our next generation of products. You must demonstrate excellent interpersonal skills and a strong academic background in Mechanical Engineering. \nSilicon Solutions  \nAs a part of the Silicon Solutions Engineering Team, you will be responsible for productizing NVIDIA’s chips into groundbreaking consumer, professional, server, mobile, and automotive solutions.  \nWhat we need to see:  \nMust be actively enrolled in a university pursuing a Bachelor's, Master's, or PhD degree in Electrical Engineering, Computer Engineering, or a related field, for the entire duration of the internship.   \nDepending on the internship role, prior experience or knowledge requirements could include the following programming skills and technologies:  \nVerilog, SystemVerilog, VHDL, Perl, Python, TCL, Board-Level Design, PCB, Datacenter Systems, Linux, CAD Software (i.e. Solidworks, ProE, Creo, Catia, Unigraphics, etc.), MATLAB, MOSFETs, Lab Tools (Oscilloscope, Multimeter, Logic Analyzer) \nClick here to learn more about NVIDIA, our early talent programs, benefits offered to students and other helpful student resources related to our latest technologies and endeavors. \nOur internship hourly rates are a standard pay based on the position, your location, year in school, degree, and experience. The hourly rate for our interns is 20 USD - 71 USD.\nYou will also be eligible for Intern benefits. \nApplications are accepted on an ongoing basis.\n\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/US-CA-Santa-Clara/NVIDIA-2026-Internships--Hardware-Engineering-_JR2003200",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T13:25:14.180803"
  },
  {
    "title": "NVIDIA 2026 Internships: Computer Architecture",
    "location": "US, CA, Santa Clara, US, CA, Santa Clara, US, CA, Santa Clara",
    "experience_required": "",
    "job_description": "By submitting your resume, you’re expressing interest in one of our 2026 Computer Architecture Internships. We’ll review resumes on an ongoing basis, and a recruiter may reach out if your experience fits one of our many internship opportunities. \n NVIDIA pioneered accelerated computing to tackle challenges no one else can solve. Our work in AI and digital twins is transforming the world's largest industries and profoundly impacting society — from gaming to robotics, self-driving cars to life-saving healthcare, climate change to virtual worlds where we can all connect and create. \n Our internships offer an excellent opportunity to expand your career and get hands on experience with one of our industry leading Computer Architecture teams. We’re seeking strategic, ambitious, hard-working, and creative individuals who are passionate about helping us tackle challenges no one else can solve. \n Throughout the 12-week full-time internship, students will work on projects that have a measurable impact on our business. We’re looking for students pursuing Bachelor's, Master's, or PhD degree within a relevant or related field. \n What we need to see: \nMust be actively enrolled in a university pursuing a Bachelor's, Master's, or PhD degree in Electrical Engineering, Computer Engineering, or a related field, for the entire duration of the internship.   \nCourse or internship experience related to the following areas could be required:  \nComputer Architecture experience in one or more of these focus areas: Computer Graphics, Deep Learning, Ray Tracing, Parallel Programming, Memory Architecture, or High-Performance Computing Systems \nDigital Systems, VLSI Design, GPU or CPU Architecture, Computer Arithmetic, CMOS Transistors and Circuits, Computer Organization, Computer System Design   \nDeep Learning, Modelling/Performance Analysis, Parallel Programming   \nHardware Control Programming, GPU Acceleration, Parallel Processing (CUDA), High-Performance Computing (HPC), Embedded Systems    \nDepending on the internship role, prior experience or knowledge requirements could include the following programming skills and technologies:  \nVerilog, SystemVerilog, VHDL, Linux, C, C++, Python, Perl, Modern Graphics APIs (DirectX, OpenGL, Vulkan), GPU Computing (CUDA, OpenCL), Revision Control (Perforce, Git), HPC (MPI, OpenMP) \nClick here to learn more about NVIDIA, our early talent programs, benefits offered to students and other helpful student resources related to our latest technologies and endeavors. \nOur internship hourly rates are a standard pay based on the position, your location, year in school, degree, and experience. The hourly rate for our interns is 20 USD - 71 USD.\nYou will also be eligible for Intern benefits. \nApplications are accepted on an ongoing basis.\n\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/US-CA-Santa-Clara/NVIDIA-2026-Internships--Computer-Architecture_JR2003201-1",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T13:25:21.442860"
  },
  {
    "title": "NVIDIA 2026 Internships: Deep Learning Computer Architecture",
    "location": "US, CA, Santa Clara, US, CA, Santa Clara, US, CA, Santa Clara",
    "experience_required": "",
    "job_description": "By submitting your resume, you’re expressing interest in one of our 2026 Deep Learning Computer Architecture Internships. We’ll review resumes on an ongoing basis, and a recruiter may reach out if your experience fits one of our many internship opportunities. \n NVIDIA pioneered accelerated computing to tackle challenges no one else can solve. Our work in AI and digital twins is transforming the world's largest industries and profoundly impacting society — from gaming to robotics, self-driving cars to life-saving healthcare, climate change to virtual worlds where we can all connect and create. \n Our internships offer an excellent opportunity to expand your career and get hands on experience with one of our industry leading Deep Learning Computer Architecture teams. We’re seeking strategic, ambitious, hard-working, and creative individuals who are passionate about helping us tackle challenges no one else can solve. \n Throughout the 12-week full-time internship, students will work on projects that have a measurable impact on our business. We’re looking for students pursuing Bachelor's, Master's, or PhD degree within a relevant or related field. \n What we need to see: \nMust be actively enrolled in a university pursuing a Bachelor's, Master's, or PhD degree in Electrical Engineering, Computer Engineering, or a related field, for the entire duration of the internship.     \nCourse or internship experience related to the following areas could be required:  \nComputer Architecture experience in one or more of these focus areas: GPU Architecture, CPU Architecture, Deep Learning, GPU Computing, Parallel Programming, or High-Performance Computing Systems    \nGPU Computing (CUDA, OpenCL, OpenACC), GPU Memory Systems, Deep Learning Frameworks (PyTorch, TensorFlow, Keras, Caffe), HPC (MPI, OpenMP)   \nModelling/Performance Analysis, Parallel Processing, Neural Network Architectures, GPU Acceleration, Deep Learning Neural Networks, Compiler Programming  \nPerformance Modeling, Profiling, Optimizing, and/or Analysis \nDepending on the internship role, prior experience or knowledge requirements could include the following programming skills and technologies:  \nC, C++, Python, Perl, GPU Computing (CUDA, OpenCL, OpenACC), Deep Learning Frameworks (PyTorch, TensorFlow, Caffe), HPC (MPI, OpenMP) \nClick here to learn more about NVIDIA, our early talent programs, benefits offered to students and other helpful student resources related to our latest technologies and endeavors. \nOur internship hourly rates are a standard pay based on the position, your location, year in school, degree, and experience. The hourly rate for our interns is 20 USD - 71 USD.\nYou will also be eligible for Intern benefits. \nApplications are accepted on an ongoing basis.\n\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/US-CA-Santa-Clara/NVIDIA-2026-Internships--Deep-Learning-Computer-Architecture_JR2003202",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T13:25:24.654903"
  },
  {
    "title": "NVIDIA 2026 Internships: Systems Software Engineering",
    "location": "US, CA, Santa Clara, US, CA, Santa Clara, US, CA, Santa Clara",
    "experience_required": "",
    "job_description": "By submitting your resume, you’re expressing interest in one of our 2026 Systems Software Engineering Internships. We’ll review resumes on an ongoing basis, and a recruiter may reach out if your experience fits one of our many internship opportunities. \n NVIDIA pioneered accelerated computing to tackle challenges no one else can solve. Our work in AI and digital twins is transforming the world's largest industries and profoundly impacting society — from gaming to robotics, self-driving cars to life-saving healthcare, climate change to virtual worlds where we can all connect and create. \n Our internships offer an excellent opportunity to expand your career and get hands on experience with one of our industry leading Systems Software teams. We’re seeking strategic, ambitious, hard-working, and creative individuals who are passionate about helping us tackle challenges no one else can solve. \n Throughout the 12-week full-time internship, students will work on projects that have a measurable impact on our business. We’re looking for students pursuing Bachelor's, Master's, or PhD degree within a relevant or related field. \n Potential Internships in this field include:  \nSystems Software \nDefining, designing, and developing integrated (e.g., Jetson Orin) and discrete (e.g., Hopper H100) GPU system software components (e.g., runtime, math libraries) with focus on power and performance, as well as creating architecture and design specifications \nCourse or internship experience related to the following areas could be required: Operating Systems (Threads, Process Control, Memory/Resource Management, Virtual Memory), Multithreaded Debugging, Linux Kernel Development, RTOS Development on Embedded Platforms, Data Structures & Algorithms (time/space complexity), Computer Networking (TPC/IP, OSI Model, Sockets)   \nGraphics Systems Software \nDesigning and implementing of OpenGL, OpenGL ES, and Vulkan graphics drivers, platform support, and conformance tests to support new hardware features in collaboration with other software, hardware, architecture, and support teams \nTraining and debugging various issues within the Tegra graphics software stack \nCourse or internship experience related to the following areas could be required: Computer Architecture, Operating Systems, Real-Time Systems Development, Device Driver Programming, Game Console Middleware, or other Low-Level Library Development, 3D/2D Graphics Theory, Implementation & Optimizations, Simulation or Emulation (writing & debugging tests)  \n Compiler \nWorking at the center of deep-learning compiler technology, spanning architecture design and support through functional languages \nInvestigating problems or optimization opportunities within the Compiler backend by working with global compiler, hardware, and application teams to oversee improvements and problem resolutions  \nCourse or internship experience related to the following areas could be required: Operating Systems Compiler, Compiler Construction, Advanced Algorithms and Data Structures, Computer Architecture, Compiler Development, Open Source Programming, High-Performance Computing (HPC), Automation Tools (XLA, TVM, Halide), Open Source Tools (CLANG, LLBM, gcc) \nFirmware & Embedded Software \nSupporting development of firmware run on embedded microcontrollers within GPUs, while optimizing software to improve system robustness, performance, and security \nParticipating in testing new and existing firmware, and developing tools and infrastructure to improve our front-end design and verification process  \nCourse or internship experience related to the following areas could be required: Operating Systems (Threads, Process Control, Memory/Resource Management, Virtual Memory), Embedded Systems (Processors, Firmware, Input/Output Devices and Memory), Real-Time Performance, Low-Level Development, Data Structures & Algorithms, Computer Architecture, Computer Systems Software, Linux Kernel Development, Multi-Threaded or Multi-Process Programming, RTOS Development on Embedded Platforms \nSoftware Security \nHardening and developing secure solutions across the software stack, spanning multi-node supercomputers down to microcontrollers and security co-processors \nBuilding tools and infrastructure to scale security efforts across large organizations and codebases with millions of lines of code \nCourse or internship experience related to the following areas could be required: Operating Systems, Data Structures & Algorithms, Computer Networking, Network Security, Cryptography, Computer Systems Architecture, Microcontroller and Microprocessor fundamentals (Caches, Buses, Memory Controllers, DMA, etc.)  \nWhat we need to see:  \nMust be actively enrolled in a university pursuing a Bachelor's, Master's, or PhD degree in Electrical Engineering, Computer Engineering, or a related field, for the entire duration of the internship.       \nDepending on the internship role, prior experience or knowledge requirements could include the following programming skills and technologies:  \nC, C++, CUDA, x86, ARM CPU, GPU, Embedded C, Linux, Linux Kernel Development, Perl, Bash/Shell Scripting \nOperating Systems (Threads, Process Control, Memory/Resource Management, Virtual Memory), Formal Verification Tools (Spark, Frama-C), Linux Kernel Development, Multi-Threaded or Multi-Process Programming, Computer Networking (TPC/IP, OSI Model, Sockets), Open Source Tools (CLANG, LLBM, gcc), Testing Production/Automation Tools (XLA, TVM, Halide), Microprocessor Fundamentals (Caches, Buses, Memory Controllers, DMA, etc.)    \nClick here to learn more about NVIDIA, our early talent programs, benefits offered to students and other helpful student resources related to our latest technologies and endeavors. \nOur internship hourly rates are a standard pay based on the position, your location, year in school, degree, and experience. The hourly rate for our interns is 20 USD - 71 USD.\nYou will also be eligible for Intern benefits. \nApplications are accepted on an ongoing basis.\n\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/US-CA-Santa-Clara/NVIDIA-2026-Internships--Systems-Software-Engineering_JR2003204",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T13:25:27.855849"
  },
  {
    "title": "NVIDIA 2026 Internships: Autonomous Vehicles and Robotics",
    "location": "US, CA, Santa Clara, US, CA, Santa Clara, 3 Locations",
    "experience_required": "",
    "job_description": "By submitting your resume, you’re expressing interest in one of our 2026 Autonomous Vehicles and Robotics Internships. We’ll review resumes on an ongoing basis, and a recruiter may reach out if your experience fits one of our many internship opportunities. \n NVIDIA pioneered accelerated computing to tackle challenges no one else can solve. Our work in AI and digital twins is transforming the world's largest industries and profoundly impacting society — from gaming to robotics, self-driving cars to life-saving healthcare, climate change to virtual worlds where we can all connect and create.   \n Our internships offer an excellent opportunity to expand your career and get hands on experience with one of our industry leading Autonomous Vehicles and Robotics teams. We’re seeking strategic, ambitious, hard-working, and creative individuals who are passionate about helping us tackle challenges no one else can solve. \n Throughout the 12-week full-time internship, students will work on projects that have a measurable impact on our business. We’re looking for students pursuing Bachelor's, Master's, or PhD degree within a relevant or related field. \n Potential Internships in this field include:  \nAutonomous Vehicles \nDeveloping and training state-of-the-art Deep Neural Networks for path generation \nCollecting training datasets and real-time inference run-times using simulators/gyms as well as performing in-vehicle tests \nCourse or internship experience related to the following areas could be required: Computer Vision, Mapping, Localization, SLAM, Image Processing, Segmentation \nRobotics \nBuilding the fundamental infrastructure and software platforms of our system, working at the very heart of the software system, which will power every robot and application built with Isaac \nCourse or internship experience related to the following areas could be required: Robotics, Autonomous Vehicles, Validation Frameworks for Deep Learning, Operating Systems and Data Structures (threads, processes, memory, synchronization), Physics Simulation, Simulators, Computer Graphics, Version Control, Computer Vision, Cloud Technologies \nWhat we need to see:  \nMust be actively enrolled in a university pursuing a Bachelor's, Master's, or PhD degree in Electrical Engineering, Computer Engineering, or a related field, for the entire duration of the internship.     \nDepending on the internship role, prior experience or knowledge requirements could include the following programming skills and technologies: \nC, C++, CUDA, ROS, Python, OpenGL, Linux, Sensor Input Devices (LiDAR, cameras, radars), Training Frameworks (TensorFlow, Keras, PyTorch)  \n Click here to learn more about NVIDIA, our early talent programs, benefits offered to students and other helpful student resources related to our latest technologies and endeavors. \nOur internship hourly rates are a standard pay based on the position, your location, year in school, degree, and experience. The hourly rate for our interns is 20 USD - 71 USD.\nYou will also be eligible for Intern benefits. \nApplications are accepted on an ongoing basis.\n\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/US-CA-Santa-Clara/NVIDIA-2026-Internships--Autonomous-Vehicles-and-Robotics_JR2003207",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T13:25:31.043693"
  },
  {
    "title": "NVIDIA 2026 Internships: Software Engineering",
    "location": "US, CA, Santa Clara, US, CA, Santa Clara, US, CA, Santa Clara",
    "experience_required": "",
    "job_description": "By submitting your resume, you’re expressing interest in one of our 2026 Software Engineering Internships. We’ll review resumes on an ongoing basis, and a recruiter may reach out if your experience fits one of our many internship opportunities. \n NVIDIA pioneered accelerated computing to tackle challenges no one else can solve. Our work in AI and digital twins is transforming the world's largest industries and profoundly impacting society — from gaming to robotics, self-driving cars to life-saving healthcare, climate change to virtual worlds where we can all connect and create. \n Our internships offer an excellent opportunity to expand your career and get hands on experience with one of our industry leading Software teams. We’re seeking strategic, ambitious, hard-working, and creative individuals who are passionate about helping us tackle challenges no one else can solve. \n Throughout the 12-week full-time internship, students will work on projects that have a measurable impact on our business. We’re looking for students pursuing Bachelor's, Master's, or PhD degree within a relevant or related field.  \n Potential Internships in this field include:  \nDevelopment Tools \nDebugging complex system-level issues using Jenkins  \nCourse or internship experience related to the following areas could be required: Relational Databases, Linear Algebra & Numerical Methods, Operating Systems (memory/resource management), Scheduling and Process Control, Hardware Virtualization \nCloud \nSupporting overall architecture and design of our cloud storage infrastructure  \nImplementing and troubleshooting storage and data platform tools, automating storage infrastructure end-to-end \nCourse or internship experience related to the following areas could be required: Distributed Systems, Data Structures & Algorithms, Virtualization, Automation/Scripting, Container & Cluster Management, Debugging \nTools Infrastructure \nBuilding industry leading technology by proving workflows and infrastructure, alongside a team of experts in production software development and chip design methodologies \nEnabling success for content running on the chip from application tracing and analysis to modeling, diagnostics, performance tuning, and debugging  \nCourse or internship experience related to the following areas and technologies could be required: Unix/Shell Scripting, Linux, Java, JavaScript (including Node, React, Vue), C++, CUDA, OOP, Go, Python, Git, GitLab, Perforce, Kubernetes and Microservices, Schedulers (LSF, SLURM), Containers (Docker), Configuration Automation (Ansible) \nMachine Learning Operations \nDeep Learning, GPU Computing, Accelerated Computing \nValidation Frameworks for Deep Learning, Deep Learning Frameworks and Libraries (NumPy, SciPy, cuBLAS, cuDNN) \nData Preprocessing, Training Acceleration (CUDA, cuDNN, NCCL), Convolution Operations (cuDNN), Real-Time Inference (TensorRT)   \nBuilding Infrastructure for Back-End Analytics  \nWhat we need to see:  \nMust be actively enrolled in a university pursuing a Bachelor's, Master's, or PhD degree in Electrical Engineering, Computer Engineering, or a related field, for the entire duration of the internship.        \nDepending on the internship role, prior experience or knowledge requirements could include the following programming skills and technologies: \nJava, JavaScript, (including Node, React, Vue), SQL, C, C++, CUDA, OOP, Go, Python, Git, Perforce, Kubernetes and Microservices, Schedulers (LSF, SLURM), Containers (Docker), Configuration Automation (Ansible)  \n Click here to learn more about NVIDIA, our early talent programs, benefits offered to students and other helpful student resources related to our latest technologies and endeavors. \nOur internship hourly rates are a standard pay based on the position, your location, year in school, degree, and experience. The hourly rate for our interns is 20 USD - 71 USD.\nYou will also be eligible for Intern benefits. \nApplications are accepted on an ongoing basis.\n\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/US-CA-Santa-Clara/NVIDIA-2026-Internships--Software-Engineering-_JR2003206",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T13:25:34.231629"
  },
  {
    "title": "NVIDIA 2026 Internships: Deep Learning",
    "location": "US, CA, Santa Clara, US, CA, Santa Clara, US, CA, Santa Clara",
    "experience_required": "",
    "job_description": "By submitting your resume, you’re expressing interest in one of our 2026 Deep Learning Internships. We’ll review resumes on an ongoing basis, and a recruiter may reach out if your experience fits one of our many internship opportunities. \n NVIDIA pioneered accelerated computing to tackle challenges no one else can solve. Our work in AI and digital twins is transforming the world's largest industries and profoundly impacting society — from gaming to robotics, self-driving cars to life-saving healthcare, climate change to virtual worlds where we can all connect and create.   \n Our internships offer an excellent opportunity to expand your career and get hands on experience with one of our industry leading Deep Learning teams. We’re seeking strategic, ambitious, hard-working, and creative individuals who are passionate about helping us tackle challenges no one else can solve. \n Throughout the 12-week full-time internship, students will work on projects that have a measurable impact on our business. We’re looking for students pursuing Bachelor's, Master's, or PhD degree within a relevant or related field. \n Potential Internships in this field include:  \nDeep Learning Applications & Algorithms \nDeveloping algorithms for deep learning, data analytics, or scientific computing to improving performance of GPU implementations \nCourse or internship experience related to the following areas could be required: Deep Neural Networks, Linear Algebra, Numerical Methods and/or Computer Vision, Software Design, Computer Memory (Disk, Memory, Caches), CPU and GPU Architectures, Networking, Numeric Libraries, Embedded System Design and Development, Drivers, Real-Time Software \nDeep Learning Frameworks & Libraries \nBuilding underlying frameworks and libraries to accelerate Deep Learning on GPUs \nContributing directly to software packages such as JAX, PyTorch, and TensorFlow, integrating the latest library (e.g., cuDNN) or CUDA features, performance tuning, and analysis \nOptimizing core deep learning algorithms and libraries (e.g., CuDNN, CuBLAS), maintaining build, test, and distribution infrastructure for these libraries and deep learning frameworks on NVIDIA supported platforms \nCourse or internship experience related to the following areas could be required: Computer Architecture (CPUs, GPUs, FPGAs or other accelerators), GPU Programming Models, Performance-Oriented Parallel Programming, Optimizing for High-Performance Computing (HPC), Algorithms, Numerical Methods \nWhat we need to see:  \nMust be actively enrolled in a university pursuing a Bachelor's, Master's, or PhD degree in Electrical Engineering, Computer Engineering, or a related field, for the entire duration of the internship. \nDepending on the internship role, prior experience or knowledge requirements could include the following programming skills and technologies: \nC, C++, CUDA, Python, x86, ARM CPU, GPU, Linux, Direct3D, Vulkan, OpenGL, OpenCL, Spark, Perl, Bash/Shell Scripting, Container Tools (Docker/Containers, Kubernetes), Infrastructure Platforms (AWS, Azure, GCP), Data Technologies (Kafka, ELK, Cassandra, Apache Spark), React, Go \n Click here to learn more about NVIDIA, our early talent programs, benefits offered to students and other helpful student resources related to our latest technologies and endeavors. \nOur internship hourly rates are a standard pay based on the position, your location, year in school, degree, and experience. The hourly rate for our interns is 20 USD - 71 USD.\nYou will also be eligible for Intern benefits. \nApplications are accepted on an ongoing basis.\n\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/US-CA-Santa-Clara/NVIDIA-2026-Internships--Deep-Learning_JR2003208",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T13:25:37.434129"
  },
  {
    "title": "NVIDIA 2026 Internships: PhD Computer Vision and Deep Learning Research",
    "location": "US, CA, Santa Clara, US, CA, Santa Clara, US, CA, Santa Clara",
    "experience_required": "",
    "job_description": "By submitting your resume, you’re expressing interest in one of our 2026 Computer Vision and Deep Learning focused Research Internships. We’ll review resumes on an ongoing basis, and a recruiter may reach out if your experience fits one of our many internship opportunities. \n NVIDIA pioneered accelerated computing to tackle challenges no one else can solve. Our work in AI and digital twins is transforming the world's largest industries and profoundly impacting society — from gaming to robotics, self-driving cars to life-saving healthcare, climate change to virtual worlds where we can all connect and create. \n Our internships offer an excellent opportunity to expand your career and get hands on experience with one of our industry leading Computer Vision and Deep Learning teams. We’re seeking strategic, ambitious, hard-working, and creative individuals who are passionate about helping us tackle challenges no one else can solve. \n Learn more about Research at NVIDIA. \n What you will be doing: \nDesign and implement novel computer vision and deep learning methods. \nCollaborate with other team members, teams, and/or external researchers. \nTransfer your research to product groups to enable new products or types of products. Deliverable results include prototypes, patents, products, and/or publishing original research. \n What we need to see: \nMust be actively enrolled in a university pursuing a PhD degree in Computer Science, Electrical Engineering, or a related field, for the entire duration of the internship.     \nDepending on the internship, prior experience or knowledge requirements could include the following programming skills and technologies:  \nPython, C++, CUDA, Deep Learning Frameworks (PyTorch, TensorFlow, etc.) \nStrong background in research with publications at top conferences. \nExcellent communication and collaboration skills. \nExperience with large-scale model training is a plus. \n Potential internships require research experience in at least one of the following areas: \n3D Vision and Scene Understanding \nOptical Flow/Scene Flow \nSLAM \nDepth Estimation \nDigital Twins \nHuman-Centric Vision \nHuman Motion Modeling \nHuman avatar creation (Gaussian Avatar, Neural Human Avatars, Text to Avatar Generation) \nPhysics-Based Clothing/Hair/Body Simulation \nNeural Rendering and Generative 3D \nDiffusion Models \nWorld Models \nNeural Radiance Fields (NeRFs) \nNovel View Synthesis \n3D Content Creation \nModel Architectures and Efficiency \nEfficient Deep Learning \nModel pruning and compression \nEfficient vision transformers \nNeural Architecture Search (NAS) \nMultimodal and Vision-Language Models \nSynthetic data generation \nWeather and Atmospheric Simulation \n Click here to learn more about NVIDIA, our early talent programs, benefits offered to students and other helpful student resources related to our latest technologies and endeavors. \nOur internship hourly rates are a standard pay based on the position, your location, year in school, degree, and experience. The hourly rate for our interns is 30 USD - 94 USD.\nYou will also be eligible for Intern benefits. \nApplications are accepted on an ongoing basis.\n\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/US-CA-Santa-Clara/NVIDIA-2026-Internships--PhD-Computer-Vision-and-Deep-Learning-Research_JR2003241",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T13:25:40.635790"
  },
  {
    "title": "NVIDIA 2026 Internships: PhD Generative AI Research",
    "location": "",
    "experience_required": "",
    "job_description": "",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/US-CA-Santa-Clara/NVIDIA-2026-Internships--PhD-Generative-AI-Research_JR2003228",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T13:25:43.764166"
  },
  {
    "title": "NVIDIA 2026 Internships: PhD Graphics and Simulation Research",
    "location": "US, CA, Santa Clara, US, CA, Santa Clara, US, CA, Santa Clara",
    "experience_required": "",
    "job_description": "By submitting your resume, you’re expressing interest in one of our 2026 Graphics and/or Simulation focused Research Internships. We’ll review resumes on an ongoing basis, and a recruiter may reach out if your experience fits one of our many internship opportunities. \n NVIDIA pioneered accelerated computing to tackle challenges no one else can solve. Our work in AI and digital twins is transforming the world's largest industries and profoundly impacting society — from gaming to robotics, self-driving cars to life-saving healthcare, climate change to virtual worlds where we can all connect and create. \n Our internships offer an excellent opportunity to expand your career and get hands on experience with one of our industry leading Graphics and Simulation teams. We’re seeking strategic, ambitious, hard-working, and creative individuals who are passionate about helping us tackle challenges no one else can solve. \n Learn more about Research at NVIDIA. \n What you will be doing: \nDesign and develop algorithms, hardware, and software that advance the state of the art in computing, graphics, media processing, and other technologies central to NVIDIA’s business. \nInvent new techniques, technologies, methodologies, processes, and devices, to enable new products or types of products. Deliverable results may include prototypes, patents, leading to products and publications. \nCollaborate with other team members, teams, and/or external researchers. \n What we need to see: \nMust be actively enrolled in a university pursuing a PhD degree in Computer Science, Electrical Engineering, or a related field, for the entire duration of the internship.     \nDepending on the internship, prior experience or knowledge requirements could include the following programming skills and technologies:  \nPython, C, CUDA, HLSL/GLSL, ML Frameworks (PyTorch, JAX, Warp) \nStrong background in research with publications at top conferences. \nExcellent communication and collaboration skills. \nExperience with large-scale model training is a plus. \n Potential internships require research experience in at least one of the following areas: \nReal-Time Graphics and Rendering \nDifferentiable Rendering \nRay Tracing and Path Tracing \nNeural Rendering Models \nLight Transport and Material/Shape Modeling \nSimulation and Animation \nPhysics-based simulation \nWorld models \nDeep learning for animation \n3D and 4D Content Creation \nVirtual and augmented reality environments \nGenerative AI for graphics, simulation, and content creation \n3D Deep Learning \nDigital human creation \nHuman motion modeling \nGPU-accelerated algorithms and systems for graphics and simulation \nSynthetic data generation \n Click here to learn more about NVIDIA, our early talent programs, benefits offered to students and other helpful student resources related to our latest technologies and endeavors. \nOur internship hourly rates are a standard pay based on the position, your location, year in school, degree, and experience. The hourly rate for our interns is 30 USD - 94 USD.\nYou will also be eligible for Intern benefits. \nApplications are accepted on an ongoing basis.\n\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/US-CA-Santa-Clara/NVIDIA-2026-Internships--PhD-Graphics-and-Simulation-Research_JR2003242",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T13:25:46.970001"
  },
  {
    "title": "NVIDIA 2026 Internships: PhD Large Language Models Research",
    "location": "US, CA, Santa Clara, US, CA, Santa Clara, US, CA, Santa Clara",
    "experience_required": "",
    "job_description": "By submitting your resume, you’re expressing interest in one of our 2026 Large Language Models focused Research Internships. We’ll review resumes on an ongoing basis, and a recruiter may reach out if your experience fits one of our many internship opportunities. \n NVIDIA pioneered accelerated computing to tackle challenges no one else can solve. Our work in AI and digital twins is transforming the world's largest industries and profoundly impacting society — from gaming to robotics, self-driving cars to life-saving healthcare, climate change to virtual worlds where we can all connect and create. \n Our internships offer an excellent opportunity to expand your career and get hands on experience with one of our industry leading LLM teams. We’re seeking strategic, ambitious, hard-working, and creative individuals who are passionate about helping us tackle challenges no one else can solve. \n Learn more about Research at NVIDIA. \n What you will be doing: \nResearch and develop novel methods for advancing the capabilities of large language and multimodal models. \nCollaborate with other team members, teams, and/or external researchers. \nTransfer your research to product groups to enable new products or types of products. Deliverable results include prototypes, patents, products, and/or publishing original research. \n What we need to see: \nMust be actively enrolled in a university pursuing a PhD degree in Computer Science, Electrical Engineering, or a related field, for the entire duration of the internship.     \nDepending on the internship, prior experience or knowledge requirements could include the following programming skills and technologies:  \nPython, C++, CUDA, Deep Learning Framworks (PyTorch, Tensorflow, JAX, etc.) \nStrong background in research with publications at top conferences. \nExcellent communication and collaboration skills. \nExperience with large-scale model training is a plus. \n Potential internships require research experience in at least one of the following areas: \nLarge Language Models and Foundation Models \nTransformer architectures \nKnowledge distillation and data synthesis \nLong-context methods \nModel Efficiency and Optimization \nModel compression and pruning \nQuantization \nInference optimization and acceleration \nParameter-efficient fine-tuning \nNeural Architecture Search (NAS) \nTraining and Alignment \nLarge-scale model training \nInstruction tuning \nReinforcement Learning \nAdvanced reasoning and test-time inference \nFew-shot and zero-shot learning \nSynthethic data generation \nMultimodal and Vision Language Models \nRetrieval-Augmented Generation (RAG) \n Click here to learn more about NVIDIA, our early talent programs, benefits offered to students and other helpful student resources related to our latest technologies and endeavors. \nOur internship hourly rates are a standard pay based on the position, your location, year in school, degree, and experience. The hourly rate for our interns is 30 USD - 94 USD.\nYou will also be eligible for Intern benefits. \nApplications are accepted on an ongoing basis.\n\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/US-CA-Santa-Clara/NVIDIA-2026-Internships--PhD-Large-Language-Models-Research_JR2003243",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T13:25:50.183811"
  },
  {
    "title": "NVIDIA 2026 Internships: PhD Autonomous Vehicles Research",
    "location": "US, CA, Santa Clara, US, CA, Santa Clara, US, CA, Santa Clara",
    "experience_required": "",
    "job_description": "By submitting your resume, you’re expressing interest in one of our 2026 Autonomous Vehicles focused Research Internships. We’ll review resumes on an ongoing basis, and a recruiter may reach out if your experience fits one of our many internship opportunities. \n NVIDIA pioneered accelerated computing to tackle challenges no one else can solve. Our work in AI and digital twins is transforming the world's largest industries and profoundly impacting society — from gaming to robotics, self-driving cars to life-saving healthcare, climate change to virtual worlds where we can all connect and create. \n Our internships offer an excellent opportunity to expand your career and get hands on experience with one of our industry leading Autonomous Vehicles teams. We’re seeking strategic, ambitious, hard-working, and creative individuals who are passionate about helping us tackle challenges no one else can solve. \n Learn more about Research at NVIDIA. \n What you will be doing: \nDesign and implement cutting-edge techniques in the field of vehicle autonomy. \nCollaborate with other team members, teams, and/or external researchers. \nTransfer your research to product groups to enable new products or types of products. Deliverable results include prototypes, patents, products, and/or publishing original research. \n What we need to see: \nMust be actively enrolled in a university pursuing a PhD degree in Computer Science, Electrical Engineering, or a related field, for the entire duration of the internship.     \nDepending on the internship, prior experience or knowledge requirements could include the following programming skills and technologies:  \nPython, C++, CUDA, Deep Learning Frameworks (PyTorch, TensorFlow, etc.) \nStrong background in research with publications at top conferences. \nExcellent communication and collaboration skills. \nExperience with large-scale model training is a plus. \n Potential internships require research experience in at least one of the following areas: \nNext-Generation AV Architectures \nChain-of-Thought Reasoning \nMixture-of-Experts \nDiffusion-LLMs \nDiffusion-based Trajectory Decoding \nNovel Policy Training Strategies \nClosed-loop Training \nOff-policy RL \nOnline RL \nEnforcing Consistency \nFoundation and Multimodal Models \nVision-language models \nMultimodal reasoning \nSpatial Multimodal Models \nModality Alignment \nModel Scaling \nSynthetic data \nInference Efficiency \nInference Optimizations (e.g., parallel decoding, speculative decoding) \nToken Representations \nModel Distillation \nSimulation and Behavior Modeling \nDigital Twins \nScenario Generation \nWorld Models \nBehavior/Traffic Modeling \nEnd-to-End AV Systems \nMapless driving \nWorld Representations \nBeyond imitation learning \nSafety-aware end-to-end models \nPerception and Representation Learning \nMulti-modal sensor fusion \n2D/3D detection, segmentation, depth estimation, scene understanding, neural representations \nSafe and Trustworthy Autonomous Systems \nPrincipled robustness \nModel explainability \nControl Barrier Functions (CBFs) \nVerification and Validation of Safety-Critical AI Systems \nTrustworthy AI/ML for autonomy and robotics \nData-Strategies for AI \nBenchmarking AV \n Click here to learn more about NVIDIA, our early talent programs, benefits offered to students and other helpful student resources related to our latest technologies and endeavors. \nOur internship hourly rates are a standard pay based on the position, your location, year in school, degree, and experience. The hourly rate for our interns is 30 USD - 94 USD.\nYou will also be eligible for Intern benefits. \nApplications are accepted on an ongoing basis.\n\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/US-CA-Santa-Clara/NVIDIA-2026-Internships--PhD-Autonomous-Vehicles-Research_JR2003244",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T13:25:53.387831"
  },
  {
    "title": "NVIDIA 2026 Internships: PhD Robotics Research",
    "location": "US, CA, Santa Clara, US, CA, Santa Clara, US, CA, Santa Clara",
    "experience_required": "",
    "job_description": "By submitting your resume, you’re expressing interest in one of our 2026 Robotics focused Research Internships. We’ll review resumes on an ongoing basis, and a recruiter may reach out if your experience fits one of our many internship opportunities. \n NVIDIA pioneered accelerated computing to tackle challenges no one else can solve. Our work in AI and digital twins is transforming the world's largest industries and profoundly impacting society — from gaming to robotics, self-driving cars to life-saving healthcare, climate change to virtual worlds where we can all connect and create. \n Our internships offer an excellent opportunity to expand your career and get hands on experience with one of our industry leading Robotics teams. We’re seeking strategic, ambitious, hard-working, and creative individuals who are passionate about helping us tackle challenges no one else can solve. \n Learn more about Research at NVIDIA. \n What you will be doing: \nWork with experts in robotics and learn to define your research project. \nDesign and implement novel robotics methods. \nCollaborate with other research team members and a diverse set of internal product teams. \nTransfer your research to product groups to enable new products or types of products. Deliverable results include prototypes, patents, products, and/or publishing original research. \n What we need to see: \nMust be actively enrolled in a university pursuing a PhD degree in Computer Science, Electrical Engineering, or a related field, for the entire duration of the internship.     \nDepending on the internship, prior experience or knowledge requirements could include the following programming skills and technologies:  \nPython, C++, CUDA, Deep Learning Frameworks (PyTorch, JAX, Tensorflow, etc.), Physics Simulation Frameworks (Issac Sim/Lab, MuJoCo, etc.)P \nStrong background in research with publications at top conferences. \nExcellent communication and collaboration skills. \nExperience with large-scale model training is a plus. \n Potential internships require research experience in at least one of the following areas: \nRobotic Manipulation and Control \nDexterous Manipulation \nHumanoid Loco-Manipulation \nRobot Kinematics, Dynamics, and Sensors \nPerception and World Understanding \nRobot Perception \nVision Language Action (VLA) Models \nRobot Learning and Reasoning \nFoundation Models for Robotics \nImitation and Reinforcement Learning \nSimulation, sim-to-real, real-to-sim \nMotion Planning and Navigation \nSynthetic Data Generation \n Click here to learn more about NVIDIA, our early talent programs, benefits offered to students and other helpful student resources related to our latest technologies and endeavors. \nOur internship hourly rates are a standard pay based on the position, your location, year in school, degree, and experience. The hourly rate for our interns is 30 USD - 94 USD.\nYou will also be eligible for Intern benefits. \nApplications are accepted on an ongoing basis.\n\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/US-CA-Santa-Clara/NVIDIA-2026-Internships--PhD-Robotics-Research_JR2003245",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T13:25:56.571948"
  },
  {
    "title": "NVIDIA 2026 Internships: PhD Computer Architecture and Systems Research",
    "location": "US, CA, Santa Clara, US, CA, Santa Clara, US, CA, Santa Clara",
    "experience_required": "",
    "job_description": "By submitting your resume, you’re expressing interest in one of our 2026 Computer Architecture and/or Systems focused Research Internships. We’ll review resumes on an ongoing basis, and a recruiter may reach out if your experience fits one of our many internship opportunities. \n NVIDIA pioneered accelerated computing to tackle challenges no one else can solve. Our work in AI and digital twins is transforming the world's largest industries and profoundly impacting society — from gaming to robotics, self-driving cars to life-saving healthcare, climate change to virtual worlds where we can all connect and create. \n Our internships offer an excellent opportunity to expand your career and get hands on experience with one of our industry leading Computer Architecture and Systems teams. We’re seeking strategic, ambitious, hard-working, and creative individuals who are passionate about helping us tackle challenges no one else can solve. \n Learn more about Research at NVIDIA. \n What you will be doing: \nDesign and implement algorithms, hardware, and software solutions that advance computing, graphics, media processing, and related technologies central to NVIDIA's innovation. \nCollaborate with other team members, teams, and/or external researchers. \nTransfer your research to product groups to enable new products or types of products. Deliverable results include prototypes, patents, products, and/or publishing original research. \n What we need to see: \nMust be actively enrolled in a university pursuing a PhD degree in Computer Science, Electrical Engineering, or a related field, for the entire duration of the internship.     \nDepending on the internship, prior experience or knowledge requirements could include the following programming skills and technologies:  \nC, C++, Perl, Python, CUDA. \nStrong background in research with publications at top conferences. \nExcellent communication and collaboration skills. \n Potential internships require research experience in at least one of the following areas: \nHardware-software co-design \nComputer Architecture \nGPU and Multi-GPU Architecture \nScalable memory systems \nSystem-level GPU scheduling \nPower, performance, and energy-efficiency in large-scale systems \nProgramming Systems \nParallel Computing \nOptimizing GPU-accelerated workloads \nDistributed Computing \nCompilers \nHigh-Performance Networking and Interconnects \nLarge-scale GPU networking \nTopologies, routing, and congestion control \nCircuits and microarchitecture for network controllers and switches \nVLSI and Electronic Design Automation (EDA) \nGPU Accelerated EDA \nSystems for AI/ML \nSystems Infrastructure for large LLM training and inference \nML for hardware systems (ML for EDA) \n Click here to learn more about NVIDIA, our early talent programs, benefits offered to students and other helpful student resources related to our latest technologies and endeavors. \nOur internship hourly rates are a standard pay based on the position, your location, year in school, degree, and experience. The hourly rate for our interns is 30 USD - 94 USD.\nYou will also be eligible for Intern benefits. \nApplications are accepted on an ongoing basis.\n\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/US-CA-Santa-Clara/NVIDIA-2026-Internships--PhD-Computer-Architecture-and-Systems-Research_JR2003246",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T13:25:59.790776"
  },
  {
    "title": "NVIDIA 2026 Internships: PhD Hardware Research",
    "location": "US, CA, Santa Clara, US, CA, Santa Clara, US, CA, Santa Clara",
    "experience_required": "",
    "job_description": "By submitting your resume, you’re expressing interest in one of our 2026 Hardware focused Research Internships. We’ll review resumes on an ongoing basis, and a recruiter may reach out if your experience fits one of our many internship opportunities. \n NVIDIA pioneered accelerated computing to tackle challenges no one else can solve. Our work in AI and digital twins is transforming the world's largest industries and profoundly impacting society — from gaming to robotics, self-driving cars to life-saving healthcare, climate change to virtual worlds where we can all connect and create. \n Our internships offer an excellent opportunity to expand your career and get hands on experience with one of our industry leading Hardware teams. We’re seeking strategic, ambitious, hard-working, and creative individuals who are passionate about helping us tackle challenges no one else can solve. \n Learn more about Research at NVIDIA. \n What you will be doing: \nDesign and implement novel approaches to circuit and VLSI design, including ASIC development and advanced EDA methodologies. \nCollaborate with other team members, teams, and/or external researchers. \nTransfer your research to product groups to enable new products or types of products. Deliverable results include prototypes, patents, products, and/or publishing original research. \n What we need to see: \nMust be actively enrolled in a university pursuing a PhD degree in Computer Science, Electrical Engineering, or a related field, for the entire duration of the internship.     \nDepending on the internship, prior experience or knowledge requirements could include the following programming skills and technologies:  \nPython, C, C++, Perl, MATLAB, CUDA, Verilog, SystemVerilog, CAD tool packages (e.g., Cadence, Synopsys, HFSS), ML Frameworks (e.g., PyTorch), EDA tools \nStrong background in research with publications at top conferences and/or patents. \nExcellent communication and collaboration skills. \n Potential internships require research experience in at least one of the following areas: \nCircuit Design \nPLLs and Clocking Circuits \nSerDes and High-Speed Signaling \nIntegrated Photonics and Optical Interconnects \nSRAMs, Memory Design, and Cache Architectures \nPower Delivery/Regulation \nSecurity Circuits and Hardware Security \nHigh-Speed Logical Design \nNovel Digital VLSI Circuits \nASIC and VLSI \nASIC and VLSI Design Techniques \nML Accelerators \nHardware/software co-design \nElectronic Design Automation \nGPU accelerated EDA \nAgent for Hardware Design \n Click here to learn more about NVIDIA, our early talent programs, benefits offered to students and other helpful student resources related to our latest technologies and endeavors. \nOur internship hourly rates are a standard pay based on the position, your location, year in school, degree, and experience. The hourly rate for our interns is 30 USD - 94 USD.\nYou will also be eligible for Intern benefits. \nApplications are accepted on an ongoing basis.\n\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/US-CA-Santa-Clara/NVIDIA-2026-Internships--PhD-Hardware-Research_JR2003247",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T13:26:03.006006"
  },
  {
    "title": "Senior Cloud Software Services Engineer - Backend",
    "location": "US, CA, Santa Clara, US, Remote, US, WA, Seattle",
    "experience_required": "",
    "job_description": "NVIDIA has been transforming computer graphics, PC gaming, and accelerated computing for more than 25 years. It’s a unique legacy of innovation that’s fueled by great technology—and amazing people. Today, we’re tapping into the unlimited potential of AI to define the next era of computing. An era in which our GPU acts as the brains of computers, robots, and self-driving cars that can understand the world. \nNVIDIA is looking for a strong senior back-end software engineer who can think out of the box, see the big picture, and be diligent to help redefine where GPU Cloud computing is headed. This essential role will give you an unrivaled opportunity to craft and deliver a new class of GPU service platforms for cloud computing in the up-and-coming fields of Deep Learning and AI. You will lead us into a new era of computing while working with the team to learn how we can tackle challenges in the cloud.\nWhat you'll be doing:\nArchitect, Design, plan, and implement complex PaaS for the GPU cloud services.\nHelp drive the underlying technology stack and implementation methodology.\nWork closely with partners, stakeholders, UX and UI designers and front-end engineers on new products or features/improvements of existing products.\nObsessed with modules and/or product(s) consistency across the teams.\nNuts for test-driven development practices, help drive test automation, and CI/CD.\nCustomer focused - support, maintain, and document software functionality.\nWhat we need to see:\nBS/MS in CS or equivalent experience with 12+ years of hands-on experience building complex microservices\nStrong knowledge and experience in OOP concepts and Design Patterns. In-depth experience in design, architecture, and building complex large scale back-end systems - concurrent, distributed system, that’s performant, and highly available\nStrong knowledge of core Java - Collections API, Streams API, Concurrency, I/O. Knowledge in RDBMS and NoSQL (Cassandra, DynamoDb, Redis) databases\nDeep understanding of HTTP REST API, gRPC, security, and networking. Good understanding of API design as results of UX/UI/CLI requirements\nAbility to drive pragmatic technical discussion towards practical solutions - clean architecture/code, reusable, common shared code/framework, testable, and extensible\nLive and breathe Test-Driven development methodologies, and ability to influence other teams and stakeholders to embody this in daily practice. Write tests then code\nDisagree and commit - work across multiple teams, get buy-in and influence other teams on key factors that define the design/architecture of our platform\nStrong ability to debug issues and get to the root cause to improve the stack, while working closely with partners and team members such as DevSecOps, and SRE. Excellent verbal and written communication skills, and excellent team player\nWays to stand out from the crowd:\nExpert in Java, Springboot, Golang, Gatling, Python, Kubernetes and Docker\nFamiliar with InfluxDB, Cassandra, RDS, Elasticsearch, Solr, Splunk\nCloud practitioner - comfortable to work in one or more cloud providers: AWS, GCP, Azure\nExcel working in a dynamic, highly interactive environment. Drive to succeed as a team.\nHunger to achieve better results, dive deeper, invent and deliver faster, but simplify, desire to lead and mentor, and humble to learn new things to share with others\nNVIDIA is widely considered to be one of the technology world’s most desirable employers (#1 in Blind and Glassdoor in 2022). We work with some of the most innovative technologies, forward-thinking and hardworking people in the world. If you are a great teammate who is inquisitive, innovative, driven to succeed, and autonomous, we want to hear from you! NVIDIA is leading the way in groundbreaking developments in Artificial Intelligence, High-Performance Computing and Visualization. The GPU, our invention, serves as the visual cortex of modern computers and is at the heart of our products and services. Our work opens up new universes to explore, enables amazing creativity and discovery, and powers what were once science fiction inventions from artificial intelligence to autonomous cars. NVIDIA is looking for extraordinary people like you to help us accelerate the next wave of artificial intelligence.\nYour base salary will be determined based on your location, experience, and the pay of employees in similar positions. The base salary range is 224,000 USD - 356,500 USD.\nYou will also be eligible for equity and benefits.\nApplications for this job will be accepted at least until September 13, 2025.\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/US-CA-Santa-Clara/Cloud-Software-Services-Engineer---Backend_JR2002779",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T13:26:06.176774"
  },
  {
    "title": "Principal Cloud Software Engineer",
    "location": "US, CA, Santa Clara, US, Remote, US, WA, Seattle, 3 Locations, 3 Locations",
    "experience_required": "",
    "job_description": "Are you ready to help build a better future, solve some of the hardest real-world problems using large scale distributed computing, concurrent and highly available microservices architecture in the cloud? Today, we’re tapping into the unlimited potential of AI to define the next era of computing. An era in which our GPU acts as the brains of computers, robots, and self-driving cars that can understand the world. Doing what’s never been done before takes vision, innovation, and the world’s best talent. As an NVIDIAn, you’ll be immersed in a diverse, supportive environment where everyone is inspired to do their best work.\nNVIDIA is looking for a strong principal cloud software engineer who can think out of the box, see the big picture, and be diligent to help redefine where GPU Cloud computing is headed. This essential role will give you an unrivaled opportunity to craft and deliver a new class of GPU service platforms for cloud computing in the up-and-coming fields of Deep Learning and AI. You will lead us into a new era of computing while working with the team to learn how we can tackle challenges in the cloud.\nWhat you'll be doing:\nDesign and oversee the implementation of robust GPU cloud architectures for scalable and resilient applications.\nDevelop, optimize, and maintain cloud-based software solutions, focusing on performance and reliability.\nWork closely with cross-functional teams to deliver high-quality cloud solutions.\nMentor junior engineers, providing guidance on best practices and technical development.\nIdentify and implement new technologies and methodologies to improve our cloud infrastructure and software development processes.\nMaintain a customer-centric approach by supporting, maintaining, and detailing software functionality.\nWhat we need to see:\nBachelor's or Master's degree in Computer Science, Engineering, or related field (or equivalent experience).\n15+ years of software development experience, with at least 5 years focused on cloud technologies.\nStrong knowledge and experience in OOP concepts and Build Patterns, with in-depth experience in crafting and composing complex, large-scale back-end systems.\nStrong knowledge of core Java - Collections API, Streams API, Concurrency, I/O.\nProficiency in RDBMS and NoSQL databases such as Cassandra, DynamoDB, and Redis.\nDeep understanding of HTTP REST API, gRPC, security, and networking, along with a good grasp of API development influenced by UX/UI/CLI requirements.\nAbility to drive pragmatic technical discussions towards practical solutions that are clean, reusable, testable, and extensible.\nDedication to collaborative development approaches, with the capability to impact daily operations across teams and collaborators.\nStrong analytical and problem-solving skills, with the ability to troubleshoot complex issues.\nWays to stand out from the crowd:\nOperational experience with large-scale applications.\nHold advanced cloud certifications (e.g., AWS Certified Solutions Architect – Professional).\nDemonstrate active participation in open source projects, showcasing your contributions to the community or establishing yourself as an inspiring leader in the field.\nFamiliarity with InfluxDB, Cassandra, RDS, Elasticsearch, Solr, and Splunk.\nExperience in designing, implementing, and managing streaming projects and technologies (e.g., Kafka, Spark, Flink)\nYour base salary will be determined based on your location, experience, and the pay of employees in similar positions. The base salary range is 272,000 USD - 425,500 USD.\nYou will also be eligible for equity and benefits.\nApplications for this job will be accepted at least until September 13, 2025.\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/US-CA-Santa-Clara/Principal-Cloud-Software-Engineer_JR2002945",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T13:26:09.398751"
  },
  {
    "title": "NVIDIA 2026 Internships: Hardware Physical Design / VLSI",
    "location": "US, CA, Santa Clara, US, CA, Santa Clara, US, CA, Santa Clara",
    "experience_required": "",
    "job_description": "By submitting your resume, you’re expressing interest in one of our 2026 Hardware Physical Design / VLSI Internships. We’ll review resumes on an ongoing basis, and a recruiter may reach out if your experience fits one of our many internship opportunities. \n NVIDIA pioneered accelerated computing to tackle challenges no one else can solve. Our work in AI and digital twins is transforming the world's largest industries and profoundly impacting society — from gaming to robotics, self-driving cars to life-saving healthcare, climate change to virtual worlds where we can all connect and create.     \n Our internships offer an excellent opportunity to expand your career and get hands on experience with one of our industry leading Hardware teams. We’re seeking strategic, ambitious, hard-working, and creative individuals who are passionate about helping us tackle challenges no one else can solve. \n Throughout the 12-week full-time internship, students will work on projects that have a measurable impact on our business. We’re looking for students pursuing Bachelor's, Master's, or PhD degree within a relevant or related field. \n What we need to see:\nMust be actively enrolled in a university pursuing a Bachelor's, Master's, or PhD degree in Electrical Engineering, Computer Engineering, or a related field, for the entire duration of the internship.   \nCourse or internship experience related to the following areas could be required:  \nSynthesis, Static Timing Analysis, Clock/Power Distribution and Analysis, RC Extraction and Correlation, Place and Route, Circuit Design  \nVLSI, Computer Architecture, Digital/Micro Electronics, Mixed-Signal Design, Digital Design, Logic Design  \nCAD and Physical Design Methodologies (Flow and Tools Development), Chop Floorplan, Power/Clock Distribution, Packaging, P&R (Place and Route) and Timing Closure \nChip Floor Plan, Power/Clock Distribution, Chip Assembly, Timing Closure, Power and Noise Analysis, and Back-End Verification  \nEDA Vendor (Synopsys, Cadence, Mentor, etc.) tool suites such as: ICC2, PrimeTime, dc_shell, Innovus, SeaHawk \nDepending on the internship role, prior experience or knowledge requirements could include the following programming skills and technologies:  \nPerl, C, C++, TCL, SPICE, Linux, Verilog, SKILL, Make, ICC2, Design Compiler, PrimeTime (Synopsys, First Encounter), Innovus, Virtuso (Cadence)   \nClick here to learn more about NVIDIA, our early talent programs, benefits offered to students and other helpful student resources related to our latest technologies and endeavors. \nOur internship hourly rates are a standard pay based on the position, your location, year in school, degree, and experience. The hourly rate for our interns is 20 USD - 71 USD.\nYou will also be eligible for Intern benefits. \nApplications are accepted on an ongoing basis.\n\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/US-CA-Santa-Clara/NVIDIA-2026-Internships--Hardware-Physical-Design---VLSI_JR2003198",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T13:26:12.577875"
  },
  {
    "title": "NVIDIA 2026 Internships: Hardware Verification",
    "location": "US, CA, Santa Clara, US, CA, Santa Clara, US, CA, Santa Clara",
    "experience_required": "",
    "job_description": "By submitting your resume, you’re expressing interest in one of our 2026 Hardware Verification Internships. We’ll review resumes on an ongoing basis, and a recruiter may reach out if your experience fits one of our many internship opportunities. \n NVIDIA pioneered accelerated computing to tackle challenges no one else can solve. Our work in AI and digital twins is transforming the world's largest industries and profoundly impacting society — from gaming to robotics, self-driving cars to life-saving healthcare, climate change to virtual worlds where we can all connect and create.   \n Our internships offer an excellent opportunity to expand your career and get hands on experience with one of our industry leading Hardware teams. We’re seeking strategic, ambitious, hard-working, and creative individuals who are passionate about helping us tackle challenges no one else can solve. \n Throughout the 12-week full-time internship, students will work on projects that have a measurable impact on our business. We’re looking for students pursuing Bachelor's, Master's, or PhD degree within a relevant or related field. \n What we need to see: \nMust be actively enrolled in a university pursuing a Bachelor's, Master's, or PhD degree in Electrical Engineering, Computer Engineering, or a related field, for the entire duration of the internship.   \nCourse or internship experience related to the following areas could be required:     \nFormal Verification, GPU or processor Verification or Validation  \nDigital Systems, Digital Design, VLSI Design, RTL Design, Testbench Creation \nRandom functional testing, writing test plans, directed/random diagnostics \nCPU and GPU Architecture, Computer Architecture, Software Infrastructure (for validation of hardware architecture) \nDepending on the internship role, prior experience or knowledge requirements could include the following programming skills and technologies:  \nVerilog, SystemVerilog, VHDL, UVM, Perl, TCL, C, C++, Linux, Testbench Tools \nClick here to learn more about NVIDIA, our early talent programs, benefits offered to students and other helpful student resources related to our latest technologies and endeavors. \nOur internship hourly rates are a standard pay based on the position, your location, year in school, degree, and experience. The hourly rate for our interns is 20 USD - 71 USD.\nYou will also be eligible for Intern benefits. \nApplications are accepted on an ongoing basis.\n\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/US-CA-Santa-Clara/NVIDIA-2026-Internships--Hardware-Verification-_JR2003197",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T13:26:15.755515"
  },
  {
    "title": "Senior Logic Design Engineer– Physical Design",
    "location": "US, CA, Santa Clara, US, TX, Austin, US, TX, Remote, US, OR, Hillsboro, US, CA, Remote",
    "experience_required": "",
    "job_description": "We are now looking for a Logic Design Engineer with Physical Design background!\nAs a member of our CPU Logic Design Team, you will be responsible for the design of CPU on-chip interconnect network and last-level caches, working closely with the physical design team on implementation, synthesis and timing closure as well as working on micro-architectural definition and RTL coding/debug. This position offers you the opportunity to have real impact in a dynamic, technology-focused company impacting product lines ranging from consumer graphics to self-driving cars and the growing field of artificial intelligence. We have crafted a team of extraordinary people stretching around the globe, whose mission is to push the frontiers of what is possible today and define the platform for the future of computing.\nWhat you'll be doing:\nAs a member of our core CPU team, you'll be a liaison between Logic design and Physical design teams responsible for achieving timing, area, performance and power goals of the unit.\nHelp define the architecture for next-generation Nvidia coherent interconnects and system-level caches.\nCollaborate with our verification team to verify the correctness of the design.\nWhat we need to see:\nMaster’s Degree in Electrical Engineering, Computer Engineering or Computer Science or equivalent experience.\n5+ years of experience in processor or other related high-performance semiconductor designs.\nPhysical design expertise including hands-on synthesis experience and in-depth knowledge of industry standard physical design tools is required.\nA background in high-speed interconnect/cache physical design is preferred.\nVerilog expertise is required as is a deep understanding of ASIC design flow including RTL design, verification, logic synthesis, prototyping, DFT, timing analysis, floor-planning, ECO, bring-up & lab debug.\nStrong communication and interpersonal skills are required along with the ability to work in a dynamic, global team.\nNVIDIA is widely considered to be one of the technology world’s most desirable employers. We have some of the most brilliant and hardworking people in the world working for us. Are you creative and autonomous? Do you love the challenge of crafting the fastest and most power-efficient chips in their class? If so, we want to hear from you.\n#LI-Hybrid\nYour base salary will be determined based on your location, experience, and the pay of employees in similar positions. The base salary range is 168,000 USD - 264,500 USD for Level 4, and 196,000 USD - 310,500 USD for Level 5.\nYou will also be eligible for equity and benefits.\nApplications for this job will be accepted at least until September 13, 2025.\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/US-CA-Santa-Clara/Senior-Logic-Design-Engineer--Physical-Design_JR2003808",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T13:26:18.968817"
  },
  {
    "title": "Senior Developer Technology Engineer",
    "location": "US, CA, Santa Clara, US, CA, Remote, US, NY, Remote",
    "experience_required": "",
    "job_description": "We’re currently seeking a Senior Developer Technology Engineer!\nNVIDIA's Developer Technology Engineering team is a global network of world-class experts revolutionizing industries through accelerated computing. We empower developers with groundbreaking solutions that solidify NVIDIA's leadership. If you're passionate about optimizing large application workloads, eliminating system bottlenecks, and collaborating on cutting-edge technology breakthroughs, consider joining our team.\n What you will be doing:\nIn this role, you will research and develop techniques to accelerate top CSP workloads on NVIDIA’s computing platform including advanced CPUs, GPUs and interconnects.\nWork directly with key customers to perform in-depth analysis and optimization of complex workloads to ensure the best possible performance on current and next-generation hardware.\nCollaborate with libraries, tools, system software architecture, hardware, and research teams at NVIDIA to influence the design of next-generation programming models, software, and architectures.\nWhat we need to see:\nA Masters degree in Computer Science, Computer Engineering, or related computationally focused science degree (or equivalent experience).\nYou have 8+ years of relevant work experience or research.\nProgramming proficiency in C/C++ with a deep understanding of software design, programming techniques, and algorithms.\nA background that includes parallel programming, ideally CUDA C/C++.\nHands on experience doing low-level performance optimizations.\nIn-depth expertise with CPU and GPU architecture fundamentals.\nStrong math skills, including linear algebra, for problem-solving and performance modeling\nGood communication, organization and prioritization skills\nWays to stand out from the crowd:\nDesigned highly optimal parallel algorithms and data structures for applications with high bytes to compute ratio, such as processing directly on compressed data and kernel fusion.\nYou optimized end-to-end performance of applications spanning many layers of software, from OS to high-level frameworks.\nYou influenced hardware feature design leveraging your application and domain knowledge.\nThe Developer Technology Engineer (DevTech) plays a crucial role in the success of NVIDIA and our customers. DevTechs work with external technologists to investigate performance of their applications, design parallel algorithms and implement optimizations in a GPU accelerated computing environment. As recognized experts in the field we publish our findings in developer blogs or at relevant conferences and workshops. With visibility to our customers, the industry, and academia we are important representatives of NVIDIA as a technology leader. Within NVIDIA we contribute valuable application expertise that influences next generation hardware and software products. As critical problem solvers, we deepen our expertise, expand our knowledge, and work across domains and organizations. Whether you are a leading industry luminary or early in your career, the Developer Technology Team provides ample opportunity for growth in the exciting field of GPU accelerated computing!\nNVIDIA is widely considered to be one of technology’s most desirable employers. We have a world class team with some of the most forward-thinking and hardworking people in the world working here. Does contributing to and pushing the boundaries of state-of-the-art in GPU Accelerated Computing, HPC and Artificial Intelligence excite you? If so, we want to hear from you!\n#LI-Hybrid\nYour base salary will be determined based on your location, experience, and the pay of employees in similar positions. The base salary range is 184,000 USD - 287,500 USD for Level 4, and 224,000 USD - 356,500 USD for Level 5.\nYou will also be eligible for equity and benefits.\nApplications for this job will be accepted at least until September 13, 2025.\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/US-CA-Santa-Clara/Senior-Developer-Technology-Engineer_JR1999059",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T13:26:22.144294"
  }
]