[
  {
    "title": "Android Engineer, DLS Foundation",
    "location": "United States",
    "experience_required": "Not specified",
    "job_description": "Airbnb was born in 2007 when two hosts welcomed three guests to their San Francisco home, and has since grown to over 5 million hosts who have welcomed over 2 billion guest arrivals in almost every country across the globe. Every day, hosts offer unique stays and experiences that make it possible for guests to connect with communities in a more authentic way.\nThe Community You Will Join:\nThe DLS Foundation team has a deep history at Airbnb with contributions that date back to the inception of Airbnb’s Design Language System (DLS).  The team is responsible for our design system building blocks - our core atomic components, layouts, and visual foundations - alongside the UI capabilities we provide to enable advanced visual effects, haptics that hundreds of client engineers at Airbnb leverage.\nAs part of the larger UI Foundation team that contributes to Airbnb’s digital accessibility, Motion and UI tooling, we are involved in all stages of the product development lifecycle, from conceptualization to launch.  As a central, cross-platform team consisting of Android, iOS, and Web engineers, we partner closely with Product Engineering, Design, and Product teams. \nThe Difference You Will Make:\nAs an Android engineer on the DLS Foundation team, you'll have the opportunity to work with world-class engineers on expanding the DLS Building Blocks, building out new UI frameworks and utilities used by other client-side engineers, and supporting new product launches by embedding yourself into product initiatives. You will be supported by a team of design and engineering managers, designers, and peers. The scope of this role is vast and limited only by your ambition.\nYou will be working to improve the overall process by which client-side engineers at the company translate designs into code. In this role you will work closely with other engineers on Web, Android and iOS in building out systems and solutions that facilitate the overall engineering process of new features. You will also work closely with designers on expanding and reinforcing processes of feature development from their perspective.\nThe role and responsibility involves a massive blast radius on all Airbnb product features and teams. It is essential for each system update to be stable and safe.\nA Typical Day: \nEnable Android engineers at Airbnb to build the best user experiences with DLS (Building Blocks and new UI capabilities) and UI Frameworks\nEvolve DLS with flexibility, practicality and long-term scalability in mind that fits Airbnb’s business needs\nDrive investments into new technical capabilities that push the envelope and unlock new product innovation\nIdentify Design and Engineer product development pain point and constantly improve the development efficiency. \nWork alongside iOS and Frontend Web counterparts to deliver on shared objectives.\nSupport product engineers through community events,  training materials, workshops, codelabs, etc.\nContribute to the team’s technical strategy alongside leads to evolve technology choices that scale with Product and Design ambitions.\nLevel up technical leadership within the team through effective partnership with peer ICs and mentoring.\nYour Expertise:\n2+ years of industry experience developing consumer Android applications, and design systems at scale.\nExpertise in Kotlin and Jetpack Compose.\nTrack record of leading projects end-to-end that involve strong cross-functional collaboration with Product and Design partners.\nYou possess passion for UI and Motion animation development, with attention to detail mindset.\n[Bonus] Experience working with Figma and other design tools\nYour Location:\nThis position is US - Remote Eligible. The role may include occasional work at an Airbnb office or attendance at offsites, as agreed to with your manager. While the position is Remote Eligible, you must live in a state where Airbnb, Inc. has a registered entity. Click here for the up-to-date list of excluded states. This list is continuously evolving, so please check back with us if the state you live in is on the exclusion list. If your position is employed by another Airbnb entity, your recruiter will inform you what states you are eligible to work from. \nOur Commitment To Inclusion & Belonging:\nAirbnb is committed to working with the broadest talent pool possible. We believe diverse ideas foster innovation and engagement, and allow us to attract creatively-led people, and to develop the best products, services and solutions. All qualified individuals are encouraged to apply.\nWe strive to also provide a disability inclusive application and interview process. If you are a candidate with a disability and require reasonable accommodation in order to submit an application, please contact us at: reasonableaccommodations@airbnb.com. Please include your full name, the role you’re applying for and the accommodation necessary to assist you with the recruiting process. \nWe ask that you only reach out to us if you are a candidate whose disability prevents you from being able to complete our online application.\nHow We'll Take Care of You:\nOur job titles may span more than one career level. The actual base pay is dependent upon many factors, such as: training, transferable skills, work experience, business needs and market demands. The base pay range is subject to change and may be modified in the future. This role may also be eligible for bonus, equity, benefits, and Employee Travel Credits.  \nPay Range\n$157,000—$180,600 USD",
    "job_link": "https://careers.airbnb.com/positions/7113677/",
    "posted_date": "Not specified",
    "company": "Airbnb",
    "scraped_at": "2025-09-10T15:43:09.135862"
  },
  {
    "title": "Application Security Engineer",
    "location": "United States",
    "experience_required": "Not specified",
    "job_description": "Airbnb was born in 2007 when two hosts welcomed three guests to their San Francisco home, and has since grown to over 5 million hosts who have welcomed over 2 billion guest arrivals in almost every country across the globe. Every day, hosts offer unique stays and experiences that make it possible for guests to connect with communities in a more authentic way.\nThe Community You Will Join:\nAirbnb’s Application Security team is focused on making the Airbnb platform safer for millions of users around the world. We are a team covering a broad range of responsibilities from tool development to architectural consulting. We collaborate closely with our product teams, integrate security into every stage of development, and empower them to build secure features without unnecessary friction. Airbnb is a community built on trust, and we are integral to that foundation.\nThe Difference You Will Make:\nThe Application Security (Appsec) team at Airbnb works with our product teams to ensure we have secure systems and applications. The Appsec team builds close partnerships with key areas in our engineering organization to identify security leverage opportunities and drive high impact security initiatives. Our partner team, the Security Development Engineering team focuses on building paved roads, automation for security self-service, and vulnerability management to reduce security risk.\nA Typical Day: \nIdentify and address areas for security improvement by developing scalable and innovative solutions that enhance Airbnb’s defense in-depth strategy and eliminate classes of security vulnerabilities.\nCollaborate with product and development teams to embed security in every stage of the software lifecycle, via methods such as threat modeling, design reviews, and code reviews.\nEducate and empower software engineers to strengthen their security expertise and foster a culture of security awareness throughout Airbnb.\nInvestigate, prioritize, and drive the resolution of application security vulnerabilities, ensuring timely remediation across Airbnb products.\nYour Expertise:\nDeep understanding of web and mobile application security, including common vulnerabilities, attack vectors, and secure development practices\nHands-on software development experience, ideally with Java, JavaScript, Python, and Swift.\nKnowledge of modern frameworks like ReactJS, Dropwizard and GraphQL, with the ability to assess their security implications.\nAbility to collaborate with product and development teams to embed security throughout the the SDL\nStrong communication and leadership skills, with a track record of educating and empowering engineers to adopt security practices. \n3+ years of experience in application security or a similar field, with a strong focus on threat modeling, architecture reviews, and developing scalable solutions to address security vulnerabilities.\nYour Location:\nThis position is US - Remote Eligible. The role may include occasional work at an Airbnb office or attendance at offsites, as agreed to with your manager. While the position is Remote Eligible, you must live in a state where Airbnb, Inc. has a registered entity. Click here for the up-to-date list of excluded states. This list is continuously evolving, so please check back with us if the state you live in is on the exclusion list. If your position is employed by another Airbnb entity, your recruiter will inform you what states you are eligible to work from. \nOur Commitment To Inclusion & Belonging:\nAirbnb is committed to working with the broadest talent pool possible. We believe diverse ideas foster innovation and engagement, and allow us to attract creatively-led people, and to develop the best products, services and solutions. All qualified individuals are encouraged to apply.\nWe strive to also provide a disability inclusive application and interview process. If you are a candidate with a disability and require reasonable accommodation in order to submit an application, please contact us at: reasonableaccommodations@airbnb.com. Please include your full name, the role you’re applying for and the accommodation necessary to assist you with the recruiting process. \nWe ask that you only reach out to us if you are a candidate whose disability prevents you from being able to complete our online application.\nHow We'll Take Care of You:\nOur job titles may span more than one career level. The actual base pay is dependent upon many factors, such as: training, transferable skills, work experience, business needs and market demands. The base pay range is subject to change and may be modified in the future. This role may also be eligible for bonus, equity, benefits, and Employee Travel Credits.  \nPay Range\n$157,000—$180,600 USD",
    "job_link": "https://careers.airbnb.com/positions/7178910/",
    "posted_date": "Not specified",
    "company": "Airbnb",
    "scraped_at": "2025-09-10T15:43:10.533085"
  },
  {
    "title": "Associate Principal, Control Testing",
    "location": "Gurugram, India",
    "experience_required": "Not specified",
    "job_description": "Airbnb was born in 2007 when two hosts welcomed three guests to their San Francisco home, and has since grown to over 5 million hosts who have welcomed over 2 billion guest arrivals in almost every country across the globe. Every day, hosts offer unique stays and experiences that make it possible for guests to connect with communities in a more authentic way.\nThe Community You Will Join \nAirbnb Capability Center was set up in 2017 in Gurgaon. We provide specialized operational services which allow Airbnb's business and responsibilities across the world. These include Finance Technology, Finance Shared Services, Analytics, Engineering, amongst other verticals. Our offices are home to multi-experienced teams with an understanding of our business and community. We're hospitable, fun and we welcome all with open arms. \n  The difference you will make\nIn the role of Associate Principal, Control Testing, the successful candidate will be responsible for continued development of our compliance program for Section 404 of the Sarbanes-Oxley Act of 2002.  You will support design and testing of key business and entity level SOX controls in a rapidly changing and growing company and technology environment within the AirControl Financial Controls group.  You will evaluate the design and effectiveness of SOX controls, provide guidance to process and control owners over controls, and lead coordination with other SOX stakeholders and external auditors. \nYou will work directly with control owners in the business (e.g. accounting and finance teams) to evaluate the controls and support business partners in the implementation and maintenance of the controls and interact and support efforts of the Company’s independent auditor.  As part of the annual control evaluations, you will perform walkthroughs over processes and controls to evaluate the design, test samples to evaluate the operating effectiveness, evaluate gaps, and drive the remediation of deficiencies. \n  The role requires a well-rounded controls focused professional with accounting and operational expertise. Excellent communication, resource allocation and project management skills are critical, as well as the ability to influence across functions and various levels.  The position reports to the Director, Financial Risk & Controls that rolls up to the Head of Global Risk and Internal Audit.\n  A typical day \nParticipate in annual scoping and risk assessment exercises and determine testing approach for manual controls within the business processes \nExecute design and operating effectiveness testing over manual and entity level controls\nEvaluate changes made to key business processes and provide best practice recommendations on controls \nApply a new perspective on existing controls to recommend efficiencies in testing and evaluation approaches\nSupport business partners in maintaining internal control documentation over key processes\nParticipate in annual 404 compliance activities with the external auditors, including identification, evaluation, and remediation of deficiencies \nSupport the quarterly 302 certification process \n  Your Expertise \nCA in Accounting or Finance or Management Information Systems or related field\nMinimum of 7+ years of experience, preferably with some years of external audit or consulting experience with US publicly traded companies  \nUnderstanding and experience with the requirements of Sarbanes-Oxley Act of 2002, Section 404, COSO framework, GAAP standards and PCAOB standards\nExperience with external auditor requirements and expectations\nMission-driven, enthusiastic to learn and grow; team-oriented with a positive attitude and able to work in hyper-growth, fast paced environment\nAbility to work collaboratively with people at all levels of the organization, identify risks and anticipate questions, and provide actionable recommendations based on industry best practices and use influence to ensure execution\nStrong risk management experience, including: performing annual risk assessments, executing annual SOX control testing, and evaluating control deficiencies \nRole model for Airbnb core values\n  Our Commitment To Inclusion & Belonging\nAirbnb is committed to working with the broadest talent pool possible. We believe diverse ideas foster innovation and engagement, and allow us to attract creatively-led people, and to develop the best products, services and solutions. All qualified individuals are encouraged to apply.",
    "job_link": "https://careers.airbnb.com/positions/6681588/",
    "posted_date": "Not specified",
    "company": "Airbnb",
    "scraped_at": "2025-09-10T15:43:11.376104"
  },
  {
    "title": "Associate Principal, Marketing Strategic Finance & Analytics",
    "location": "United States",
    "experience_required": "Not specified",
    "job_description": "Airbnb was born in 2007 when two hosts welcomed three guests to their San Francisco home, and has since grown to over 5 million hosts who have welcomed over 2 billion guest arrivals in almost every country across the globe. Every day, hosts offer unique stays and experiences that make it possible for guests to connect with communities in a more authentic way.\nThe Community You Will Join: \nYou’ll be part of Airbnb’s Marketing Strategic Finance & Analytics team, a collaborative group that shapes the Brand Marketing organization’s financial strategy and growth trajectory. The team partners closely with Brand Marketing, Product Marketing, Hosting, Financial Operations, Data Science, and Research — together driving insights and strategic decisions that influence guest and host journeys globally. With significant exposure to senior leaders, including the VP of Marketing and Director-level stakeholders, you’ll help steer high-impact initiatives in a dynamic, fast-paced environment.\nThe Difference You Will Make:\nYou’ll serve as a critical finance and strategy leader, bringing hands-on analytical expertise to shape and optimize Brand Marketing investments. Success means delivering actionable insights, rigorous financial analyses, and measurable improvements in KPI attainment, campaign ROI, and budget efficiency. By driving cross-functional alignment and championing operational excellence, you’ll empower Airbnb to make data-driven, strategic marketing decisions that fuel business growth.\nA Typical Day: \nLead budget forecasting and tracking, partnering with Financial Operations to ensure accurate monthly projections and media spend allocations.\nDevelop and monitor KPI frameworks for marketing channels, setting and reviewing targets, OKRs, and efficiency metrics.\nConduct deep analytical dives into business trends and campaign performance, independently extracting, visualizing, and presenting data.\nCollaborate with Brand Marketing, Product Marketing, Hosting, and Data Science teams to design, execute, and evaluate marketing strategies.\nSupport weekly and quarterly reporting requirements for Marketing and Hosting organizations, preparing executive-ready presentations.\nFacilitate complex, large-scale processes across global teams and agency partners, proactively driving strategic connections and alignment.\nLead ROI analyses for brand campaigns — integrating quantitative and qualitative impacts, and championing holistic campaign reviews\nYour Expertise:\n8+ years of progressive experience in finance, analytics, business operations, FP&A, strategy consulting, or related fields.\nDemonstrated mastery of financial modeling and quantitative/qualitative analysis, especially in the context of brand marketing (TV, Social, Online Video, Podcast, Radio, OTT).\nProven track record in budget planning, forecasting, and media buying operations or similar domain.\nExceptional communication skills, with experience crafting executive-level presentations and reports from complex data sets.\nStrong cross-functional influence and stakeholder management — adept at structuring and leading global, multi-team processes.\nComfortable working in ambiguous, high-growth environments; proactive and self-starting with a bias for action.\nPreferred: Experience collaborating with international partners, agency teams, and familiarity with media buying operations.\nYour Location:\nThis position is US - Remote Eligible. The role may include occasional work at an Airbnb office or attendance at offsites, as agreed to with your manager. While the position is Remote Eligible, you must live in a state where Airbnb, Inc. has a registered entity. Click here for the up-to-date list of excluded states. This list is continuously evolving, so please check back with us if the state you live in is on the exclusion list  If your position is employed by another Airbnb entity, your recruiter will inform you what states you are eligible to work from.\nOur Commitment To Inclusion & Belonging:\nAirbnb is committed to working with the broadest talent pool possible. We believe diverse ideas foster innovation and engagement, and allow us to attract creatively-led people, and to develop the best products, services and solutions. All qualified individuals are encouraged to apply.\nWe strive to also provide a disability inclusive application and interview process. If you are a candidate with a disability and require reasonable accommodation in order to submit an application, please contact us at: reasonableaccommodations@airbnb.com. Please include your full name, the role you’re applying for and the accommodation necessary to assist you with the recruiting process. \nWe ask that you only reach out to us if you are a candidate whose disability prevents you from being able to complete our online application.\nHow We'll Take Care of You:\nOur job titles may span more than one career level. The actual base pay is dependent upon many factors, such as: training, transferable skills, work experience, business needs and market demands. The base pay range is subject to change and may be modified in the future. This role may also be eligible for bonus, equity, benefits, and Employee Travel Credits.  \nPay Range\n$145,000—$170,000 USD",
    "job_link": "https://careers.airbnb.com/positions/7155307/",
    "posted_date": "Not specified",
    "company": "Airbnb",
    "scraped_at": "2025-09-10T15:43:12.504773"
  },
  {
    "title": "Communications Intern, Italy & SEE",
    "location": "Milan, Italy",
    "experience_required": "Not specified",
    "job_description": "Airbnb was born in 2007 when two hosts welcomed three guests to their San Francisco home, and has since grown to over 5 million hosts who have welcomed over 2 billion guest arrivals in almost every country across the globe. Every day, hosts offer unique stays and experiences that make it possible for guests to connect with communities in a more authentic way.\nThe community you will join:\nAirbnb is seeking a Communications Intern to join the Italy & South East Europe (SEE) Communications team for a full-time, 6-month internship.\nThe Communications team at Airbnb is responsible for telling our story around the world. Whether we are briefing press on inspiring travel trends, highlighting unique experiences led by local hosts, or explaining how travel on our platform benefits local families and communities, we are the voice of Airbnb on a broad range of topics. \nWe're a fast growing and high energy team with a passion for people, places and great stories. If you'd like to be part of one of the world's greatest communications teams, come tell us your story. \n  The difference you will make:\nYou’ll support our consumer communications manager on Press relations and influencer campaigns. \nPress Office:\nAssist in the creation of press releases and press kits, including storytelling ideation, coordinating with agencies to format materials into press kits, drafting press releases, and developing additional supporting creative assets.\nCoordinate with agency partners on local communication initiatives, media plans, strategic announcements, and other media-related topics.\nOverview  internal reporting workflows such as populating weekly reports for Italy and SEE, and keeping the communication calendars up-to-date.\nGenerate reports by analyzing KPIs from internal monitoring tools.\nProject Management:\nProject management planning: ability to support in creating and maintaining one-pagers, Google Slides, Excel sheets and reports to track activities for various communication initiatives.\nManage the publishing of newsroom posts for the Italian & SEE communications team.\nOversee calendar invitations for the Italian & SEE communications team.\nAssist in organizing press conferences & media events.\nInfluencers:\nAssist in coordinating with agencies for organizing trips / events for influencers.\nLearning about reporting on influencers campaigns.\n  A typical day:\nAs an intern, you’ll be integrated into a team where you’ll contribute to challenging projects. Your manager, team, and our incredible employee community will strive to be superhosts to you. We provide the support, mentorship, fun, and real world experience needed to accelerate your learning and make a real impact on our product, as Airbnb revolutionizes connection, belonging, and travel. You can expect to:\nUpdate the weekly communications calendar and project tracking tools.\nReview internal media monitoring tools to compile reports and analyze brand and competitor social media for insights.\nCreate and update slide decks, documents, and compile editorial press pitches and Newsroom posts.\nSupport discussions with agencies, draft releases, emails to partners, or other project-related content under senior consumer manager supervision.\nParticipate in and support internal coordination meetings with other functions and departments.\nAnalyze social media performance for brand and influencer partners, prepare metrics and reports, and assist in talent consultant needs, team coordination, and scheduling meetings.\nActively participate in and contribute to the Communications and broader Airbnb community\n  Your expertise:\nEnrolled in the last year of a University or a Masters degree program in a related field (Communications, Public Relations)\nFluent (written and spoken) in English and Italian with C1 level proficiency\nExcellent written and verbal communication skills\nStrong attention to detail and ability to multitask\nProficient in Google Suite and social media platforms\nCapable of working independently and collaboratively in a fast-paced, multitasking environment\nBasic knowledge of the Italian media landscape\nAbility to maintain enthusiasm and composure in demanding situations\nPassion for communications and keeping up with industry trends\nPrevious internship experience in Public Relations or Communications\nNice to Haves:\nExperience in PR and media relations, e.g. agency or editorial or journalistic experience\nAn international outlook and passion for travel\n  Your location:\nThis position is hybrid and you must be living in Milan, Italy and have work authorization for Italy to be eligible.\n  Our commitment to inclusion & belonging:\nAirbnb is committed to working with the broadest talent pool possible. We believe diverse ideas foster innovation and engagement, and allow us to attract creatively-led people, and to develop the best products, services and solutions. All qualified individuals are encouraged to apply.\n  Please submit all application materials in English.",
    "job_link": "https://careers.airbnb.com/positions/7190123/",
    "posted_date": "Not specified",
    "company": "Airbnb",
    "scraped_at": "2025-09-10T15:43:13.394960"
  },
  {
    "title": "Communications Lead, Trust",
    "location": "United States",
    "experience_required": "Not specified",
    "job_description": "Airbnb was born in 2007 when two hosts welcomed three guests to their San Francisco home, and has since grown to over 5 million hosts who have welcomed over 2 billion guest arrivals in almost every country across the globe. Every day, hosts offer unique stays and experiences that make it possible for guests to connect with communities in a more authentic way.\nThe Community You Will Join: \nThe Airbnb Communications team is responsible for telling Airbnb’s story around the world. \nWhether it’s speaking to media, hosts and guests, industry commentators, thought leaders or the wider community, the Communications team is the voice of Airbnb. We help drive consideration and usage of our products and services in addition to generating buzz, supporting the legitimization of our community, and promoting trust in our brand.\nThe Trust Communications team is part of the Corporate Communications team at Airbnb. This team is responsible for defending and promoting the company from a business and financial, trust and safety, crisis and executive standpoint. We proactively spread positive news about our business and maintain and shape a corporate narrative that aligns with the company’s initiatives.\nThe Difference You Will Make:\nThe Communications Lead, Trust, role will implement the strategy for trust and safety at Airbnb, including activating consumer-facing campaigns on trust and safety matters and managing a drumbeat of stories and news on Airbnb globally and regionally. The right candidate will already be recognized as a leader in their field at this level, with a proven track record of using a range of strategies and disciplines to manage and drive interest. They will also have a history of taking a leadership role, including maintaining team organization across multiple cross-functional projects, identifying and solving complex and ambiguous problems, and anticipating and getting ahead of challenges.\nYou must be comfortable managing and overseeing proactive and reactive communications with high-reach and visibility in a global company, working with journalists, and delivering counsel and guidance to a senior leadership and audiences. The role reports to the Director, Global Trust Communications.\nA Typical Day: \nDevelop and lead a global calendar of multichannel campaigns that tie back to team and business objectives, while also owning key initiatives to ensure timely delivery\nAct as a point of contact for journalists and a spokesperson on trust and safety issues, and manage and support the Trust Communications team on press requests, utilizing all relevant tools and teams to support Airbnb’s community and brand\nProvide strategic counsel and support to global and regional leaders, including in Public Policy, Legal, Community Support, Operations, Product, and Community Policy, especially on sensitive and complex matters\nIdentify, coach, and prepare Airbnb spokespeople for media and public speaking opportunities\nProvide oversight and direction across multiple cross-functional projects, ensuring strong team organization and momentum, while staying hands-on in the details to keep work moving.\nYour Expertise:\n10+ years of communications experience working in an agency, in-house communications or a government communications role\nExperienced comms leader with a proven track-record working with teams and journalists on proactive and reactive communications initiatives involving trust, crisis, policy, regulatory, corporate and financial matters\nExperience advising and working with cross-functional leads and stakeholders\non sensitive, complex and high-profile matters\nA proven history of collaborating closely to encourage and develop innovative ideas, turn them into plans and campaigns that map to team and business objectives, and execute on them\nDeep understanding of changing communications landscape and how to effectively and holistically approach to manage or drive impact\nStrong writer with attention to detail and experience in crafting highly effective press materials\nExperience in supporting a multi-faceted team and growing team members\nPositive and collaborative mindset, with a commitment to following through to get things done and ensuring all activities undertaken are as successful as possible\nExtremely capable in independently structuring and managing fast-paced and sometimes complex priorities and projects \nProven strategy and operations capabilities, and experience of working with cross-functional teams on a range of projects\nExcellent problem solver with the confidence to make decisions in complex and high-pressure situations, and the ability to anticipate future issues, navigate challenges, and facilitate collaborative and supportive environments\nBachelor’s Degree\nYour Location:\nThis position is US - Remote Eligible. The role may include occasional work at an Airbnb office or attendance at offsites, as agreed to with your manager. While the position is Remote Eligible, you must live in a state where Airbnb, Inc. has a registered entity. Click here for the up-to-date list of excluded states. This list is continuously evolving, so please check back with us if the state you live in is on the exclusion list  If your position is employed by another Airbnb entity, your recruiter will inform you what states you are eligible to work from. \nOur Commitment To Inclusion & Belonging:\nAirbnb is committed to working with the broadest talent pool possible. We believe diverse ideas foster innovation and engagement, and allow us to attract creatively-led people, and to develop the best products, services and solutions. All qualified individuals are encouraged to apply.\nWe strive to also provide a disability inclusive application and interview process. If you are a candidate with a disability and require reasonable accommodation in order to submit an application, please contact us at: reasonableaccommodations@airbnb.com. Please include your full name, the role you’re applying for and the accommodation necessary to assist you with the recruiting process. \nWe ask that you only reach out to us if you are a candidate whose disability prevents you from being able to complete our online application.\nHow We'll Take Care of You:\nOur job titles may span more than one career level. The actual base pay is dependent upon many factors, such as: training, transferable skills, work experience, business needs and market demands. The base pay range is subject to change and may be modified in the future. This role may also be eligible for bonus, equity, benefits, and Employee Travel Credits.  \nPay Range\n$160,000—$200,000 USD",
    "job_link": "https://careers.airbnb.com/positions/7229763/",
    "posted_date": "Not specified",
    "company": "Airbnb",
    "scraped_at": "2025-09-10T15:43:14.558498"
  },
  {
    "title": "Consumer Insights Lead, China",
    "location": "China",
    "experience_required": "Not specified",
    "job_description": "Airbnb was born in 2007 when two hosts welcomed three guests to their San Francisco home, and has since grown to over 5 million hosts who have welcomed over 2 billion guest arrivals in almost every country across the globe. Every day, hosts offer unique stays and experiences that make it possible for guests to connect with communities in a more authentic way.\n* This role is China Mainland - Remote work\n*  This is an Individual Contribution Role \n* No Visa and Relocation Support\n  The Community you will join:\nThe newly formed Research team drives all consumer insights, trends, competitive analysis and UX research for Airbnb. The centralized team drives decision making for product, design and other teams based on research and insights.   \n  The difference you will make:\nAirbnb is looking for a Consumer Insights Lead to join the Global Consumer Insights focusing on China.  This person will join a team that looks to provoke and inspire the organization with strategic and actionable insights to help define market opportunities & obstacles; generate, refine and evaluate product & marketing launches; and monitor market performance.  \n  This position will help build strong relationships with key regional stakeholders and identify regional consumer insight opportunities; be the ‘voice of the consumer’ and have expertise in the China market, with a good understanding of the APAC region. This person will act as a regional SME within the China Market team, broader global Research team and the Regional cross-functional teams (commercial, marketing, product, communications, policy).\nThis person will also manage qualitative and quantitative consumer insight projects in China  and support projects at the regional level, including vendor management, project design, analysis and reporting.\n  A typical day:\nLead consumer insights and be a thought partner for key stakeholders in China\nBe an indispensable partner to country leadership by providing a strong, objective perspective on the voice of the consumer, and by identifying and prioritizing opportunities related to brand strategy, product, and marketing. \nDesign, coordinate and execute strategic qualitative and quantitative research projects; involving a wide range of methodologies, such as focus groups, online tools, immersions, ethnographies, and simulated methodologies. \nIdentify and implement new and innovative research techniques to address business needs. \nOversee supplier relationships, managing scope, budget and deliverables. \nPrepares and presents research findings, through both written reports and presentations, in a concise and compelling way to client teams.\nEnsure all outputs are actionable, grounded in consumer knowledge, and guided by a broader understanding of business context and implications and inspire the team to uncover the “so whats” of all deliverables.  \nFully leverages all market, competitor and product information to produce objective and actionable insights of market drivers, the competitive environment, promotional and treatment trends with key customer types.\nPartner cohesively with the broader Insights Leadership Team across business and consumer; avoid silos and seek out ways to add value by synthesizing and collaborating across the teams. \n  Your Expertise:\n10+ years of relevant consumer insights experience. \nA degree in the field of research, marketing or social sciences. MBA a plus.\nDeep experience in China.  Experience in multiple markets in APAC a plus, including Japan, Korea, China and India \nExperience on both the \"client side\" and \"supplier/vendor side\" of research a plus.\nDemonstrates exceptional stakeholder management. Skillfully balances competing priorities by making strategic decisions that align research integrity with business objectives. Exercises sound judgment when evaluating multiple stakeholder requests, ensuring resources are allocated to initiatives with the highest business impact while maintaining methodological excellence.\nAbility to plan, manage and facilitate both regional & global research. \nExpertise in a wide range of both qualitative and quantitative research methods.\nFamiliarity with advanced analytic research techniques and tools, digital understanding, as well as leading edge market research tools & methods.  \nAbility to manage quant data files, run analysis on quant data (e.g., ability to weight data, run descriptive statistics, etc.), program in qualtrics, query SQL, etc. a plus. \nBe detail oriented without sacrificing a broad strategic perspective \nExcellent interpersonal skills with a positive and cooperative attitude that fosters collaboration and teamwork both inside and outside the department. \nSeasoned and strategic multitasker, with a hands-on approach and outside-the-box mentality.\nAbility to make thoughtful decisions in real time to provide support and solve problems as they arise.\nComfortable in navigating and excelling in challenging environments with no playbook for success, and able to simplify. \nFluency in English and Chinese.",
    "job_link": "https://careers.airbnb.com/positions/6740684/",
    "posted_date": "Not specified",
    "company": "Airbnb",
    "scraped_at": "2025-09-10T15:43:15.839475"
  },
  {
    "title": "Customer Support Specialist",
    "location": "Gurugram, India",
    "experience_required": "Not specified",
    "job_description": "Airbnb was born in 2007 when two hosts welcomed three guests to their San Francisco home, and has since grown to over 5 million hosts who have welcomed over 2 billion guest arrivals in almost every country across the globe. Every day, hosts offer unique stays and experiences that make it possible for guests to connect with communities in a more authentic way.\nThe Community You Will Join:\nAs a member of the Airbnb Customer Support team, you'll play a vital role as a Resolution Specialist within the volume tiers. Resolution Specialists serve as our initial point of contact, addressing community inquiries and concerns. Our community relies on us for:\nAccessible support that’s easy to find\nFaster resolution, preferably first time \nA team that’s there for them in times of urgent need \nSupport that’s built around them\nThe Difference You Will Make:\nProvide courteous and efficient service to the worldwide Airbnb community\nBe a first point of contact to handle and resolve customer complaints\nRespond professionally to inbound and outbound phone calls, emails, messages, including any urgent situations\nIdentify and escalate issues appropriately\nCompose thoughtful and accurate messages or customize prepared responses to customer emails\nUtilize available resources to research and troubleshoot problems effectively\nInvestigate from the existing knowledge resources to provide resolution\nMediate situations between users with empathy and fairness\nMonitor and control numerous concurrent tasks in tandem\nBe ambassadors embodying knowledge, empathy, and accountability\nProactively strive to meet targets and goals independently\nA Typical Day:\nJob Family : Operations (Resolutions)\nInbound and outbound calling process, messages and email support\nResolving customer queries in a timely manner\n24x7 shifts with rotational week offs, primarily supporting North America time zones\nNavigate competing priorities in all kinds of environment\nJob location: Gurgaon\nYour Expertise:\nGraduate with minimum 2 years of international voice process experience in a contact center/BPO\nKnowledge of and experience with measuring and improving customer satisfaction and loyalty across broad functional areas and diverse geographies\nAbility to manage sensitive customer information\nKnowledge of functional key performance metrics related to customer experience\nProven language ability in English with excellent comprehension, grammar, vocabulary and spelling\nOther requirements:\nInternet: Minimum 10 Mbps high-speed internet on the laptop for seamless work and virtual meetings.\nWorkspace: Quiet, private area free from interruptions; no shared/public spaces allowed.\nExcellent English reading, comprehension, and writing skills\nExcellent active listening skills with the ability to understand verbal nuances\nMust be able to pass multiple language assessments in English\nFurniture & equipment:\nErgonomic chair, desk, and proper lighting for comfortable, focused work. Cameras must be on during meetings unless otherwise stated.\nOnly using Airbnb issued hardware and software including noise canceling headsets, laptop etc.\nApproved locations: \nHiring/Training and Nesting in the Airbnb Office; satisfactory performance is required for work from home post the initial training and nesting period.\nWork from designated home office setups in Delhi/Gurgaon only\nOur Commitment To Inclusion & Belonging:\nAirbnb is committed to working with the broadest talent pool possible. We believe diverse ideas foster innovation and engagement, and allow us to attract creatively-led people, and to develop the best products, services and solutions. All qualified individuals are encouraged to apply.",
    "job_link": "https://careers.airbnb.com/positions/7182697/",
    "posted_date": "Not specified",
    "company": "Airbnb",
    "scraped_at": "2025-09-10T15:43:16.603736"
  },
  {
    "title": "Engineering Manager, Control Plane – Distributed Transactional Database",
    "location": "United States",
    "experience_required": "Not specified",
    "job_description": "Airbnb was born in 2007 when two hosts welcomed three guests to their San Francisco home, and has since grown to over 5 million hosts who have welcomed over 2 billion guest arrivals in almost every country across the globe. Every day, hosts offer unique stays and experiences that make it possible for guests to connect with communities in a more authentic way.\nThe Community You Will Join: \nThe Distributed Transactional Database team within Airbnb’s Online Data is responsible for building and operating a new source-of-truth, horizontally scalable, open-source NewSql database as the unified backend for all of Airbnb’s Online Data workloads. With users around the world, scalability, reliability, efficiency, usability and long-term platform viability are our team’s core missions.\n  The Difference You Will Make:\nAs an engineering manager for the Control Plane team under Distributed Transactional Database org, you’ll lead a team of talented, diverse software engineers to build software to make database operations (deployment, cluster provisioning and restore, rolling restarts, configuration, scaling) reliable and automated, and to make the open-source database well-integrated with Airbnb’s Compute, Networking and Security infrastructure.\nA few examples of control plane services that the team owns:\nOrchestration logic that handles node lifecycles of database’s storage, compute, metadata management nodes. (Blog link)\nOperator that automates cluster provisioning, operations and restore. \nConfiguration management that detects and auto-fixes unexpected configuration drifts. \nOpen source DevX: Make open-source development and testing (image building/testing, CICD, load testing and performance certification) frictionless.\nBlue/green deployment and rollback strategy for major version upgrades.\nIn the future, strives towards the direction of platformization, providing the correct constructs and semantics for customers to self-manage their databases and keep the org’s KTLO and toil factor manageable.\nEach manager brings their own unique skill set, experiences, thought leadership and technical expertise to solve these technical challenges for Airbnb. You will work closely with your peers within Online Data, many other partners in Airbnb Product teams, as well as Infra teams in Compute, Networking, Security, Reliability across the company and with external vendors.\nA Typical Day: \nWork with TL and team to define and execute on a vision and 3-year roadmap for the control plane area.\nStay in touch with technical designs and decisions, be the sounding board.\nSynthesize technical information and represent the team with upper management.\nAlign with ORM and SRE teams in Online Data on each team’s charter and how each team’s core capabilities fit together.\nAttract top talent, mentor individual contributors and manage their promotions and career.\nNurture a culture of rigor and responsibly “moving fast” from design, through code review, to production.\nRepresent Airbnb with open source communities and external alliance partners.\nYour Expertise:\n3+ years of engineering management experience, with 6+ years of relevant software development experience in a fast paced tech environment.\nExperience with building and operating distributed databases and services that are long-term and evolvable.\nExperience in organization design for a team that is scaling up. \nExpertise with a public cloud provider (AWS, GCP, Azure) and their Storage, VM, networking, Kubernetes, Security offerings.\nExcellent communication skills and the ability to work well within a team and with teams across the engineering organization.\nYour Location:\nThis position is US - Remote Eligible. The role may include occasional work at an Airbnb office or attendance at offsites, as agreed to with your manager. While the position is Remote Eligible, you must live in a state where Airbnb, Inc. has a registered entity. Click here for the up-to-date list of excluded states. This list is continuously evolving, so please check back with us if the state you live in is on the exclusion list. If your position is employed by another Airbnb entity, your recruiter will inform you what states you are eligible to work from.\nOur Commitment To Inclusion & Belonging:\nAirbnb is committed to working with the broadest talent pool possible. We believe diverse ideas foster innovation and engagement, and allow us to attract creatively-led people, and to develop the best products, services and solutions. All qualified individuals are encouraged to apply.\nWe strive to also provide a disability inclusive application and interview process. If you are a candidate with a disability and require reasonable accommodation in order to submit an application, please contact us at: reasonableaccommodations@airbnb.com. Please include your full name, the role you’re applying for and the accommodation necessary to assist you with the recruiting process. \nWe ask that you only reach out to us if you are a candidate whose disability prevents you from being able to complete our online application.\nHow We'll Take Care of You:\nOur job titles may span more than one career level. The actual base pay is dependent upon many factors, such as: training, transferable skills, work experience, business needs and market demands. The base pay range is subject to change and may be modified in the future. This role may also be eligible for bonus, equity, benefits, and Employee Travel Credits.  \nPay Range\n$204,000—$255,000 USD",
    "job_link": "https://careers.airbnb.com/positions/7026858/",
    "posted_date": "Not specified",
    "company": "Airbnb",
    "scraped_at": "2025-09-10T15:43:17.794227"
  },
  {
    "title": "Engineering Manager, Media Foundation: Ingestion & Serving Team",
    "location": "United States",
    "experience_required": "Not specified",
    "job_description": "Airbnb was born in 2007 when two hosts welcomed three guests to their San Francisco home, and has since grown to over 5 million hosts who have welcomed over 2 billion guest arrivals in almost every country across the globe. Every day, hosts offer unique stays and experiences that make it possible for guests to connect with communities in a more authentic way.\nThe Community You Will Join: \nWe are building Airbnb’s next-gen Media infrastructure, a mission-critical foundation that powers the immersive experiences central to our product vision. As part of the Product Foundation Org, you and your team will be at the forefront of innovation, directly impacting how millions of users engage with Airbnb by building and improving the core media capabilities that unlock a whole slew of exciting new features across the platform. Your work will be crucial to shaping the future of discovery, booking, and connection on Airbnb.\nThe Difference You Will Make:\nAs the Media Ingestion & Serving team Engineering Manager,  you lead a team of talented & diverse software engineers to build & operate Airbnb’s Media infrastructure. You play a significant role in shaping the team vision and help steer the organization towards our larger goals. This includes day-to-day operations, technical deep dives, community engagement, and strategic planning.  You work closely with your peers across Product & Infrastructure Engineering, Marketing, and Operations orgs.\nOur engineering managers are responsible for creating the vision and then delivering a solution that is flexible, always available, efficient, and scales with the needs of the business. Each manager brings their own unique skill set, experiences, thought leadership and technical expertise to solve these technical challenges for Airbnb.\nA Typical Day: \nWork with team leads and cross-functional leads to define and execute on an end to end vision and roadmap for Airbnb’s Media Foundation\nNurture a culture of technical quality from design, through code review, to production, and ongoing operational excellence.\nBuild strong partnerships with internal teams across product and infrastructure by developing and communicating a clear and impactful vision and priorities for the team. \nMentor and empower senior ICs to grow their impact beyond individual contributions, creating opportunities for them to lead technical initiatives that span across platforms and organizations.\nYour Expertise:\n3-5+ years of engineering management experience, with 9+ years of relevant software development experience in a fast paced tech environment.\nStrong expertise in building large-scale backend systems and experience building & maintaining media infrastructure.\nYou have excellent communication skills and the ability to work well within a team and with teams across the engineering, product & design organizations \nFlexible in leadership style, can adapt to a variety of ways of working depending on the situation.\nCreating a strong culture of operational excellence with focus on raising the bar for quality, reliability, and availability.\nYou are passionate about efficiency, availability, technical quality and system quality.\nAble to identify, retain, grow, and acquire critical talent.\nYour Location:\nThis position is US - Remote Eligible. The role may include occasional work at an Airbnb office or attendance at offsites, as agreed to with your manager. While the position is Remote Eligible, you must live in a state where Airbnb, Inc. has a registered entity. Click here for the up-to-date list of excluded states. This list is continuously evolving, so please check back with us if the state you live in is on the exclusion list. If your position is employed by another Airbnb entity, your recruiter will inform you what states you are eligible to work from.\nOur Commitment To Inclusion & Belonging:\nAirbnb is committed to working with the broadest talent pool possible. We believe diverse ideas foster innovation and engagement, and allow us to attract creatively-led people, and to develop the best products, services and solutions. All qualified individuals are encouraged to apply.\nWe strive to also provide a disability inclusive application and interview process. If you are a candidate with a disability and require reasonable accommodation in order to submit an application, please contact us at: reasonableaccommodations@airbnb.com. Please include your full name, the role you’re applying for and the accommodation necessary to assist you with the recruiting process. \nWe ask that you only reach out to us if you are a candidate whose disability prevents you from being able to complete our online application.\nHow We'll Take Care of You:\nOur job titles may span more than one career level. The actual base pay is dependent upon many factors, such as: training, transferable skills, work experience, business needs and market demands. The base pay range is subject to change and may be modified in the future. This role may also be eligible for bonus, equity, benefits, and Employee Travel Credits.  \nPay Range\n$204,000—$255,000 USD",
    "job_link": "https://careers.airbnb.com/positions/7217178/",
    "posted_date": "Not specified",
    "company": "Airbnb",
    "scraped_at": "2025-09-10T15:43:18.957853"
  }
]