[
  {
    "title": "Senior Sales Manager, Adapt Rapid Response, Amazon Ads",
    "location": "Milan, MI, ITA\n|\nJob ID: 3020779",
    "experience_required": "Not specified",
    "job_description": "DESCRIPTION\nAmazon Ads is dedicated to driving measurable outcomes for brand advertisers, agencies, authors, and entrepreneurs. Our ad solutions—including Twitch and Prime Video ADs—leverage Amazon’s innovations and insights to find, attract, and engage intended audiences throughout their daily journeys. With a range of flexible pricing and buying models, including self-service, managed service, and programmatic ad buying, these solutions help businesses build brand awareness, increase product sales, and more. We start with the customer and work backwards in everything we do, including advertising. If you’re interested in joining a rapidly growing team working to build a unique, world-class advertising group with a relentless focus on the customer, you’ve come to the right place.\n\nThis role sits within the Adapt team—a pioneering team that's redefining how we approach business. Different from traditional teams within Amazon Ads, Adapt combines human expertise with AI-enhanced analytics to revolutionize business continuity and growth. Our team members are agile professionals who thrive on variety, rotating across strategic assignments to address business-critical needs. This innovative model accelerates professional growth through diverse exposure to multiple facets of Amazon Ads, while leveraging technology to enhance customer value delivery.\n\nKey job responsibilities\nAdapt is seeking a Senior Sales Manager to join our European team - This is a permanent position.\n\nThis role will be highly agile and fungible, and will see the individual owning deliverables across multiple teams at once. This role will join a new team that focuses on a set of priority assignments designed to drive incremental revenue opportunities across multiple book of businesses. There will be expectations to travel when appropriate, as the role will support our ads businesses across EU5.\n\nKey job responsibilities\n* Provide seamless sales support, ensuring continuity and effectiveness in sales operations, while driving revenue across Amazon Ads as a Senior Sales Manager.\n* Travel within Italy primarily to match where the customer is and/or across EU5 when supporting them through your assignment-based work. We expect up to 50% travel time.\n* Generate advertising revenue via ad agencies and advertisers directly, through objective led selling across Streaming TV and other brand-building advertising solutions\n* Be a true hunter, hungry to uncover opportunities and connect it with a value adding solution\n* Influence buying decisions to drive increased revenue from existing advertisers as well as new revenue streams\n* Establishes credible relationships with agencies and advertiser decision makers, in particular in the TV and Digital landscape\n\nAbout the team\nAmazon Adapt is a program designed to offer coverage solutions for business gaps which may occur due to extended leave (parental, medical) and unexpected account transitions or gaps in business needs. Amazon Adapt deploys highly skilled, hyper-agile talent that ensures customers can continue to invest in their partnerships with Amazon Advertising, uninterrupted. The program ensures that the high bar for customer service, strategic partnership, and revenue attainment is maintained during these coverage gaps.\n\nLearn more about the Adapt team by hearing from our leaders here - https://www.youtube.com/watch?v=QzzMRk7LQCA.\nBASIC QUALIFICATIONS\n* Experience building client and agency relationships * Experience closing sales and revenue generation\n* Excellent verbal and written communication skills\n* Adaptability and enthusiasm for working with emerging technologies\n* Business Fluent in English and Italian\nPREFERRED QUALIFICATIONS\nBachelors’ degree in Marketing, Advertising or related field.\nStrong track record of high level negotiation and successful internal and external relationship management.\nExperience with TV/STV/Video ad sales or agency Knowledge of digital marketplace and understanding of the video competitive landscape\nExperience in fast-paced, technology-driven sales environments\n\nAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (https://www.amazon.jobs/en/privacy_page) to know more about how we collect, use and transfer the personal data of our candidates.\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.",
    "job_link": "https://www.amazon.jobs/en/jobs/3020779/senior-sales-manager-adapt-rapid-response-amazon-ads",
    "posted_date": "Posted June 27, 2025",
    "company": "Amazon",
    "scraped_at": "2025-09-10T15:24:29.194207"
  },
  {
    "title": "Operations Supervisor - Medina",
    "location": "Medina, SAU\n|\nJob ID: 3057892",
    "experience_required": "Not specified",
    "job_description": "DESCRIPTION\nYou should be able to motivate a team of individuals to meet targets and productivity expectations in line with company goals. You should be prepared to take responsibility for tracking the attendance and work flow of that team and work alongside the Shift Manager to highlight and rectify issues as they arise.\n\n\nKey job responsibilities\n- Create and cultivate a safe working environment by identifying safety opportunities across your work area\n- Manage and train our Associates to help deliver the best service for our customers\n- Ensure that customer orders are fulfilled in line with quality and safety guidelines\n- Continuously provide critical shift related information to frontline management and operators\n- Adjust labor allocation throughout the shifts to meet and exceed plans and forecasts\n- Engage with support functions and/or other departments to address common issues or needs in key areas of performance e.g. process area readiness, 5S, safety, training\n- Help to solve logistics and supply chain challenges through data analysis, innovation and process optimization\n\nA day in the life\nThe Ideal Candidate:\n\n- Demonstrates strong communication skills, a high level of ownership, and a commitment to leading by example. Capable of developing expertise in all operational processes.\n- Able to analyze data, motivate team members to excel, and, most importantly, consistently place the customer at the center of all decision-making.\n- Willing and able to work weekends and provide overtime support as needed (AM & PM).\n- Flexible with scheduling, including night shifts and variable work hours.\n\n\nIf you are engaging, innovative, supportive, a problem solver or a trail blazer we want to hear from you!\nBASIC QUALIFICATIONS\n- High school or equivalent\n- 1+ years of Microsoft Office products and applications experience\n- Can lift up to 49 pounds, stand/walk during shifts lasting up to 12 hours, and be able to frequently push, pull, squat, bend, and reach\n- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays\n- Work 40 hours/week, and overtime as required\n- Fluent in English language (Spoken/Written)\nPREFERRED QUALIFICATIONS\n- Bachelor degree in Engineering related fields\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.",
    "job_link": "https://www.amazon.jobs/en/jobs/3057892/operations-supervisor-medina",
    "posted_date": "Posted August 13, 2025",
    "company": "Amazon",
    "scraped_at": "2025-09-10T15:24:30.487409"
  },
  {
    "title": "Program Manager, Marketplace Fees (UAE national), MENATR Seller Fees",
    "location": "Dubai, ARE\n|\nJob ID: 3057875",
    "experience_required": "Not specified",
    "job_description": "DESCRIPTION\nAs a Program Manager for Seller Fees and incentives, you will work with Product and Program Managers and cross-functional business teams (Local and WW) to implement our monetization strategy and launch & operate various seller incentives and promotions across the UAE, KSA, Egypt, and Turkiye. The PM will drive execution and controllership of all seller promotions and incentives.\n\nKey job responsibilities\nAs the central PM for MENATR fees and seller incentives , this role requires exceptional program management and data analysis skills, ability to conduct deep dive analyses, and strong stakeholder management skills. The candidate must thrive in a fast-paced environment, balancing multiple tasks while maintaining attention to detail and effective communication with diverse stakeholders. The candidate must have or will have to develop SQL proficiency and be able to build queries and dashboards for tracking performance of seller incentives.\nBASIC QUALIFICATIONS\n- Bachelor's degree in Finance, Economics, Business Administration, or related field\n- Exceptional written and verbal communication skills with the ability to create compelling positioning strategy and present complex information clearly and concisely\n- Strong analytical and quantitative skills with the ability to use data and metrics to justify requirements, improvements and initiatives\n- High attention to detail and proven ability to manage multiple, competing priorities simultaneously\n- Knowledge of Microsoft Excel at an advanced level, including: pivot tables, macros, index/match, vlookup, VBA, data links, etc.\n- Basic SQL proficiency\nPREFERRED QUALIFICATIONS\n- Medium to advances SQL proficiency; ability to understand and write their own complex queries\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.",
    "job_link": "https://www.amazon.jobs/en/jobs/3057875/program-manager-marketplace-fees-uae-national-menatr-seller-fees",
    "posted_date": "Posted August 13, 2025",
    "company": "Amazon",
    "scraped_at": "2025-09-10T15:24:31.519846"
  },
  {
    "title": "Program Manager, UAE National",
    "location": "Dubai, ARE\n|\nJob ID: 3031602",
    "experience_required": "Not specified",
    "job_description": "DESCRIPTION\nAs a Program Manager, you'll be at the forefront of transforming experiences across the Middle East and North Africa. Your strategic insights and collaborative approach will directly impact how sellers and customers interact with Amazon's ecosystem, driving innovation and operational excellence.\n\n\nKey job responsibilities\n- Develop and Execute Product Vision: Craft comprehensive product strategies that align with customer needs and business objectives\n- Data-Driven Decision Making: Analyze complex data sets to uncover actionable insights and drive product improvements\n- Competitive Intelligence: Conduct thorough market research and competitive analysis to identify strategic opportunities\n- Customer Research: Lead initiatives to deeply understand customer preferences, pain points, and emerging expectations\n- Process Optimization: Develop comprehensive understanding of domestic and international fulfillment processes\n- Performance Management: Establish robust tracking mechanisms for pilot initiatives and seller engagement\n- Stakeholder Collaboration: Facilitate regular communication and alignment across diverse teams and geographies\n\n\nA day in the life\nYour day will be dynamic and impactful, focusing on creating seamless connections between various business units. You'll navigate complex projects, engage with cross-functional teams, and develop innovative solutions that enhance our operational capabilities. Each day presents an opportunity to solve intricate challenges and drive meaningful improvements.\n\nAbout the team\nWe are a collaborative group passionate about creating seamless, intuitive customer experiences. Our team values innovative thinking, data-driven decision-making, and a commitment to continuous improvement. We believe in empowering our team members to challenge conventions and develop solutions.\nBASIC QUALIFICATIONS\n- 2+ years of program or project management experience\n- Bachelor's degree or equivalent\n- Knowledge of Excel at an intermediate level (e.g., pivot tables & charts, multiple criteria lookups, nested logical/IF formulas, data cleansing, array formulas, etc.)\nPREFERRED QUALIFICATIONS\n- Experience in MS Access and SQL\n- Speak, write, and read fluently in Arabic\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.",
    "job_link": "https://www.amazon.jobs/en/jobs/3031602/program-manager-uae-national",
    "posted_date": "Posted July 11, 2025",
    "company": "Amazon",
    "scraped_at": "2025-09-10T15:24:32.472384"
  },
  {
    "title": "Fulfillment Center Supervisor",
    "location": "Riyadh, SAU\n|\nJob ID: 3068097",
    "experience_required": "Not specified",
    "job_description": "DESCRIPTION\nWe’re expanding our team within Amazon Operations! If you’re interested in joining a business where you can have fun, achieve amazing results and put smiles on people’s faces, this could be the role for you.\n\nYou will oversee the shift management in one of our first mile fulfillment centers, middle mile sortation centers or final mile delivery stations. Our Operations Specialists drive the pulse of our operations on the ground and play a key role in getting our customers’ orders out to them in every step of the chain.\nThis is a varied, challenging role and every day is different!\n\n\nKey job responsibilities\n• Create and cultivate a safe working environment by identifying safety opportunities across your work area\n• Manage and train our Associates to help deliver the best service for our customers\n• Ensure that customer orders are fulfilled in line with quality and safety guidelines\n• Continuously provide critical shift related information to frontline management and operators\n• Adjust labor allocation throughout your shifts to meet and exceed plans and forecasts\n• Engage with support functions and/or other departments to address common issues or needs in key areas of performance e.g. process area readiness, 5S, safety, training\n• Help to solve logistics and supply chain challenges through data analysis, innovation and process optimization\nBASIC QUALIFICATIONS\n- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays\n- Experience managing medium to large teams.\n- Experience working with data analysis and/or making decisions based on analysis.\nPREFERRED QUALIFICATIONS\n- If you are engaging, innovative, supportive, problem solver, and you worked in fast paced environment we want to hear from you!\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.",
    "job_link": "https://www.amazon.jobs/en/jobs/3068097/fulfillment-center-supervisor",
    "posted_date": "Posted August 28, 2025",
    "company": "Amazon",
    "scraped_at": "2025-09-10T15:24:34.008085"
  },
  {
    "title": "Linehaul Supervisor , AMET - LH - Operations",
    "location": "Riyadh, SAU\n|\nJob ID: 3072836",
    "experience_required": "Not specified",
    "job_description": "DESCRIPTION\nWe are seeking an experienced and dynamic Linehaul (LH) Supervisor to join our logistics team. The ideal candidate will oversee and optimize our linehaul operations, ensuring efficient and timely movement of line haul end to end. This role is crucial in maintaining high service levels, and improving overall operational performance. You will need to thrive and deliver results in an ambiguous, fast paced, dynamic environment. If you have a quality focused, customer obsessed industry background which carries with it experience of working in a fast paced, ever changing and ambiguous environment. We'd love to hear from you.\n\nKey job responsibilities\nOverseeing the operation that focuses on Amazon's freight.\n• Support your team in daily management of Line Haul activities, including managing the logistics and transportation, ensuring timely and cost-effective delivery. LH supervisor will coordinate with carriers, shippers, and warehouses, handle documentation, and resolve any issues that arise during transit\n\nA day in the life\n1. Represent Amazon in communications with vendors.\n2. Optimize load planning and route efficiency to maximize asset utilization and minimize costs\n3. Ensure compliance with TGA regulations, hours of service rules, and company policies\n4. Monitor and analyze key performance indicators (KPIs) to identify areas for improvement\n5. Coordinate with other departments, including FCs and SNOP and line haul carries.\n6. Troubleshoot and resolve operational issues in real-time\n7. Implement and maintain safety protocols to ensure driver and cargo security.\n8. Collaborate with vendors and carriers to negotiate rates and maintain strong relationships\n9. Participate in continuous improvement initiatives to enhance operational efficiency\nBASIC QUALIFICATIONS\n- 1+ years of Microsoft Office products and applications experience\n- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays\n- Work 40 hours/week, and overtime as required\nPREFERRED QUALIFICATIONS\n- 1+ years of Amazon Amnesty Floor Monitoring experience\n- Bachelor's degree or equivalent, or 2+ years of Amazon (blue badge/FTE) experience\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.",
    "job_link": "https://www.amazon.jobs/en/jobs/3072836/linehaul-supervisor-amet-lh-operations",
    "posted_date": "Posted September 4, 2025",
    "company": "Amazon",
    "scraped_at": "2025-09-10T15:24:35.647779"
  },
  {
    "title": "Channel Team Lead",
    "location": "Dubai, ARE\n|\nJob ID: 3068087",
    "experience_required": "Not specified",
    "job_description": "DESCRIPTION\nAmazon.com strives to be Earth's most customer-centric company where people can find and discover virtually anything they want to buy online. By giving customers more of what they want - low prices, vast selection, and convenience - Amazon.com continues to grow and evolve as a world-class e-commerce platform. Amazon's evolution from Web site to e-commerce partner to development platform is driven by the spirit of innovation that is part of the company's DNA. The world's brightest technology minds come to Amazon.com to research and develop technology that improves the lives of shoppers and sellers around the world.\n\nAmazon Operations\nAmazon Worldwide Operations is the underlying fulfillment and customer service engine that ensures Amazon creates the same consistent, world-class customer experience every time. We are looking for high-potential, flexible, innovative, and forward-thinking professionals to join our MENA Ops Reverse Logistics team.\nJoin the RL Operations team as Channel Team Leader. As a CTL, you will be responsible for monitoring multiple sites from operations and compliance point of view. You will be working with multiple internal and external stakeholders to achieve timely launches and operations metrics. With customer obsession and a high sense of ownership, you will utilize your skills to identify patterns and any disruptions in it. You should be able to dive deep, scrutinize details and foresee data implications.\n\nKey job responsibilities\nQuickly understand the business issues and challenges of Transportation operations; identify strengths/weaknesses and suggest areas for improvement\n· Map business requirements, understand business process, study and analyze workflows, design solutions and prepare functional specifications\n· Be data driven, develop and report performance metrics, executive updates, forecasting, budgeting and analysis to identify potential opportunities for improving Customer Experience.\n· Deep dive and acquire an extensive knowledge of emerging industry practices and apply when solving business problems.\n· Design, develop, pilot & rollout enterprise wide programs around performance improvement, cycle time improvement for returns, delivery experience, financial auditing, identification of alternate delivery services etc.\n\nDaily Work include:\nMonitoring performance of the program daily\nAction plan to achieve the program targets\nManaging ramp ups/scouting\nVendor Management\nPreparing daily performance summary\nBASIC QUALIFICATIONS\n-Experience managing vendors.\n-Experience with planning, performance metrics, and process improvement\nPREFERRED QUALIFICATIONS\n- Experience in logistics\n- Experience with data analysis\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.",
    "job_link": "https://www.amazon.jobs/en/jobs/3068087/channel-team-lead",
    "posted_date": "Posted August 28, 2025",
    "company": "Amazon",
    "scraped_at": "2025-09-10T15:24:36.702299"
  },
  {
    "title": "ICQA Supervisor",
    "location": "Jeddah, SAU\n|\nJob ID: 3051520",
    "experience_required": "Not specified",
    "job_description": "DESCRIPTION\nAs a Supervisor, you’ll strive to plan beyond your own needs, ensuring the sufficient resourcing of your function. This will include identifying training needs, staying on top of absence & performance management, as well as coaching and continuous monitoring of your department to engender a greater culture of productivity. Supervising day-to-day activities with responsibility for the overall safety, quality and performance and member experience of either Inbound or Outbound FC operations; Setting and clarifying departmental requirements and expectations while creating an environment of teamwork, collaboration and open communication; Understanding safety procedures, ensuring safe working practices and documenting accidents/incidents timely; Prioritizing appropriately meeting deadlines; Exhibiting professional behavior while coping well with ambiguity and change; Driving results and approaching obstacles proactively; Ensuring company policies are communicated and enforced consistently; Sourcing and nurturing ideas and rolling them into the creation of improvement plans; Taking proactive steps to ensure that best practices are shared across all departments, shifts and within the entire organization; Working closely with (HR, Facilities, Safety and IT) to build and secure support and resources for projects and initiatives; Tracking production metrics and utilizing data to develop strategies for continuous improvement and reporting to management; Assisting with the establishment of long-term operational strategic plans; Mentoring, providing training and development to optimize performance, creating organizational depth and individual growth; Recognizing top performance, coaching and progressive discipline for poor performance; Proposing and implementing improvements in equipment and processing methods; Conducting timecard review daily and weekly to ensure pay accuracy; Performing other duties with flexibility as assigned, rotating to other shifts/departments and working extended hours and holidays as needed including an expectation to arrive at least 30 minutes early and remaining at least 30 minutes at end of shift to complete pass downs, reports and timecard reviews.\nBASIC QUALIFICATIONS\n- 1+ years of Microsoft Office products and applications experience\n- High school or equivalent\n- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays\n- Can lift up to 49 pounds, stand/walk during shifts lasting up to 12 hours, and be able to frequently push, pull, squat, bend, and reach\n- Work 40 hours/week, and overtime as required\nPREFERRED QUALIFICATIONS\n- Honest with highest integrity; Dedicated to quality and high standards; Supportive of values following policies and procedures; Positive, ambitious, energetic, hardworking with a strong work ethic; A team player valuing co-worker's opinions treating everyone with courtesy and respect; Able to communicate effectively and take direction; Dependable, responsible, reliable and mature; Exceptional listener who is well organized and has an eye for detail; Able to work in a team environment, provide honest and direct feedback; Able to handle ambiguity, changing priorities and use good judgment in stressful situations; Experienced with performance metrics; Analytical with problem solver abilities; Self-motivated, structured, accurate, result driven, ready to improve and open to change; Proven history of illustrating a dedication to meeting requirements of internal and external customers, responding to all requests promptly, thoroughly and timely; Ability to multi-task, handling multiple issues; Experienced in MS Office, other operating systems, warehousing systems and applications such as Warehouse Management Systems (Highjump); Able to work in a fulfillment center environment that may be noisy, walking and standing for long periods of time, lifting up to 50 pounds, bending and using mechanical equipment as part of production activities; Flexible to work a variety of hours as the business demands, including overnight, weekends and holidays.\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.",
    "job_link": "https://www.amazon.jobs/en/jobs/3051520/icqa-supervisor",
    "posted_date": "Posted August 5, 2025",
    "company": "Amazon",
    "scraped_at": "2025-09-10T15:24:37.717544"
  },
  {
    "title": "Software Development Engineer II, Alexa Connect Kit, Alexa Smart Home",
    "location": "Bangalore, KA, IND\n|\nJob ID: 2670460",
    "experience_required": "Not specified",
    "job_description": "DESCRIPTION\nWould you like to be a part of building out the future of Smart Home Devices? Want to join a team that enables device makers to build smart home appliances?\n\nThe Alexa Connect Kit Team is seeking a Software Development Engineer to help develop new solutions focused on improving the quality, diversity, and customer experience of smart home devices.\n\nThe Alexa Smart Home team is focused on making Alexa the user interface for the home. Customers love using Alexa to interact with their homes through natural commands and intuitive interfaces. We are evolving Alexa into an intelligent, indispensable companion that helps customers get the most out of the technology in their homes.\n\nThe Alexa Connect Kit team is a team within Alexa Smart Home. We offer managed services (cloud services, firmware, devices) for enabling device makers to build smart home appliances. We work across verticals that Alexa Smart Home supports, partnering with manufacturers to bring to market everything from Christmas trees, coffee makers to light switches and air purifiers. We get to help out big grand partners such as Toshiba, Sharp, Hamilton Beach and more realize their product vision at what they do best, whilst we bring best in class Alexa and Smart Home features into their products in an easy to integrate manner.\n\nKey job responsibilities\nAt Amazon, we hire the best minds in technology to innovate and build on behalf of our customers. The challenges SDEs solve for at Amazon are big and influence millions of customers, sellers, and products around the world.\n\nAs a member of the Alexa Connect Kit team, you will be responsible for delivering tools and services to simplify the process for device makers to seamlessly manufacture IoT enabled devices. You will design and own solutions to simplify the device manufacturing processes providing innovative solutions to manufacturing processes. You will also be responsible for owning the SDK partners integrate with to connect their devices with Alexa's Smart Home Cloud.\n\nThe ideal teammate is passionate about Alexa and has a track record of success in delivering new features and products. A commitment to teamwork, knowledge of IoT systems, strong CS fundamentals, experience developing new systems, and strong communication skills (to both business and technical partners) are absolute requirements.\n\nAbout the team\nOur vision is to make customers’ lives at home easier and more convenient by connecting every home appliance to Alexa.\n\nYou will get a startup like culture with the stability of an established industry leader. You will get support and resources from some of the smartest people in the industry to continue learning. You will build software that will materially improve people’s lives.\nBASIC QUALIFICATIONS\n- 3+ years of non-internship professional software development experience\n- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\n- Experience programming with at least one software programming language\nPREFERRED QUALIFICATIONS\n- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\n- Bachelor's degree in computer science or equivalent\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.",
    "job_link": "https://www.amazon.jobs/en/jobs/2670460/software-development-engineer-ii-alexa-connect-kit-alexa-smart-home",
    "posted_date": "Posted June 13, 2024",
    "company": "Amazon",
    "scraped_at": "2025-09-10T15:24:38.717307"
  },
  {
    "title": "Sr. Industry Specialist Auto, AWS GCR Industry Specialist",
    "location": "Beijing, CHN\n+2 other locations\n|\nJob ID: 3079309",
    "experience_required": "Not specified",
    "job_description": "DESCRIPTION\nAbout Amazon Web Services Since 2006, Amazon Web Services has been the world’s most comprehensive and broadly adopted cloud. AWS has been continually expanding its services to support virtually any workload, and it now has more than 240 fully featured services for compute, storage, databases, networking, analytics, machine learning and artificial intelligence (AI), Internet of Things (IoT), mobile, security, hybrid, media, and application development, deployment, and management from 105 Availability Zones within 33 geographic regions, with announced plans for 18 more Availability Zones and 6 more AWS Regions in Malaysia, Mexico, New Zealand, the Kingdom of Saudi Arabia, Thailand. Millions of customers—including the fastest-growing startups, largest enterprises, and leading government agencies—trust AWS to power their infrastructure, become more agile, and lower costs. To learn more about AWS, visit aws.amazon.com.\nAWS Global Sales drives adoption of the AWS cloud worldwide, enabling customers of all sizes to innovate and expand in the cloud. Our team empowers every customer to grow by providing tailored service, unmatched technology, and consistent support. We dive deep to understand each customer's unique challenges, then craft innovative solutions that accelerate their success. This customer-first approach is how we built the world's most adopted cloud. Join us and help us grow.\n\n\n[AWS China Introduction] Amazon Web Services came to China in 2013, and has been relentlessly investing and expanding our infrastructure and business since then. Amazon Web Services launched its China (Beijing) Region (operated by Sinnet) in September 2016 and its China (Ningxia) Region (operated by NWCD) in December 2017. In 2019, Amazon Web Services added a new region in Hong Kong, making China the only country with three Amazon Web Services regions aside from the U.S. In 2022, Amazon Web Services launched Local Zone in Taipei. Amazon Web Services has also established an AI lab in Shanghai and two IoT labs in Shenzhen and Taipei. The Amazon Web Services Partner Network has thousands of Partners in China. Amazon Web Services has supported over 10,000 local startups and has provided cloud skills training to over 700,000 talents. Amazon’s first two utility-scale renewable projects—a solar farm and a wind farm—are also generating clean energy to the country’s grid.\n\nJob description\nIn this role, you will include helping to define main industry use cases, assets and solutions, finding strategic partners, assembling cross-functional engagement teams, and driving business and technical relationships with customers to create significant new line of business pipelines. You will enable the AWS enterprise BD teams to more effectively drive their day-to-day interactions with key prospects. You will work closely with AWS Solutions Architects, AWS Partners and AWS Professional Services teams to develop and promote solutions for target use cases. And you will work closely with the AWS product and services teams to help evolve AWS offerings for more rapid enterprise adoption while addressing issues, concerns, and requests from the field.\n\n\nKey job responsibilities\n- Serving as a key member of the AWS GCR Industry Specialist team in helping to drive AWS marketing, BD, and technical strategy for the Auto industry, requiring a business development or consulting background, experience working with AUTO customers at the CxO/VP level, and a good understanding of legacy and emerging technologies in the AUTO industry, especially in the connected vehicle (V2X/IoV) solutions field including data acquisition to analytics and smart cockpit ecosystems.\n- Defining Automotive industry use cases, assets and solutions, finding strategic partners, assembling cross-functional engagement teams, and driving business and technical relationships with customers to create significant new line of business pipelines.\n- Working closely with AWS Solutions Architects, AWS Partners, and AWS Professional Services teams to develop and promote solutions for target use cases.\n- Developing industry-specific solutions and collateral materials that effectively communicate the business value that AWS could bring to customers and engaging with the marketing team to improve AWS Brand awareness in the industry.\n- Preparing and presenting business reviews to the senior management team regarding progress to move barriers and get support.\n\n\n\n\n\n\nAbout the team\nDiverse Experiences\nAWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\n\nWhy AWS?\nAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\n\nUpdated July 7:\nInclusive Team Culture\nAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\n\n\nMentorship & Career Growth\nWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\n\nWork/Life Balance\nWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\n\nAWS is committed to a diverse and inclusive workplace to deliver the best results for our customers. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status; we celebrate the diverse ways we work. For individuals with disabilities who would like to request an accommodation, please let us know and we will connect you to our accommodation team.\n\n#AWSGCR\nBASIC QUALIFICATIONS\n- Experience developing strategies that influence leadership decisions at the organizational level\n- 6+ years of responding to requests for proposals (e.g., determining requirements, matching requirements to technical approach and solutions, developing solutions against requirements) experience\n- Bachelor's degree\n- Experience influencing internal and external stakeholders\n- 8+ years of business development, partnership management, or sourcing new business experience\nPREFERRED QUALIFICATIONS\n- Experience interpreting data and making business recommendations\n- Experience identifying, negotiating, and executing complex legal agreements\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.",
    "job_link": "https://www.amazon.jobs/en/jobs/3079309/sr-industry-specialist-auto-aws-gcr-industry-specialist",
    "posted_date": "Posted September 10, 2025",
    "company": "Amazon",
    "scraped_at": "2025-09-10T15:24:39.733532"
  }
]