[
  {
    "title": "Senior Test Development Engineer",
    "location": "IN,Hyderabad\nBuilding 11, Survey No. 64 at Campus, Mindspace, Madhapur\nHyderabad, Telangana\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\nSenior Test Development Engineer\n THE ROLE: \nAMD is looking for a specialized software product engineer who is passionate about improving the quality of products and benchmarks. You will be a member of a core team of incredibly talented industry specialists and will work with the very latest hardware and software technology. The right engineer will drive the success of features in AMD (Advanced Micro Devices) products through leadership & coordination, resolution of technical dependencies, and achievement of schedule commits.\n THE PERSON: \nThe ideal candidate should be passionate about software engineering and possess leadership skills to drive sophisticated issues to resolution. Your curiosity will drive your learning and innovation to improve how we as a group, and an organization, can get better every day. Your peers will provide you a results-oriented and encouraging environment for your career growth, fueling your opportunity to be a part of Delighting Our Customers.    \n KEY RESPONSIBILITIES: \nYou will be responsible for the development of the test suites that ensure enterprise quality for AMD’s Software Compute stack\nYou will work closely with other software and hardware engineers and architects\nEnsure test coverage for the GPU product features\nReview requirements and create associated test cases to ensure traceability\nCoordinate triaging of issues and drive them to closure \nMake tough decisions such as priority calls based on partial or incomplete data   \nProactively drive continuous improvement for functional and performance QA activities \nMust be a self-starter, and able to independently drive tasks to completion \n PREFERRED EXPERIENCE: \nProduct development or systems engineering background with hardware platforms and their software & firmware ecosystems \nTest plan and test development experience for a range of industry workloads\nStrong knowledge of GPU, CPU, SoC or computer system architecture\nKnowledge of OpenCL or CUDA GPU Computing Languages a plus\nProven record in large scale data center engineering\nParallel Computing Skills with MPI Programing experience a plus\nDeep Learning, High Performance Computing or GPU Server Based computing a big plus\nFamiliar with\nAI/ML concepts\nGeneral Computer Architecture concepts\nBasics of programming\nMicrosoft and Linux Operating Systems\nCloud, Virtualization and Container environments\nSystem level, functional and environmental stress testing\nExcellent interpersonal, organizational, analytical, planning, and technical leadership skills \n ACADEMIC CREDENTIALS: \nBachelor’s or Master's degree in Computer/Electronics/Electrical Engineering or equivalent \n #LI-NR1\n\n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/65460?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-11T00:25:22.240249"
=======
    "scraped_at": "2025-09-11T02:36:00.373490"
>>>>>>> Stashed changes
  },
  {
    "title": "Sr Technical QA Engineer",
    "location": "IN,Hyderabad\nBuilding 11, Survey No. 64 at Campus, Mindspace, Madhapur\nHyderabad, Telangana\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\nSr Technical QA Engineer\n THE ROLE: \nWe are seeking an engineer to join our team that will thrive in a fast-paced work environment, using effective communication, problem-solving and prioritization skills. Individuals that are well organized, show great attention to detail, and employ critical thinking are well-suited for our team.\n  THE PERSON: \nWe are looking for an experienced Senior QA engineer with expertise in virtualization, hypervisors, GPU virtualization, and advanced I/O technologies. This role drives comprehensive feature validation and roadmap projects while ensuring robust quality assurance strategies across traditional and specialized virtual environments. Your remit will include validating GPU virtualization and the intricacies of SR-IOV (Single Root I/O Virtualization) and pass-through technologies, all crucial for delivering high-performance computing, AI, platform specific and data-intensive applications\n  As a QA Tech lead, you will be the driving force behind the quality assurance process for our cutting-edge AI SDK products. You will drive accountability in development practices, audit CI processes, enforce stringent unit test code coverage, and oversee high-level functional test content execution. In addition, you must have hands-on development and validation expertise, including robust experience in SDK development and validation, as well as a deep understanding of AI/ML, GPU environments, and Linux systems. You will work directly with development teams—holding them accountable for maintaining and exceeding quality metrics—while also leading collaborative efforts with our Test Content Teams (TCT) and Automation groups to keep our product at the forefront of innovation.\n  Key Responsibilities\n Establish and maintain high-quality standards by defining QA best practices and promoting a culture of accountability across development teams.\nUtilize your hands-on development knowledge to design integrated validation strategies that align with overall project goals.\nCollaborate directly with engineers, ensuring they deliver high-quality code that complies with established test coverage and CI/CD best practices.\nDefine, monitor, and enforce high standards for unit test (UT) code coverage, ensuring that all critical functionalities are thoroughly validated.\nOversee the execution of high-level functional tests, ensuring that software features and end-to-end user scenarios operate seamlessly.\nDrive the validation efforts for Software Development Kits (SDKs) by designing comprehensive test cases and testplans to verify functionality, performance, compatibility, and integration.\nConduct regular audits of the Continuous Integration (CI) pipeline, ensuring that all code undergoes rigorous automated testing and validation before integration.\nFacilitate clear communication among development, QA, and product teams; provide actionable insights to continuously improve product quality.\nWork closely with the Test Content Team to align on test content strategies and ensure the execution aligns with product requirements.\nActively participate participate in design and code reviews from a QA perspective to ensure quality is embedded in every stage of product development.\nUse your development and debugging expertise to assist in troubleshooting complex issues alongside the development teams.\nApply your knowledge and experience in AI/ML to validate data models, performance, and integration within relevant projects.\nExcellent communication and leadership skills, with the capability to bridge efforts across development and QA teams to ensure quality and timely project delivery.\nIdentify, propose, and implement process improvements to reduce the cycle time of testing phases and improve product quality.\n Serve as a trusted advisor to your peers and junior QA engineers, fostering a culture of accountability, quality, and continuous learning.\n  Requirements\nBachelor’s or master’s degree in computer science, Engineering, or a related field with 12+ yrs of related experience\nDemonstrated hands-on development expertise with practical experience in coding, debugging, and designing validation strategies.\nDeep understanding and experience with unit testing frameworks (such as JUnit, NUnit, LCOV, or similar code coverage tools).\nExtensive knowledge of CI/CD pipelines, unit testing frameworks, automated testing tools, and functional testing methodologies.\nStrong proficiency in SDK development and validation—proven ability to create and execute comprehensive test strategies that ensure robust and reliable APIs and libraries.\nIn-depth understanding of AI/ML concepts and practical testing experience in data-driven, machine learning environments.\nExposure to advanced test automation frameworks and willingness to explore new testing paradigms involving AI/ML and GPU-optimized processes.\nHands-on experience working with GPU environments and optimizing tests for performance on hardware-accelerated systems.\nStrong proficiency in working within Linux environments (Ubuntu, CentOS, etc.).\nFamiliarity with GPU computing technologies (e.g., ROCm, CUDA, OpenCL) for performance-critical applications.\nDemonstrable expertise with Docker containerization practices. Exposure to additional container orchestration tools like Kubernetes.\nPrior experience with AI/ML frameworks such as TensorFlow or PyTorch.is a plus\nAdvanced scripting and programming skills in languages such as Python, C/C++, or similar\nExceptional analytical, problem-solving, and communication skills.\nA self-driven, detail-oriented mindset with an ability to judiciously hold teams accountable.\nComfort working independently in a fast-paced, dynamic environment.\n #LI-NR1 \n\n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/65371?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-11T00:25:26.521981"
=======
    "scraped_at": "2025-09-11T02:36:03.944340"
>>>>>>> Stashed changes
  },
  {
    "title": "Senior ML Application Engineer",
    "location": "IN,Hyderabad\nBuilding 11, Survey No. 64 at Campus, Mindspace, Madhapur\nHyderabad, Telangana\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\nMTS SOFTWARE DEVELOPMENT ENGINEER \n THE ROLE: \nAMD is looking for a specialized software engineer who is passionate about improving the performance of key applications and benchmarks. You will be a member of a core team of incredibly talented industry specialists and will work with the very latest hardware and software technology.  \n THE PERSON: \nThe ideal candidate should be passionate about software engineering and possess leadership skills to drive sophisticated issues to resolution. Able to communicate effectively and work optimally with different teams across AMD.  \n Key Responsibilities\nDevelop test cases to validate functionality and performance.\nMonitor and maintain end-to-end ML test cases for the compiler in production, addressing issues as they arise.\nContribute to open-source projects, sharing your developments with the community.\nInfluence the direction of the AMD AI platform.\nCollaborate across teams with various groups and stakeholders.\n  Preferred Experience\nA minimum of 7+ years of experience in relevant fields.\nProficiency with AI/DL frameworks such as PyTorch, ONNX, or TensorFlow.\nExceptional programming skills in Python, including debugging, profiling, and performance analysis.\nExperience with machine learning pipelines and CI/CD pipelines.\nKnowledge of MLIR is a significant advantage.\nStrong communication and problem-solving abilities.\nKEY RESPONSIBILITIES: \nWork with AMD’s architecture specialists to improve future products  \nApply a data minded approach to target optimization efforts \nStay informed of software and hardware trends and innovations, especially pertaining to algorithms and architecture \nDesign and develop new groundbreaking AMD technologies \nParticipating in new ASIC and hardware bring ups  \nDebugging/fix existing issues and research alternative, more efficient ways to accomplish the same work \nDevelop technical relationships with peers and partners \n \n#LI-NR1 \n\n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/66815?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-11T00:25:30.168569"
=======
    "scraped_at": "2025-09-11T02:36:06.754315"
>>>>>>> Stashed changes
  },
  {
    "title": "Sr. Silicon Design Engineer",
    "location": "IN,Hyderabad\nBuilding 11, Survey No. 64 at Campus, Mindspace, Madhapur\nHyderabad, Telangana\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\n Sr. SILICON DESIGN ENGINEER  \n THE ROLE: \nThe position will involve working with a very experienced physical design team of Server SOC and is responsible for delivering the physical design of tiles to meet challenging goals for frequency, power and other design requirements for AMD next generation processors in a fast-paced environment on cutting edge technology.\n THE PERSON:  \nEngineer with good attitude who seeks new challenges and has good analytical and and problem-solving skills. Candidate needs to have the ability and desire to learn quickly and should be a good team player who has excellent communication skills and experience collaborating with other engineers located in different sites/timezones.  \n KEY RESPONSIBILITIES:  \nImplementing RTL to GDS2 flow\nHandling Floor-plan, Physical Implementation of Power-plan, Synthesis, Placement, CTS, Timing Closure, Routing, Extraction, Physical Verification (DRC & LVS), Crosstalk Analysis, EM/IR\nHandling different PNR tools - Synopsys ICC2, ICC, Design Compiler, PrimeTime, StarRC, Mentor Graphics Calibre, Apache Redhawk\n PREFERRED EXPERIENCE:  \n5+ years of professional experience in physical design, preferably with high performance designs.\nExperience in automated synthesis and timing driven place and route of RTL blocks for high speed datapath and control logic applications.\nExperience in automated design flows for clock tree synthesis, clock and power gating techniques, scan stitching, design optimization for improved timing/power/area, and design cycle time reduction.\nExperience in floorplanning, establishing design methodology, IP integration, checks for logic equivalence, physical/timing/electrical quality, and final signoff for large IP delivery\nStrong experience with tools for logic synthesis, place and route, timing analysis, and design checks for physical and electrical quality, familiarity with tools for schematics, layout, and circuit/logic simulation\nVersatility with scripts to automate design flow.\nStrong communication skills, ability to multi-task across projects, and work with geographically spread out teams\nExperience in FinFET & Dual Patterning nodes such as 16/14/10/7/5nm\nExcellent physical design and timing background.\nGood understanding of computer organization/architecture is preferred.\nStrong analytical/problem solving skills and pronounced attention to details.\nACADEMIC CREDENTIALS:\nQualification: Bachelors or Masters in Electronics/Electrical Engineering\n  \n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/69335?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-11T00:25:33.032821"
=======
    "scraped_at": "2025-09-11T02:36:08.680010"
>>>>>>> Stashed changes
  },
  {
    "title": "Design Verification Engineer",
    "location": "IN,Hyderabad\nBuilding 11, Survey No. 64 at Campus, Mindspace, Madhapur\nHyderabad, Telangana\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\nMTS SILICON DESIGN ENGINEER  \n THE ROLE: \nThe focus of this role is to plan, build, and execute the verification of new and existing features for AMD’s graphics processor IP, resulting in no bugs in the final design.   \n THE PERSON:  \nYou have a passion for modern, complex processor architecture, digital design, and verification in general. You are a team player who has excellent communication skills and experience collaborating with other engineers located in different sites/timezones. You have strong analytical and problem-solving skills and are willing to learn and ready to take on problems. \n KEY RESPONSIBILITIES:  \nCollaborate with architects, hardware engineers, and firmware engineers to understand the new features to be verified \nBuild test plan documentation, accounting for interactions with other features, the hardware, the firmware, and the software driver use cases \nEstimate the time required to write the new feature tests and any required changes to the test environment \nBuild the directed and random verification tests \nDebug test failures to determine the root cause; work with RTL and firmware engineers to resolve design defects and correct any test issues  \nReview functional and code coverage metrics – modify or add tests or constrain random tests to meet the coverage requirements \n PREFERRED EXPERIENCE:  \nProficient in IP level ASIC verification \nProficient in debugging firmware and RTL code using simulation tools  \nProficient in using UVM testbenches and working in Linux and Windows environments \nExperienced with Verilog, System Verilog, C, and C++   \nGraphics pipeline knowledge \nDeveloping UVM based verification frameworks and testbenches, processes and flows \nAutomating workflows in a distributed compute environment.   \nExposure to simulation profile, efficiency improvement, acceleration, HLS tools/process \nStrong background in the C++ language, preferably on Linux with exposure to Windows platform \nGood understanding and hands-on experience in the UVM concepts and SystemVerilog language \nGood working knowledge of SystemC and TLM with some related experience.   \nScripting language experience: Perl, Ruby, Makefile, shell preferred.   \nExposure to leadership or mentorship is an asset \nDesirable assets with prior exposure to video codec system or other multimedia solutions.   \n ACADEMIC CREDENTIALS:  \nBachelors or Masters degree in computer engineering/Electrical Engineering\n#LI-PK2  \n\n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/68986?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-11T00:25:35.905647"
=======
    "scraped_at": "2025-09-11T02:36:11.778163"
>>>>>>> Stashed changes
  },
  {
    "title": "Sr. Silicon Design Engineer",
    "location": "IN,Hyderabad\nBuilding 11, Survey No. 64 at Campus, Mindspace, Madhapur\nHyderabad, Telangana\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\n Sr. SILICON DESIGN ENGINEER  \nTHE ROLE: \nThe position will involve working with a very experienced physical design team of Server SOC and is responsible for delivering the physical design of tiles to meet challenging goals for frequency, power and other design requirements for AMD next generation processors in a fast-paced environment on cutting edge technology.\n THE PERSON:  \nEngineer with good attitude who seeks new challenges and has good analytical and and problem-solving skills. Candidate needs to have the ability and desire to learn quickly and should be a good team player who has excellent communication skills and experience collaborating with other engineers located in different sites/timezones.  \n KEY RESPONSIBILITIES:  \nImplementing RTL to GDS2 flow\nHandling Floor-plan, Physical Implementation of Power-plan, Synthesis, Placement, CTS, Timing Closure, Routing, Extraction, Physical Verification (DRC & LVS), Crosstalk Analysis, EM/IR\nHandling different PNR tools - Synopsys ICC2, ICC, Design Compiler, PrimeTime, StarRC, Mentor Graphics Calibre, Apache Redhawk\n PREFERRED EXPERIENCE:  \n5+ years of professional experience in physical design, preferably with high performance designs.\nExperience in automated synthesis and timing driven place and route of RTL blocks for high speed datapath and control logic applications.\nExperience in automated design flows for clock tree synthesis, clock and power gating techniques, scan stitching, design optimization for improved timing/power/area, and design cycle time reduction.\nExperience in floorplanning, establishing design methodology, IP integration, checks for logic equivalence, physical/timing/electrical quality, and final signoff for large IP delivery\nStrong experience with tools for logic synthesis, place and route, timing analysis, and design checks for physical and electrical quality, familiarity with tools for schematics, layout, and circuit/logic simulation\nVersatility with scripts to automate design flow.\nStrong communication skills, ability to multi-task across projects, and work with geographically spread out teams\nExperience in FinFET & Dual Patterning nodes such as 16/14/10/7/5nm\nExcellent physical design and timing background.\nGood understanding of computer organization/architecture is preferred.\nStrong analytical/problem solving skills and pronounced attention to details.\nACADEMIC CREDENTIALS:\nQualification: Bachelors or Masters in Electronics/Electrical Engineering\n  \n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/69336?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-11T00:25:38.728942"
=======
    "scraped_at": "2025-09-11T02:36:13.460167"
>>>>>>> Stashed changes
  },
  {
    "title": "DFT Engineer",
    "location": "IN,Hyderabad\nBuilding 11, Survey No. 64 at Campus, Mindspace, Madhapur\nHyderabad, Telangana\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\nSMTS SILICON DESIGN ENGINEER\n\nTHE ROLE: \nAs a member of the Server SoC Group, you will help bring to life cutting-edge designs. As a member of the front-end design/integration team, you will work closely with the architecture, IP design, Physical Design teams, and product engineers to achieve first pass silicon success.\n\nTHE PERSON:\nA successful candidate will work with senior silicon design engineers. The candidate will be highly accurate and detail-oriented, possessing good communication and problem-solving skills.\n\nKEY RESPONSIBLITIES:\nImplementation and verification of DFT architecture and features \nScan insertion and ATPG pattern generation \nATPG patterns verification with gate-level simulation \nTest coverage and test cost reduction analysis \nPost silicon support to ensure successful bring up and enhance yield learning\n\nPREFERRED EXPERIENCE:\nUnderstanding of Design for Test methodologies and DFT verification experience (eg. IEEE1500, JTAG 1149.x, Scan, memory BIST etc.) \nExperience with Mentor testkompress and/or Synopsys Tetramax/DFTMAX \nExperience with VCS simulation tool, Perl/Shell scripting, and Verilog RTL design \n ACADEMIC CREDENTIALS:\nBachelors or Masters degree in computer engineering/Electrical Engineering \n #LI-AA1\n\n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/66470?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-11T00:25:46.549087"
=======
    "scraped_at": "2025-09-11T02:36:15.173077"
>>>>>>> Stashed changes
  },
  {
    "title": "AI Software System Engineer",
    "location": "IN,Hyderabad\nBuilding 11, Survey No. 64 at Campus, Mindspace, Madhapur\nHyderabad, Telangana\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\nJob Title: AI Systems Engineer \nJob Overview: We are seeking an AI Systems Engineer to join our AMD IT compute platforms engineering team. The AI Systems Engineer is responsible for the design, development, and administration of High-Performance Computing (HPC) infrastructure, GPU clusters, and AI workload schedulers. \n ABOUT YOU: \nYou have a passion for learning. You are passionate about the field of large-scale distributed computing in AI and HPC workloads. You take responsibility for end-to-end outcomes of your efforts. You want to build scalable and highly performant HPC/AI/Data services with AMD hardware, software, people and processes. You have a curiosity to learn and improve scalable HPC systems. You have significant experience in working across a globally distributed organization. \nResponsibilities: \nDevelop, implement, and maintain GPU-based clusters, ensuring optimal performance  \nAdminister ML/AI platforms – Distributed ML services, LLMs and  AI inferencing, by managing deployments, resource allocation, monitoring, and security. \nAutomate system provisioning and Cluster management end to end \nCollaborate with cross-functional teams to address AI infrastructure requirements, support AI-related projects, and provide technical expertise. \nMonitor and evaluate the performance of AI systems and clusters, ensuring that they adhere to industry best practices and meet company standards. \nUse AI/ML to continuously improve internal processes and tools that are used in end-to-end delivery of your services in this team \nExperience and Qualifications: \n5+ years of experience in developing python based AI apps and UI \n5+ years of experience in HPC infrastructure engineering for AI/HPC domain \n5+ years of experience in SLURM and Kubernetes management \n2+ years of experience managing GPU clusters optimizing GPU-based services/tools/software \nExperience in creating web services with HPC backend (like AI) \nProficiency in RoCEv2, K8s, KVM, Ubuntu, Python, Shell, GPU drivers, and Cluster interconnect with 400G networking. \nDemonstrated experience with AI workload schedulers and allocation optimization. \nAutomation/monitoring tool - ansible / saltstack, terraform, Prometheus,  grafana \nStrong organizational, problem-solving, and troubleshooting skills, with the ability to manage multiple projects simultaneously. \nExcellent verbal and written communication skills, with the ability to collaborate effectively with team members and stakeholders at all levels of the organization. \nLocation: Hyderabad  \n #LI-SK4\n\n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/69060?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-11T00:25:52.713046"
=======
    "scraped_at": "2025-09-11T02:36:17.226799"
>>>>>>> Stashed changes
  },
  {
    "title": "MTS Silicon Design Engineer",
    "location": "IN,Hyderabad\nBuilding 11, Survey No. 64 at Campus, Mindspace, Madhapur\nHyderabad, Telangana\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\nSoC Verification ENGINEER  \n THE ROLE: \nThe focus of this role is to plan, build, and execute the verification of new and existing features for AMD’s graphics processor IP, resulting in no bugs in the final design.   \n THE PERSON:\nYou have a passion for modern, complex processor architecture, digital design, and verification in general. You are a team player who has excellent communication skills and experience collaborating with other engineers located in different sites/timezones. You have strong analytical and problem-solving skills and are willing to learn and ready to take on problems.\n KEY RESPONSIBILITIES:\n·       Collaborate with architects, hardware engineers, and firmware engineers to understand the new features to be verified\n·       Build test plan documentation, accounting for interactions with other features, the hardware, the firmware, and the software driver use cases\n·       Estimate the time required to write the new feature tests and any required changes to the test environment\n·       Build the directed and random verification tests\n·       Debug test failures to determine the root cause; work with RTL and firmware engineers to resolve design defects and correct any test issues\n·       Review functional and code coverage metrics – modify or add tests or constrain random tests to meet the coverage requirements\n PREFERRED EXPERIENCE:\n·       Proficient in IP/Sub-System/SOC level ASIC verification\n·       Proficient in debugging firmware and RTL code using simulation tools\n·       Proficient in using UVM testbenches and working in Linux and Windows environments\n·       Experienced with Verilog, System Verilog, C, and C++\n·       Processor Micro-Architecture concepts – Reset/Boot-flow/Cache Coherency/Interrupt flows knowledge\n·       Developing UVM based verification frameworks and testbenches, processes and flows\n·       Automating workflows in a distributed compute environment.\n·       Exposure to simulation profile, efficiency improvement, acceleration, HLS tools/process\n·       Strong background in the C++ language, preferably on Linux with exposure to Windows platform\n·       Good understanding and hands-on experience in the UVM concepts and SystemVerilog language\n·       Good working knowledge of SystemC and TLM with some related experience.\n·       Scripting language experience: Perl, Ruby, Makefile, shell preferred.\n·       Exposure to leadership or mentorship is an asset\n·       Desirable assets with prior exposure to video codec system or other multimedia solutions.\n ACADEMIC CREDENTIALS:  \nBachelors or Masters degree in computer engineering/Electrical Engineering \n#LI-SR5\n\n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/70081?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-11T00:25:55.386764"
=======
    "scraped_at": "2025-09-11T02:36:18.879183"
>>>>>>> Stashed changes
  },
  {
    "title": "Sr. Silicon Design Engineer",
    "location": "IN,Hyderabad\nBuilding 11, Survey No. 64 at Campus, Mindspace, Madhapur\nHyderabad, Telangana\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\nSENIOR SILICON DESIGN ENGINEER \n THE ROLE: \nWe are looking for an adaptive, self-motivative design verification engineer to join our growing team. As a key contributor, you will be part of a leading team to drive and improve AMD's abilities to deliver the highest quality, industry-leading technologies to market. The Verification Engineering team furthers and encourages continuous technical innovation to showcase successes as well as facilitate continuous career development. \n THE PERSON: \nYou have a passion for modern, complex processor architecture, digital design, and verification in general. You are a team player who has excellent communication skills and experience collaborating with other engineers located in different sites/timezones. You have strong analytical and problem-solving skills and are willing to learn and ready to take on problems. \n KEY RESPONSIBILITIES: \nDevelop/Maintain tests for functional verification and performance verification at the core level \nBuild testbench components to support the next generation IP \nMaintain or improve current test libraries to support IP level testing \nCreate hardware emulation build to verify the IP functional performance \nMaintain and improve current hardware emulation environment to speed up the runtime performance and improve the debug facility \nProvide technical support to other teams \n PREFERRED EXPERIENCE: \nGood at C/C++ \nFamiliarity with SystemVerilog and modern verification libraries like UVM \nExperience/Background on Computing/Graphics is a benefit \nExperience with OpenGL/OpenCL/D3D programming is a benefit \n ACADEMIC CREDENTIALS: \nBachelors or Masters degree in computer engineering/Electrical Engineering \n #LI-PK2\n\n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/69138?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-11T00:26:01.400403"
=======
    "scraped_at": "2025-09-11T02:36:20.479033"
>>>>>>> Stashed changes
  },
  {
    "title": "MTS Silicon Design Engineer",
    "location": "IN,Hyderabad\nBuilding 11, Survey No. 64 at Campus, Mindspace, Madhapur\nHyderabad, Telangana\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\nSoC Verification Engineer\n THE ROLE: \nThe focus of this role is to plan, build, and execute the verification of new and existing features for AMD’s graphics processor IP, resulting in no bugs in the final design.   \n THE PERSON:\nYou have a passion for modern, complex processor architecture, digital design, and verification in general. You are a team player who has excellent communication skills and experience collaborating with other engineers located in different sites/timezones. You have strong analytical and problem-solving skills and are willing to learn and ready to take on problems.\n KEY RESPONSIBILITIES:\n·       Collaborate with architects, hardware engineers, and firmware engineers to understand the new features to be verified\n·       Build test plan documentation, accounting for interactions with other features, the hardware, the firmware, and the software driver use cases\n·       Estimate the time required to write the new feature tests and any required changes to the test environment\n·       Build the directed and random verification tests\n·       Debug test failures to determine the root cause; work with RTL and firmware engineers to resolve design defects and correct any test issues\n·       Review functional and code coverage metrics – modify or add tests or constrain random tests to meet the coverage requirements\n PREFERRED EXPERIENCE:\n·       Proficient in IP/Sub-System/SOC level ASIC verification\n·       Proficient in debugging firmware and RTL code using simulation tools\n·       Proficient in using UVM testbenches and working in Linux and Windows environments\n·       Experienced with Verilog, System Verilog, C, and C++\n·       Processor Micro-Architecture concepts – Reset/Boot-flow/Cache Coherency/Interrupt flows knowledge\n·       Developing UVM based verification frameworks and testbenches, processes and flows\n·       Automating workflows in a distributed compute environment.\n·       Exposure to simulation profile, efficiency improvement, acceleration, HLS tools/process\n·       Strong background in the C++ language, preferably on Linux with exposure to Windows platform\n·       Good understanding and hands-on experience in the UVM concepts and SystemVerilog language\n·       Good working knowledge of SystemC and TLM with some related experience.\n·       Scripting language experience: Perl, Ruby, Makefile, shell preferred.\n·       Exposure to leadership or mentorship is an asset\n·       Desirable assets with prior exposure to video codec system or other multimedia solutions.\n ACADEMIC CREDENTIALS:  \nBachelors or Masters degree in computer engineering/Electrical Engineering #LI-SR5\n\n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/70083?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-11T00:26:04.664170"
=======
    "scraped_at": "2025-09-11T02:36:22.372244"
>>>>>>> Stashed changes
  },
  {
    "title": "Power Architecture - Team Lead (PTPX, Power Artist)",
    "location": "IN,Hyderabad\nBuilding 11, Survey No. 64 at Campus, Mindspace, Madhapur\nHyderabad, Telangana\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\nThe Role:\nWe are looking for a technical leader to join and lead the SOC Power Modeling team in the AMD Client Computing and Graphics group. This role involves collaboration with many engineering teams including SoC architecture definition, IP design, integration/physical design, verification, platform architecture, software, and firmware.  Contributions have a direct impact on the power & performance of AMD’s Client products.\n The Person:\nThe candidate should have strong SOC design process experience from front end to tapeout. The candidate will lead a team working closely with the SOC design teams on RTL and emulation-based power estimation, simulation and design flow extraction.  The candidate must be organized, self-motivated and able to work effectively on teams large and small across multiple sites. He or she must be able to prioritize assignments and drive them to completion. Strong verbal and written communication skills are essential for driving technical discussions to successful and actionable outcomes.\n Key Responsibilities:\nTeam leader for Hyderabad based power modeling group, work with management to define department objectives and growth plans. Make recommendations to improve processes or procedures as appropriate. Implement changes to engineering processes based on new technologies or industry standards. Work with department management on recruiting, hiring, training, and team evaluations.\nWork with frontend RTL, DFT, Synthesis, and Physical design teams in the development of power intent (UPF) design at SoC level.\nLead team with power estimates during the pre-silicon design process using Power Artist/PTPX emulation environments and ensure power objectives and goals are met.\nWork with RTL and physical design teams to scientifically assess and manage tradeoffs with impacts of power management options such as, but not limited to clock and power gating, device type mix and physical implementation options.\nTrack IP power development through the design cycle ensuring it meets power budgets - leakage/dynamic at every milestone.\nImprove power design flows in areas of power modeling, clock power analysis, structural power validation, IP power intent.\nWork with design verification in validating low power design features at SoC and IP level.\nPreferred Experience\nExtensive experience with Synopsys EDA tools, particularly PtPx/Power Artist.\nDetailed understanding of hardware emulation process, stimulus and EDA flow data extraction.\nAbility to define data reporting and requirements needs using EDA flows, Tcl and Python based scripting.\nAbility to work independently and lead a world-wide team.\nExcellent communication skills, written and verbal skills\nAcademic Credentials\nPhD or Master of Science degree in Electrical Engineering, Computer architecture, or Computer Science.\n10+ years of experience.\n #LI-RR1\n#LI-Hybrid\n\n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/65111?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-11T00:26:08.482750"
=======
    "scraped_at": "2025-09-11T02:36:24.330129"
>>>>>>> Stashed changes
  },
  {
    "title": "Soc Power Architecture - Power Artist/PTPX",
    "location": "IN,Hyderabad\nBuilding 11, Survey No. 64 at Campus, Mindspace, Madhapur\nHyderabad, Telangana\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\nThe Role:\nWe are looking for an experienced engineer to join the SOC Power Modeling team in the AMD Client Computing and Graphics group. This role involves collaboration with multiple engineering teams including SoC architecture definition, IP design, integration/physical design, verification, and platform architecture.  Contributions have a direct impact on the power & performance of AMD’s Client products.\n The Person:\nThe candidate should have SOC design process experience from front end to tapeout. The candidate will work closely with the SOC design teams on RTL and emulation-based power estimation, simulation and design data extraction.  The candidate must be organized, self-motivated and able to work effectively on teams large and small across multiple sites. He or she must be able to prioritize assignments and drive them to completion. Good verbal and written communication skills are helpful for technical discussions with team members across the globe.\n Key Responsibilities:\nWork with front end RTL, DFT, Synthesis, and Physical design teams in the development of power intent (UPF) design at SoC level.\nWork with emulation team on power estimates during the pre-silicon design process using Power Artist/PTPX emulation environments and ensure power objectives and goals are met.\nWork with RTL and physical design teams to generate data on design impact from clock and power gating, device type mix and physical implementation options.\nTrack IP power development through the design cycle ensuring it meets power budgets - leakage/dynamic at every milestone.\nWork with design verification in validating low power design features at SoC and IP level.\nPreferred Experience\nExperience with Synopsys EDA tools, particularly PtPx/Power Artist.\nUnderstanding of hardware emulation process, stimulus and EDA flows.\nExperience with Tcl and Python based scripting.\nExperience with UPF.\nAcademic Credentials\nMaster or Bachelor of Science degree in Electrical Engineering.\n3+ years of experience.\n #LI-RR1\n#LI-Hybrid\n\n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/66223?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-11T00:26:11.220706"
=======
    "scraped_at": "2025-09-11T02:36:26.022109"
>>>>>>> Stashed changes
  },
  {
    "title": "GFX- IP Verification Lead",
    "location": "IN,Hyderabad\nBuilding 11, Survey No. 64 at Campus, Mindspace, Madhapur\nHyderabad, Telangana\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\n THE ROLE:\n We are currently seeking a highly skilled verification engineer for GFX Verification team.\n Responsibilities:\nIn this role, he/she would be responsible for verification of GPU Verification by meeting the demands of the constantly evolving project schedule. The successful candidate will be a member of the GFX team. He/she will demonstrate passion towards design, design verification, be a teammate, a problem solver with independence, creativity, and interpersonal skills.\n Working with all partners such as lead architects and block design teams to understand features to be implemented and verified.\n Developing robust test plan for both synthetic testing and real workload trace\n Debug verification test failures, working with the design team to accurate defects.\n Make sure AMD next generation GFXIP can meet performance/power/function expectation.\nRequirements:\n Demonstrated expertise in UVM based verification environment and Formal Verification\nDevelopment of UVM based verification environment from scratch, including scoreboard, checkers etc,\nHandson work on subsystem level verification involving complex design and processors/ DSP\nGood hands-on work on AXI protocols verification\nHands-on experience in code coverage and functional coverage closure.\nGood in scripting languages\nGood understating of IO protocols like I2S, MIPI-soundwire, PDM,\nAcademic credentials:\nB.E/B.Tech or M.E/M.Tech degree in ECE/ Electrical Engineering / Computer Engineering with Digital Systems/VLSI as major with 8+ Years of Exp\nLocation: Bangalore, India\n #LI-NS1\n  \n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/65220?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-11T00:26:29.254343"
=======
    "scraped_at": "2025-09-11T02:36:27.681070"
>>>>>>> Stashed changes
  },
  {
    "title": "Software Validation Engineer (QA)",
    "location": "IN,Hyderabad\nBuilding 11, Survey No. 64 at Campus, Mindspace, Madhapur\nHyderabad, Telangana\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\nMTS SOFTWARE SYSTEM DESIGN ENGINEER \n THE ROLE: \nThe right engineer will drive the success of power IP (Intellectual Property) and features in AMD (Advanced Micro Devices) products through leadership & coordination, resolution of technical dependencies, and achievement of schedule commits. This is a high-visibility and widely multi-functional role, spanning pre-silicon architecture to post-silicon implementation & product delivery.   \n THE PERSON: \nYour curiosity will drive your learning and innovation to improve how we as a group, and an organization, can get better every day. Your peers will provide you a results-oriented and encouraging environment for your career growth, fueling your opportunity to be a part of Delighting Our Customers.   \n KEY RESPONSIBILITIES:   \nReceives assignments in the form of objectives with goals and the process by which to\nmeet those goals.\nProvides direction to employees according to established policies and management guidance.\nResponsible to drive AMD’s new GPU/System bring up, ROCm SW stack testing, quality and performance timeliness of result for a portion of project/process.\nManagement reviews work to measure meeting of objectives, process adherence and quality standards defined. \nParticipate in making more complex technical decisions for the product.\nImplement checks and balances independently to minimize the impact of mistakes.\nLead collaborative approaches with multiple teams.  \nCoach and Mentor staff to achieve their bussines goals and be a solution provider for their challenges.\nEstablishing and sharing best practices.\nLead by an example and promote the AMD Culture\n PREFERRED EXPERIENCE:   \nGood understanding of test lifecycle, QA process & terminology.\nStrong knowledge of Device drivers, graphics, multimedia, Codec.\nHandling of Test Execution infra in an automation lab with multiple systems.\nProven track record of every stages of QA and Defect life cycle.\nStrong understanding & Hands-on exp. with Linux OS internals, device manager.\nHands-on issue debugging skills, issue isolation with Linux kernel, driver module level.\nStrong understanding of PC hardware, SoC, Chipsets, Graphics cards, BIOS & VBIOS.\nUnderstanding machine learning, artificial intelligence, computer vision technologies is a plus.\nGood verbal & written communication skill is a must.\nGood attitude, result-driven & ability to make team deliver on next-gen technology.\nKnowledge of KVM/XEN/VMWARE is a plus\n10+ years of relevant work experience\n ACADEMIC CREDENTIALS: \nBachelor’s or Master's degree in Computer or Electrical Engineering or equivalent\n #LI-NR1\n\n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/70513?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-11T00:26:49.185071"
=======
    "scraped_at": "2025-09-11T02:36:29.367475"
>>>>>>> Stashed changes
  },
  {
    "title": "Product Application Engineer- Hardware (Board Design and Testing)",
    "location": "IN,Bangalore\n#102-103, Export Promotion Industrial Park\nBangalore, Karnataka\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\nTHE POSITION:\nHW Product Application Engineer will work closely with customers to enable them in  using AMD embedded CPUs by providing platform or HW related support. Those includes delivering necessary trainings, answering any inquires, creating collaterals, reviewing design files, and debugging issues, working with internal teams. \n THE PERSON:\nThe candidate must be highly motivated, innovative, and be able to work in a fast-paced environment. The candidate must be able to quickly analyze different customer scenarios to come up with the best approach to tackle tough problems. The successful candidate will have strong analytical skills and debug methodology, strong communication skills, be self-motivated, and have a desire to help customers solve problems.\n KEY RESPONSIBILITIES:\nDirectly work with customers to enable successful deployment of AMD Embedded CPUs platforms\nProvide customers technical training on AMD based platforms.\nPerform platform reviews (block-level, schematic, and layout review) of customer designs.\nEngage directly on key technical topics, issues, architecture discussions, and performance optimizations\nOwn and drive closure to issues reported by customer on HW and platform domain which includes\nAttend regular customer calls and answer HW, platform and silicon related questions.\nPerform first level triage and debug for customer reported issue.\nParticipate in joint debug at customer site as needed.\nDevelop and present customer communications for silicon and platform issues. Co-develop technical collateral, such as application note, user guide, sample, and reference design materials\nEngage directly on key technical topics, issues, architecture discussions, and performance optimizations with customers and internal teams\nCollaborate seamlessly across domains including platform and silicon engineering, product management, and field application engineering\nPREFERRED EXPERIENCE:\n9+ years / Proven track record of success working directly with customers to develop systems from concept to production.\nStrong knowledge in x86 processors, DDR5/6, CXL, PCIe, SATA, USB, multiprocessor systems, power management and system management.\nExperience in the following area is highly preferred.\nHands-on lab works\nHW related issue debug on embedded platform\nmotherboard design,schematics capture/review and layour review.\nHigh-speed IO board design and/or signal integrity validation.\nExperience in the following area is plus.\nPower delivery design.\nCPU performance turning\nTeam player with passion and a keen sense of urgency and strong drive\nTeam player with passion and a keen sense of urgency and strong drive\nACADEMIC CREDENTIALS:  \nBachelors or Masters degree in electrical or electronics engineering \n #LI-SK4\n \n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/67722?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-11T00:26:59.317488"
=======
    "scraped_at": "2025-09-11T02:36:34.211393"
>>>>>>> Stashed changes
  },
  {
    "title": "IP Verification Lead",
    "location": "IN,Bangalore\n#102-103, Export Promotion Industrial Park\nBangalore, Karnataka\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\nMTS SILICON DESIGN ENGINEER  \n THE ROLE: \nThe Infinity Fabric transport layer verification team is looking for an experienced pre-silicon verification engineer to help verify our configurable switches and die-to-die interconnect. Infinity Fabric is part of every new AMD product being developed across Client, Server, Graphics, and Semi-Custom markets. Our growing team needs additional senior engineering experience to help us enhance our configurable testbench and to mentor junior engineers.\n THE PERSON:  \nThe preferred candidate will have proven experience verifying complex design blocks at the IP, SubSystem or SoC level using System Verilog/UVM or related technologies. He or she should be comfortable creating and executing on test plans in collaboration with design and verification colleagues in a metric-focused environment.\n KEY RESPONSIBILITIES:  \nDevelop and enhance System Verilog / UVM-based testbenches to verify new features for client, server, graphics, and semi-custom interconnects\nInteract with architects, RTL designers, performance engineers, and post-silicon validation engineers to develop deep expertise in the Infinity Fabric architecture\nUnderstand TestBench Architecture and develop expertise in TestBench Verification Components\nMentor junior engineers\nPREFERRED EXPERIENCE:  \n8-12 years of industry experience\nProficient in SubSystem level ASIC verification \nArchitected and developed complex verification environments and infrastructure, including scripting using Perl, Ruby, Make, or similar\nExperience in UVM TestBench Development for complex designs preferred\nExposure to RTL design, software development, formal verification, or other related domains\nACADEMIC CREDENTIALS:  \nBachelor’s or master’s degree in Electronics or Electrical or Computer engineering \n#LI-BM2\n\n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/68658?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-11T00:27:13.254451"
=======
    "scraped_at": "2025-09-11T02:36:36.040281"
>>>>>>> Stashed changes
  },
  {
    "title": "Linux Scheduler and Power Management Engineer",
    "location": "IN,Bangalore\n#102-103, Export Promotion Industrial Park\nBangalore, Karnataka\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\n Linux Kernel Engineer\n THE ROLE:\nThe AMD Server Software and Solution engineering team is seeking a passionate Linux Kernel Engineer in our Linux Server Operating Systems team – bring a willingness to learn and absorb new concepts and technologies, along with a sound understanding of computer architecture and operating system concepts designed for the x86-64 architecture. Design and develop core CPU and SOC features for the Linux kernel and related open-source projects. This opportunity gets you involved in all phases of software development. Work with the upstream Linux Kernel community to get these features merged into the mainline Linux Kernel.\n THE PERSON:   \nAn aspiring Linux kernel developer with a strong grounding in operating systems concepts who will develop skills to deliver responsive and efficient solutions that bring new AMD processors to market. Utilize polished written and verbal communication to work with both local and global colleagues towards a common end goal.\n KEY RESPONSIBILITIES:   \nJoin Linux Scheduler and Power Management focused team to identify bottlenecks and optimizations/features to advantage EPYC CPUs.\nDrive features and functionality to our partner technical teams including the Linux kernel community.\nSupport the solutions offered by our partner companies. Review code, build unit tests, and write detailed documentation.\nCollaborate across the stack with hardware, firmware and power aware application stack teams.\nLead collaborative approaches with multiple teams.\n PREFERRED EXPERIENCE:   \n4 - 7yrs of Experience\nSolid understanding of operating systems, with emphasis on Linux or any other UNIX-like operating system.\nGood knowledge of the Linux community and Open-Source Software development workflow is a bonus.\nProficient in C programming for operating system kernel & systems development.\nUnderstanding of low-level software, such as BIOS/UEFI/firmware is a strong advantage.\nExposure to KVM/QEMU (including x86-64 virtualization extensions) is a plus.\nKnowledge and experience with the GNU toolchain and git are a bonus.\nDeep understanding of operating systems concepts, data structures, and at least one general-purpose processor architecture (knowledge of x86-64 architecture is a bonus).\nA keen eye to learn and absorb new concepts is desirable.\nExcellent Communication and Presentation skills.\nACADEMIC CREDENTIALS:   \nBachelors or master’s degree in electrical or computer engineering.    \nMaster’s degree preferred.  \n #LI-PS1\n\n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/65049?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-11T00:27:15.999986"
=======
    "scraped_at": "2025-09-11T02:36:37.731918"
>>>>>>> Stashed changes
  },
  {
    "title": "Software System Designer 2",
    "location": "IN,Bangalore\n#102-103, Export Promotion Industrial Park\nBangalore, Karnataka\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\nSOFTWARE SYSTEM DESIGNER 2 \n THE ROLE: \nThe Bengaluru team is responsible for the development, quality assurance, and delivery of kernels (KMDF) and user-level (UMDF) drivers for Windows, Linux drivers, and RAID UEFI for the AMD laptops, desktops, and workstations. As a software engineer on this team, you will work on hardware and software. We are a vertically integrated team spanning from firmware development right up to the application layer. As a part of this world-class team, you will get exposure to the fascinating world of Windows drivers. In this role, you will be actively participating in research, concept development, and design ideation to create world-class software and firmware.\n\nTHE PERSON:\nWe are looking for versatile and enthusiastic engineers who are willing to take on new challenges and find innovative ways to problem-solve. You will be working with a group of engineers to design, develop, and test Windows drivers for IO peripheral devices on the newest platforms that AMD produces. We are looking for someone with strong programming skills in C and C++ with exposure to X86 as well as source control (CVS/GIT/RMS) and/or Windows architecture. An ideal candidate should have hands-on experience working with Windows device driver development and debugging.\n KEY RESPONSIBILITIES:\nThe candidate’s primary responsibility is developing Windows drivers for AMD XGbE/Ethernet IP.\nThe candidate will have backup responsibilities of developing Linux drivers and application/tool development.\nSustain the design, development, integration, testing, and deployment of the AMD Windows solution.\nIncludes cross-cultural communication with vendor and customer.\n  PREFERRED EXPERIENCE: \nAdvanced programming skills in C/C++ for operating system kernel & systems development\nSolid understanding and hands-on experience with the Windows Network Miniport & Storage Driver architecture, KMDF/UMDF, WDF & WDM.\nStrong understanding of PCIe, Ethernet & storage protocols.\nStrong working knowledge of NDIS miniport driver.\nDeep knowledge of computer architecture and Windows kernel internals.\nGood understanding of operating systems concepts, data structures, and x86-64 architecture.\nProficient use of Github and AI Tools\nPython, Shell Scripting, BIOS knowledge are added advantage\nAbility to work with minimal supervision on more than one task in parallel\nAbility to mentor technically and must be self-starter\nGood communication and time management skills\nWorking with geographical teams an added advantage\n ACADEMIC CREDENTIALS: \nBachelor’s/Master’s in Engineering.\nPreferably relevant experience of 3 to 5 years.\n#LI-MK1\n\n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/66460?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-11T00:27:19.177956"
=======
    "scraped_at": "2025-09-11T02:36:39.590233"
>>>>>>> Stashed changes
  },
  {
    "title": "IP/Subsystems Design Verification Lead",
    "location": "IN,Bangalore\n#102-103, Export Promotion Industrial Park\nBangalore, Karnataka\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\nSMTS SILICON DESIGN VERIFICATION ENGINEER  \nTHE ROLE: \nAs a member of the Computing and Graphics group, you will help bring to life cutting-edge designs. As a member of the front-end design verification team, you will work closely with architecture, IP design and SOC verification engineers to achieve first pass silicon success.\n\nDesign Verification Engineer\n The Person:\nThe ideal candidate will have experience verifying RTL for IP or subsystems and understand architectural specifications. Responsibilities include IP and subsystem design verification and working collaboratively with the IP/SoC team.\n Key Responsibilities:\nVerification of IP and subsystems for AMD and other 3rd party IPs\nCreate test plans, develop testbenches, write constrained random test cases, perform code coverage analysis, create coverpooints and analyze functional coverage.\nWork collaboratively with other members of the IP team to support design implementation for IP delivery to SOC\nWork in partnership with SOC teams to support the IP at SOC level, including SOC verification, performance testing, software, firmware, and post-silicon bring-up\n Preferred Experience:\n8-12 years full-time experience in RTL design verification\nProficiency in system verilog and UVM for digital design verification\nCode coverage analysis and how to close line, expression and branch coverage\nExperience with assertion-based verification (ABV)\nDetailed knowledge of how to code coverpoints and closing functional coverage in a constrained random environment\nExperience with embedded processors and data fabric architectures\nOutstanding interaction skills while communicating both written and verbally\nAbility to work with multi-level functional teams across various geographies\nOutstanding problem-solving and analytical skills  \n ACADEMIC CREDENTIALS:  \nBachelors degree in Computer Engineering/Electrical Engineering plus 12 years full-time experience in IP hardware design, or Masters degree plus 8 years experience in same. \n  #LI-NS1\n\n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/68148?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-11T00:27:25.899565"
=======
    "scraped_at": "2025-09-11T02:36:41.307179"
>>>>>>> Stashed changes
  },
  {
    "title": "Design for Test (DFT) Architect",
    "location": "IN,Bangalore\n#102-103, Export Promotion Industrial Park\nBangalore, Karnataka\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\nPMTS SILICON DESIGN ENGINEER\n\nTHE ROLE:\nWe are seeking a highly experienced DFT (Design for Test) Principal MTS to join our CPU Cores team in Bangalore. The ideal candidate will have a strong technical background and extensive experience in DFT methodologies, particularly in the context of CPU core design and development.\n\nTHE PERSON:\nYou have excellent communication and presentation skills, demonstrated through technical publications, presentations, trainings, executive briefings, etc.  You are highly adept at collaboration among top-thinkers and engineers alike, ready to mentor and guide, and help to elevate the knowledge and skills of the team around you.\n KEY RESPONSIBILITIES:\nLead DFT Strategy and Implementation\nDevelop and execute comprehensive DFT strategies for CPU core projects, ensuring robust testability and manufacturability.\nDevelop and Optimize Test Architectures\nDesign and implement advanced test architectures, including scan insertion, BIST (Built-In Self-Test), LBIST (Logic Built-In Self-Test), and MBIST (Memory Built-In Self-Test), to enhance test coverage and efficiency.\nCollaborate with Cross-Functional Teams\nWork closely with design, verification, and physical design teams to integrate DFT requirements seamlessly into the overall design process.\nLead Cross-Site Collaboration\nCoordinate with teams across multiple locations to ensure cohesive and unified DFT strategies, promoting effective communication and collaboration.\nCreate and Validate Test Patterns\nGenerate and validate test patterns for both manufacturing and in-field testing, ensuring high-quality and reliable CPU cores.\nAnalyze and Debug Test Failures\nInvestigate and resolve test failures, providing innovative solutions to improve test coverage, yield, and overall product quality.\nConduct Post-Silicon Debugging\nPerform post-silicon debugging to identify and rectify issues in manufactured silicon, ensuring optimal performance and reliability of CPU cores.\nMentor Junior Engineers\nProvide guidance and mentorship to junior engineers, fostering their development in DFT techniques and best practices.\nStay Updated with Latest Technologies\nContinuously monitor advancements in DFT technologies and methodologies, integrating cutting-edge solutions into the team's workflow.\nInterface with External Vendors\nCollaborate with external vendors and partners to ensure the successful integration of DFT solutions into the manufacturing process.\nResearch and Contribute to Patents\nEngage in research activities, publish findings in reputable journals, and contribute to the development of patents in the field of CPU core design and DFT methodologies\n PREFERRED EXPERIENCE:\nExperience with industry-standard DFT tools and methodologies.\nKnowledge of semiconductor manufacturing processes.\nFamiliarity with scripting languages such as Python or Perl.\nExperience with low-power design techniques.\nOutstanding foundation in Systems & SoC architecture, with expertise in one or more of the following: CPU or GPU, Memory sub-system, Fabrics, CPU/GPU coherency, Multimedia, I/O subsystems, Clocks, Resets, Virtualization and Security\nExperience analyzing CPU, GPU or System-level Micro-Architectural features to identify performance bottlenecks within different workloads\nDemonstrated expertise in power management microarchitecture, low power design and power optimization, along with power impact at architecture, logic design, and circuit levels\nExcellent communication, management, and presentation skills.\nAdept at collaboration among top-thinkers and senior architects with strong interpersonal skills to work across teams in different geographies\n ACADEMIC CREDENTIALS:\nBachelor’s or master’s degree in electrical engineering, Computer Engineering, or a related one.\n15-18 years of experience in DFT, with a focus on CPU core design.\nProven track record of leading DFT projects from concept to production.\nDeep understanding of DFT techniques such as scan insertion, ATPG, BIST, LBIST, and MBIST.\nStrong problem-solving skills and ability to debug complex test issues.\nExcellent communication and leadership skills.\nAbility to work effectively in a collaborative team environment\n #LI-RR1\n#LI-HYBRID \n CTERR1\n\n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/64876?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-11T00:27:28.956327"
=======
    "scraped_at": "2025-09-11T02:36:43.269074"
>>>>>>> Stashed changes
  },
  {
    "title": "SMTS full chip physical integration and verification Engineer",
    "location": "IN,Bangalore\n#102-103, Export Promotion Industrial Park\nBangalore, Karnataka\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\nSMTS SILICON DESIGN ENGINEER\n\nTHE ROLE: \nAs a member of the AECG Custom ASIC Group, you will help bring to life cutting-edge designs. As a member of the physical integration and verification team , you will work closely with the physical design implementation, IP teams and fab contacts to achieve quality tapeout and first pass silicon success.\n\nTHE PERSON:\nA successful candidate will work on full chip SoC physical integration, verification and tapeout with physical design engineers. The candidate is expected to be detail-oriented, possessing good communication and problem-solving skills.\n\nKEY RESPONSIBLITIES:\nDrive Full chip physical integration and verification (DRC/LVS, ERC, DFM checks)\nWork with fab and fab contacts for all the tapeout activities leading to final tapeout.\nWork closely with physical design implementation and signoff team to achieve faster TAT\nWork closely with CAD team to come up with new flows and methodologies in the physical verification domain\n\nPREFERRED SKILLSET:\nExperience : More that 12 years of relevant experience.\nDriven multiple tapeouts across different technology nodes\nSound knowledge of full chip physical integration and verification flows\nHands on experience on industry standard tools such as Calibre and ICV\nSound understanding for DRC/LVS decks. Should be able to make updates as required.\nGood in scripting languages such as Tcl and Perl\nSelf driven, positive attitude and team worker\n ACADEMIC CREDENTIALS:\nBachelors or Masters degree in computer engineering/Electrical Engineering \n#LI-SR4\n\n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/66293?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-11T00:27:31.495750"
=======
    "scraped_at": "2025-09-11T02:36:46.543823"
>>>>>>> Stashed changes
  },
  {
    "title": "Design Verification Lead (SMTS Silicon Design Engineer)",
    "location": "IN,Bangalore\n#102-103, Export Promotion Industrial Park\nBangalore, Karnataka\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\nSMTS SILICON DESIGN ENGINEER\n\nTHE ROLE: \nThe candidate will get to work on the Verification of complex PLLs that are delivered to various AMD SoCs.\n\n\nTHE PERSON:\nYou have a passion for modern, complex processor architecture, digital design, and verification in general. You are a team player who has excellent communication skills and experience in collaborating with other engineers located in different sites/timezones. You have strong analytical and problem-solving skills and are willing to learn and ready to take on problems. \n\n\nKEY RESPONSIBLITIES:\n Verification of IP features : Test plan creation, Verification of the IP in RTL, Gatesim and Analog Mixed Signal simulations.  \nCreate methodology-based (UVM) verification testbenches and components from scratch for various IP features.\nQuality deliverables through regressions\nVerification coverage:  code-coverage, functional coverage, assertions, to achieve 100% verification completeness\nReviews, and feedback to design/architecture teams.\n\nPREFERRED EXPERIENCE:\nYears of experience 13+ Required. \nExpertise in System Verilog, methodology based testbench architectures such as UVM, and System Verilog assertions (SVA)\nExpertise in code and functional coverage.\nExcellent Problem solving and debugging skills.\nExcellent Communication skills.\nStrong digital design knowledge.\nExposure to UPF based low power RTL verification.\nPrior experience in leading a team is desirable.\nPrior experience in PLL verification and Mixed signal verification methodology is highly desirable.\nExposure to digital-analog co-simulations (cosims) is desirable.\n ACADEMIC CREDENTIALS:\nBachelors or Masters degree in computer engineering/Electrical Engineering \n #LI-PM2\n\n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/64440?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-11T00:27:36.697081"
=======
    "scraped_at": "2025-09-11T02:36:48.888707"
>>>>>>> Stashed changes
  },
  {
    "title": "Software Development Engineer 2",
    "location": "IN,Bangalore\n#102-103, Export Promotion Industrial Park\nBangalore, Karnataka\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\nSOFTWARE DEVELOPMENT ENGINEER 2 \n THE ROLE: \nWe are looking for a dynamic, upbeat software engineer to join our growing team. As a key contributor you will be part of a leading team to drive and enhance AMD’s abilities to deliver the highest quality, industry-leading technologies to market.   \n THE PERSON: \nThe ideal candidate possesses an innovative and problem-solving mindset, has a keen eye for Software engineering development, and is diligent and passionate about Technology.  \n We are seeking highly motivated Software Engineering intern/co-op to join our team.\nIn this role –\nWork closely and mentored by some of the industry's most talented Engineers who are building cutting edge products with multi generational impact\nWill be able to experience first hand software development life cycle, on how a concept is taken from architecture to design to implement and deploy\nWill be in the mid of a fast paced development environment in the space of AI Infrastructure and Security\nWill be able to contribute to the projects progress working on the development of tools, active triaging and debugging system level issues, and providing reports for comparitive analysis of the design approaches taken\nWill be technically challenged to provide the best solutions possible and be heard and part of open discussions with other team members\n WHO WE ARE LOOKING FOR:\nPassionate engineers who are currently enrolled in Undergrad and Graduate programs majoring in Computer Engineering, Electrical and Communications Engineering, Computer Science or related discipline.  \nIf you have knowledge/experience with any of the following technical skills ( or related areas) and enthusiastic about this role, we strongly encourage you to apply\nSoftware Engineering Concepts, Principles and Theories\nStrong analytical and logical thinking and keen to solve complex technical issues\nWorking experience with programming languages like C,C++,Python,Go\nOperating System Concepts with hands on experience on any RTOS will be a huge plus\nWorking knowledge of networking concepts and protocols like TCP/IP, UDP will be a good fit.\nKnowledge of Computer Architecture, Embedded Systems Design, Microcontroller architecture will be advantageous\nGood analytical and problem-solving skills\nExperience in using tools like git, GitHub, Jira, Confluence etc preferred\nWorking experience of static analysis tools, debugging tools like gdb, profilers etc will be a huge advantage  \nAbove all, looking for someone who is eager to learn and be part of a team , with focus on results\n ACADEMIC CREDENTIALS: \nBachelor’s or Master’s degree in Computer/Software Engineering, Computer Science, or related technical discipline \n\n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/65070?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-11T00:27:39.547188"
=======
    "scraped_at": "2025-09-11T02:36:50.845158"
>>>>>>> Stashed changes
  },
  {
    "title": "Sr. Software System Designer",
    "location": "IN,Bangalore\n#102-103, Export Promotion Industrial Park\nBangalore, Karnataka\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\nWindows driver development Engineer\n THE ROLE:   \nWe are seeking a passionate and skilled Software Engineer with 5–6 years of experience in Windows driver development and a strong grasp of Windows OS internals. You will be part of a high-impact team building advanced application profiling tools for Windows, leveraging modern C++ and low-level system expertise.\n   KEY RESPONSIBILITIES:   \nDesign, develop, and maintain Windows kernel-mode and user-mode drivers.\nWork on performance profiling and instrumentation tools for Windows applications.\nAnalyze and optimize system-level behavior using Windows internals knowledge.\nCollaborate with cross-functional teams to integrate profiling tools into broader software ecosystems.\nDebug complex issues across kernel and user space using tools like WinDbg, ETW, and PerfView.\nContribute to architectural decisions and code reviews with a focus on performance and reliability.\n PREFERRED EXPERIENCE:   \n5–6 years of hands-on experience in Windows driver development (WDM, KMDF, UMDF).\nStrong understanding of Windows OS internals (memory management, process/thread scheduling, I/O subsystem).\nProficiency in modern C++ (C++17 or later) with emphasis on performance and system-level programming.\nExperience with debugging tools (WinDbg, Visual Studio Debugger) and performance analysis tools (ETW, WPA).\nFamiliarity with Windows APIs, registry, and system services.\nSolid grasp of multithreading, synchronization, and low-level system programming concepts. \n ACADEMIC CREDENTIALS:   \nBachelors or master’s degree in electrical or computer engineering.    \nMaster’s degree preferred.  \n#LI-MK1\n\n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/68170?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-11T00:27:42.233962"
=======
    "scraped_at": "2025-09-11T02:36:52.727262"
>>>>>>> Stashed changes
  },
  {
    "title": "RTL Design Integration Manager - FEINT",
    "location": "IN,Bangalore\n#102-103, Export Promotion Industrial Park\nBangalore, Karnataka\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\nFront-End Silicon Design & Integration (FEINT) Manager\nThe role:\nA Front-End Silicon Design and Integration (FEINT) Manager role in our Security IP (SECIP) development team, where a large number of embedded micro-processor subsystems, hardware accelerators and other IPs vital to improve system performance and functionality are designed and verified. These IPs provide high performance functions to System on Chip (SoC) products across all AMD business units such as client computers, servers, discrete graphics, and gaming. As a hands-on FEINT manager, you will lead a number of FEINT engineers, work on performing RTL synthesis and PPA (performance, power, area) analysis in order to improve the QoR (quality of result) of RTL designs, creating, adopting and automating RTL static design rule checks, conducting ECO and LEC validations, as well as supporting SOC integration of the IPs.\nThe person:\nAn experienced FEINT engineering leader with strong records of technical leadership and hands-on execution to drive RTL synthesis, PPA analysis, ECO, and static verification tasks to timely completion. A technical mentor and forward-thinking leader who demonstrated strong capability in establishing advanced FEINT methodology and workflow, anticipating/analyzing/resolving technical and planning issues, and enjoyed interacting with team members. A strong written and verbal communicator with strong problem solving and attention to detail skills along with professional interpersonal communication capability.\nKey responsibilities:\nDevelop, adopt strategy, concept and scripting solutions for RTL synthesis, timing path analysis and PPA analysis at the subsystem level as well as at the block level RTL designs to drive for continued improvement of QoR\nDevelop, adopt ECO strategy, concept and scripting solutions for netlist and/or conformal assisted RTL ECO and LEC validations\nDevelop, adopt strategy, concept and scripting solutions for RTL static design rule checks in collaboration with RTL design team and the corporate methodology team\nManage FEINT regression process, create and improve FEINT workflow, processes, and quality metrics, to drive continuous improvement and positive changes\nManage IP integration support with SoC team, coordinate resolution of IP integration issues with SoC teams\nCollaborate with project management and other team leads on FEINT deliverables to the project milestones and on quality metrics\nPreferred experience:\nA minimum of equivalent 10 years relevant experience in FEINT engineering.\nProven understanding of RTL design, synthesis, and ECO principles\nExcellent knowledge with FE design tools such as Design/Fusion Compiler, Prime Time, Power Artist, Conformal, Formality, etc.\nFamiliar with VCS/Verdi and SPG based (dynamic/static) verification environments\nProficient with Verilog, C/C++ and other scripting languages (e.g. Tcl, Ruby, Perl, Python and Makefile)\nExcellent skills with Unix/Linux environment\nFamiliar with RTL coding techniques for improved PPA-measured QoR\nFamiliar with RTL coding style for cleanness on design rule checks (LINT, CDC, RDC, etc.)\nGood understanding of gate level circuit design and physical level design concept and methodology\nExcellent communication skills (both written and oral)\nStrong ability to provide mentorship and guidance to junior and senior engineers, a very effective team player, a positive influencer on team morale and culture\nPrior technical management experience is a plus asset\nAcademic credentials:\nMajor in Electrical Engineering, Computer Engineering, or Computer Science, or possibly a related field\nMaster's Degree preferred\nLocation: Bangalore India\n\n#LI-RR1\n#LI-Linkedin\n\n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/67186?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-11T00:28:24.213118"
=======
    "scraped_at": "2025-09-11T02:36:54.461490"
>>>>>>> Stashed changes
  },
  {
    "title": "Lead Design Verification engineer (IP)",
    "location": "IN,Bangalore\n#102-103, Export Promotion Industrial Park\nBangalore, Karnataka\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\nLead Verification Engineer\n THE ROLE: \nThe focus of this role is to plan, build, and execute the verification plan for AMD's FPGA IPs, resulting in no bugs in the final design.\n THE PERSON:  \nYou have a passion for modern, complex processor architecture, digital design, and verification in general. You are a team player who has excellent communication skills and experience collaborating with other engineers located in different sites/timezones. You have strong analytical and problem-solving skills and are willing to learn and ready to take on problems. \n KEY RESPONSIBILITIES:  \nCollaborate with architects, hardware engineers, and firmware engineers to understand the new features to be verified \nBuild test plan documentation, accounting for interactions with other features, the hardware, the firmware, and the software driver use cases \nEstimate the time required to write the new feature tests and any required changes to the test environment \nBuild the directed and random verification tests \nDebug test failures to determine the root cause; work with RTL and firmware engineers to resolve design defects and correct any test issues  \nReview functional and code coverage metrics – modify or add tests or constrain random tests to meet the coverage requirements \n PREFERRED EXPERIENCE:  \nProficient in IP level ASIC verification.\nKnowledge of PCIe, CXL or other IO protocol is preferred\nExperience with DMA verification is preferred\nProficient in using UVM testbenches and working in Linux and Windows environments \nExperienced with Verilog, System Verilog, C, and C++   \nDeveloping UVM based verification frameworks and testbenches, processes and flows \nAutomating workflows in a distributed compute environment.   \nExposure to simulation profile, efficiency improvement, acceleration, HLS tools/process \nGood understanding and hands-on experience in the UVM concepts and SystemVerilog language   \nScripting language experience: Perl, Ruby, Makefile, shell preferred.   \nExposure to leadership or mentorship is an asset \nDesirable assets with prior exposure to video codec system or other multimedia solutions.   \n ACADEMIC CREDENTIALS:  \nBachelors or Masters degree in computer engineering/Electrical Engineering \n #LI-RG2\n\n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/65349?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-11T00:28:27.423560"
=======
    "scraped_at": "2025-09-11T02:36:56.341579"
>>>>>>> Stashed changes
  },
  {
    "title": "AI NIC Sr.Datapath Dev. Engineer",
    "location": "IN,Bangalore\n#102-103, Export Promotion Industrial Park\nBangalore, Karnataka\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\nMTS SOFTWARE DEVELOPMENT ENGINEER \n THE ROLE: \nAMD is looking for a specialized software engineer who is passionate about improving the performance of key applications and benchmarks. You will be a member of a core team of incredibly talented industry specialists and will work with the very latest hardware and software technology.  \n THE PERSON: \nThe ideal candidate should be passionate about software engineering and possess leadership skills to drive sophisticated issues to resolution. Able to communicate effectively and work optimally with different teams across AMD.  \n KEY RESPONSIBILITIES: \nWork with AMD’s architecture specialists to improve future products  \nWork on datapath components of programmable ASIC based products ( DPU, AI-NICs)\nDesign, Develop and Own critical components of next generation product software stack \nStay informed of software and hardware trends and innovations, especially pertaining to algorithms and architecture \nDesign and develop new groundbreaking AMD technologies \nParticipating in new ASIC and hardware bring ups  \nDebugging/fix existing issues and research alternative, more efficient ways to accomplish the same work \nDebug at system level with keen understanding of concepts and penchant to solve technical challenges. \nBe prepared to develop, own tools, unit tests (including frameworks) to automate the features they work on \n PREFERRED EXPERIENCE: \nAbility to write high quality code with a keen attention to detail \nStrong proficiency in C and C++ programming languages with experience in developing high-performance software.\nWorking knowledge of python,go is a plus.\nSolid understanding of computer architecture, data structures, and algorithms.\nExperience with system-level debugging tools and techniques (e.g., gdb, memory analyzers, logic analyzers).\nKnowledge of parallel programming and multithreading concepts is a plus.\nFamiliarity with hardware design (FPGA, ASIC) and related tools is advantageous.\nProven problem-solving skills and the ability to work effectively in a collaborative team environment.\nAttention to detail and a commitment to delivering high-quality, reliable solutions.\n  ACADEMIC CREDENTIALS: \nBachelor’s or Master's degree in Computer Science, Computer Engineering, Electrical Engineering, or equivalent \n #LI-PM2\n\n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/67015?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-11T00:28:32.254953"
=======
    "scraped_at": "2025-09-11T02:36:58.150400"
>>>>>>> Stashed changes
  },
  {
    "title": "System Test & Automation Engineer",
    "location": "IN,Bangalore\n#102-103, Export Promotion Industrial Park\nBangalore, Karnataka\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\nSystem Test & Automation Engineer \n THE ROLE:\nAMD is looking for an influential software engineer who is passionate about improving the performance of key applications and benchmarks. You will be a member of a core team of incredibly talented industry specialists and will work with the very latest hardware and software technology. You will be building the product quality verification portfolio for the industry leading Network Infrastructure accelerators.\n THE PERSON:\nThe ideal candidate should be passionate about software engineering and possess leadership skills to drive sophisticated issues to resolution. Able to communicate effectively and work optimally with different teams across AMD.  \n KEY RESPONSIBILITIES:\nActive contribution to the day-to-day activities of the System Test in an Agile environment\nWrite Test plans and review it with all stakeholders to cover the scenarios comprehensively and execute efficiently.\nBuild maintainable, high quality and effective automated test scripts\nReview and triage test failures and verify fixes\nHelp customer reported issues by reproducing the issue locally, work with peer teams for faster resolution\nStay informed of software and hardware trends and innovations, especially pertaining to networking and accelerators\nDebugging complex technical issues and collaborate with peer teams\nDevelop technical relationships with peers and partners \n PREFERRED EXPERIENCE:\n5+ years of experience in Networking Testing and Automation roles.\nProficiency in writing Automation Scripts using Python\nExperience in various test tools, performance testing tools such as Ixia, etc.,\nExpert in networking technology in Routing and Switching, Microsegmentation, VXLAN, etc.,\nPrior experience in Cloud, Security, Data Center technologies is an added advantage\nStrong troubleshooting skills\nKnowledge of operating systems, kernel mode programming, device drivers, and related technologies and architectures\nGood interpersonal skills and effective communication\nAbility to write high quality automation code with a keen attention to detail\nExperience in administration of Linux operating system, VMware ESX, Windows Server\nExperience with software development processes and tools such as debuggers, source code control systems (GitHub) and profilers is a plus\nEffective communication and problem-solving skills\n ACADEMIC CREDENTIALS:\nBachelor’s or Master's degree in Computer Science, Computer Engineering, Electrical Engineering, or equivalent\n #LI-SK3 \n\n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/67046?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-11T00:28:41.377082"
=======
    "scraped_at": "2025-09-11T02:37:00.907761"
>>>>>>> Stashed changes
  },
  {
    "title": "Sr. Physical Design Engineer",
    "location": "IN,Bangalore\n#102-103, Export Promotion Industrial Park\nBangalore, Karnataka\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\nSENIOR SILICON DESIGN ENGINEER \n THE ROLE: \nThe position will involve working with a very experienced physical design team and is responsible for delivering the physical design of blocks/tiles to meet challenging goals for frequency, power and other design requirements for AMD next generation chips in a fast-paced environment on cutting edge technology.\n THE PERSON: \nEngineer with good attitude who seeks new challenges and has good analytical and communication skills. Candidate needs to have the ability and desire to learn quickly and should be a good team player.\n KEY RESPONSIBILITIES: \nImplementing RTL to GDS2 flow\nHandling Floor-plan, Physical Implementation of Power-plan, Synthesis, Placement, CTS, Timing Closure, Routing, Extraction, Physical Verification (DRC & LVS), Crosstalk Analysis, EM/IR, Formal Equivalence\nHandling different PNR tools - Synopsys Fusion Compiler, ICC2, Design Compiler, PrimeTime, StarRC, Mentor Graphics Calibre, Apache Redhawk, Cadence Genus, Innovus\nProvide technical support to other teams \n PREFERRED EXPERIENCE: \n5-7 years of professional experience in physical design, preferably ASIC designs.\nExperience in automated synthesis and timing driven place and route of RTL blocks for high speed datapath and control logic applications.\nExperience in automated design flows for clock tree synthesis, clock and power gating techniques, scan stitching, design optimization for improved timing/power/area, and design cycle time reduction.\nExperience in floorplanning, establishing design methodology, IP integration, checks for logic equivalence, physical/timing/electrical quality, and final signoff for large IP delivery\nStrong experience with tools for logic synthesis, place and route, timing analysis, and design checks for physical and electrical quality, familiarity with tools for schematics, layout, and circuit/logic simulation\nVersatility with scripts to automate design flow.\nStrong communication skills, ability to multi-task across projects, and work with geographically spread out teams\nStrong analytical/problem solving skills and pronounced attention to details\n ACADEMIC CREDENTIALS: \nBachelors or Masters degree in computer engineering/Electrical Engineering \n#LI-SR4\n\n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/66567?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-11T00:28:45.245269"
=======
    "scraped_at": "2025-09-11T02:37:02.698514"
>>>>>>> Stashed changes
  },
  {
    "title": "Sr. Silicon Design Engineer",
    "location": "IN,Bangalore\n#102-103, Export Promotion Industrial Park\nBangalore, Karnataka\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\nSENIOR SILICON DESIGN ENGINEER (AECG ASIC PD ENGINEER)\n THE ROLE: \nThe position will involve working with a very experienced physical design team and is responsible for delivering the physical design of blocks/tiles to meet challenging goals for frequency, power and other design requirements for AMD next generation chips in a fast-paced environment on cutting edge technology.\n THE PERSON: \nEngineer with good attitude who seeks new challenges and has good analytical and communication skills. Candidate needs to have the ability and desire to learn quickly and should be a good team player.\n KEY RESPONSIBILITIES: \nImplementing RTL to GDS2 flow\nHandling Floor-plan, Physical Implementation of Power-plan, Synthesis, Placement, CTS, Timing Closure, Routing, Extraction, Physical Verification (DRC & LVS), Crosstalk Analysis, EM/IR, Formal Equivalence\nHandling different PNR tools - Synopsys Fusion Compiler, ICC2, Design Compiler, PrimeTime, StarRC, Mentor Graphics Calibre, Apache Redhawk, Cadence Genus, Innovus\nProvide technical support to other teams \n PREFERRED EXPERIENCE: \n5-7 years of professional experience in physical design, preferably ASIC designs.\nExperience in automated synthesis and timing driven place and route of RTL blocks for high speed datapath and control logic applications.\nExperience in automated design flows for clock tree synthesis, clock and power gating techniques, scan stitching, design optimization for improved timing/power/area, and design cycle time reduction.\nExperience in floorplanning, establishing design methodology, IP integration, checks for logic equivalence, physical/timing/electrical quality, and final signoff for large IP delivery\nStrong experience with tools for logic synthesis, place and route, timing analysis, and design checks for physical and electrical quality, familiarity with tools for schematics, layout, and circuit/logic simulation\nVersatility with scripts to automate design flow.\nStrong communication skills, ability to multi-task across projects, and work with geographically spread out teams\nStrong analytical/problem solving skills and pronounced attention to details\n ACADEMIC CREDENTIALS: \nBachelors or Masters degree in computer engineering/Electrical Engineering \n #LI-BM4\n\n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/66859?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-11T00:28:51.989673"
=======
    "scraped_at": "2025-09-11T02:37:07.503714"
>>>>>>> Stashed changes
  },
  {
    "title": "MTS Silicon Design Engineer",
    "location": "IN,Bangalore\n#102-103, Export Promotion Industrial Park\nBangalore, Karnataka\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\nMTS SILICON DESIGN ENGINEER  \n THE ROLE: \nWe are looking for an adaptive, self-motivative design engineer to join our growing team. As a key contributor, you will be part of a leading team to drive and improve AMD's abilities to deliver the highest quality, industry-leading technologies to market. The Physical Design Engineering team furthers and encourages continuous technical innovation to showcase successes as well as facilitate continuous career development. \n THE PERSON:  \nEngineer with good attitude who seeks new challenges and has good analytical and communication skills. Candidate needs to have the ability and desire to learn quickly and should be a good team player.\n KEY RESPONSIBILITIES:  \nImplementing RTL to GDS2 flow\nHandling Floor-plan, Physical Implementation of Power-plan, Synthesis, Placement, CTS, Timing Closure, Routing, Extraction, Physical Verification (DRC & LVS), Crosstalk Analysis, EM/IR, Formal Equivalence\nHandling different PNR tools - Synopsys Fusion Compiler, ICC2, Design Compiler, PrimeTime, StarRC, Mentor Graphics Calibre, Apache Redhawk, Cadence Genus, Innovus\nProvide technical support to other teams \n PREFERRED EXPERIENCE:  \n8-12 years of professional experience in physical design, preferably ASIC designs.\nExperience in automated synthesis and timing driven place and route of RTL blocks for high speed datapath and control logic applications.\nExperience in automated design flows for clock tree synthesis, clock and power gating techniques, scan stitching, design optimization for improved timing/power/area, and design cycle time reduction.\nExperience in floor planning, establishing design methodology, IP integration, checks for logic equivalence, physical/timing/electrical quality, and final signoff for large IP delivery\nStrong experience with tools for logic synthesis, place and route, timing analysis, and design checks for physical and electrical quality, familiarity with tools for schematics, layout, and circuit/logic simulation\nVersatility with scripts to automate design flow.\nStrong communication skills, ability to multi-task across projects, and work with geographically spread out teams\nStrong analytical/problem solving skills and pronounced attention to details\n ACADEMIC CREDENTIALS:  \nBachelors or Masters degree in computer engineering/Electrical Engineering \n #LI-SR4\n\n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/66568?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-11T00:28:57.951472"
=======
    "scraped_at": "2025-09-11T02:37:09.205526"
>>>>>>> Stashed changes
  },
  {
    "title": "IP Verification Lead",
    "location": "IN,Bangalore\n#102-103, Export Promotion Industrial Park\nBangalore, Karnataka\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\nMTS SILICON DESIGN ENGINEER  \n THE ROLE: \nThe Infinity Fabric transport layer verification team is looking for an experienced pre-silicon verification engineer to help verify our configurable switches and die-to-die interconnect. Infinity Fabric is part of every new AMD product being developed across Client, Server, Graphics, and Semi-Custom markets. Our growing team needs additional senior engineering experience to help us enhance our configurable testbench and to mentor junior engineers.\n THE PERSON:  \nThe preferred candidate will have proven experience verifying complex design blocks at the IP, SubSystem or SoC level using System Verilog/UVM or related technologies. He or she should be comfortable creating and executing on test plans in collaboration with design and verification colleagues in a metric-focused environment.\n KEY RESPONSIBILITIES:  \nDevelop and enhance System Verilog / UVM-based testbenches to verify new features for client, server, graphics, and semi-custom interconnects\nInteract with architects, RTL designers, performance engineers, and post-silicon validation engineers to develop deep expertise in the Infinity Fabric architecture\nUnderstand TestBench Architecture and develop expertise in TestBench Verification Components\nMentor junior engineers\nPREFERRED EXPERIENCE:  \n8-12 years of industry experience\nProficient in SubSystem level ASIC verification \nArchitected and developed complex verification environments and infrastructure, including scripting using Perl, Ruby, Make, or similar\nExperience in UVM TestBench Development for complex designs preferred\nExposure to RTL design, software development, formal verification, or other related domains\nACADEMIC CREDENTIALS:  \nBachelor’s or master’s degree in Electronics or Electrical or Computer engineering \n\n#LI-BM2\n\n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/68659?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-11T00:29:03.999972"
=======
    "scraped_at": "2025-09-11T02:37:10.882623"
>>>>>>> Stashed changes
  },
  {
    "title": "MTS Silicon Design Engineer",
    "location": "IN,Bangalore\n#102-103, Export Promotion Industrial Park\nBangalore, Karnataka\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\nMTS SILICON DESIGN ENGINEER  \n THE ROLE: \nThe focus of this role is to plan, build, and execute the verification of new and existing features for AMD’s graphics processor IP, resulting in no bugs in the final design.   \n THE PERSON:  \nYou have a passion for modern, complex processor architecture, digital design, Processor based verification and verification in general. You are a team player who has excellent communication skills and experience collaborating with other engineers located in different sites/timezones. You have strong analytical and problem-solving skills and are willing to learn and ready to take on problems. \n KEY RESPONSIBILITIES:  \nCollaborate with architects, hardware engineers, and firmware engineers to understand the new features to be verified \nBuild test plan documentation, accounting for interactions with other features, the hardware, the firmware, and the software driver use cases \nEstimate the time required to write the new feature tests and any required changes to the test environment \nBuild the directed and random verification tests \nDebug test failures to determine the root cause; work with RTL and firmware engineers to resolve design defects and correct any test issues  \nReview functional and code coverage metrics – modify or add tests or constrain random tests to meet the coverage requirements \n PREFERRED EXPERIENCE:  \nProficient in IP level ASIC verification \nProficient in debugging firmware and RTL code using simulation tools  \nProficient in using UVM testbenches and working in Linux and Windows environments \nExperienced with Verilog, System Verilog, C, and C++   \nGraphics pipeline knowledge \nDeveloping UVM based verification frameworks and testbenches, processes and flows \nAutomating workflows in a distributed compute environment.   \nExposure to simulation profile, efficiency improvement, acceleration, HLS tools/process \nStrong background in the C++ language, preferably on Linux with exposure to Windows platform \nGood understanding and hands-on experience in the UVM concepts and SystemVerilog language \nGood working knowledge of SystemC and TLM with some related experience.   \nScripting language experience: Perl, Ruby, Makefile, shell preferred.   \nExposure to leadership or mentorship is an asset \nDesirable assets with prior exposure to video codec system or other multimedia solutions.   \n ACADEMIC CREDENTIALS:  \nBachelors or Masters degree in computer engineering/Electrical Engineering \nExperience : 11-15 years of relevant experience\n #LI-SG\n\n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/57647?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-11T00:29:16.903388"
=======
    "scraped_at": "2025-09-11T02:37:12.764531"
>>>>>>> Stashed changes
  },
  {
    "title": "Sr. AI System Infrastructure Engineer",
    "location": "IN,Bangalore\n#102-103, Export Promotion Industrial Park\nBangalore, Karnataka\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\nMTS SOFTWARE DEVELOPMENT ENGINEER \n THE ROLE: \nAMD is looking for a specialized software engineer who is passionate about improving the performance of key applications and benchmarks. You will be a member of a core team of incredibly talented industry specialists and will work with the very latest hardware and software technology.  \n THE PERSON: \nThe ideal candidate should be passionate about software engineering and possess leadership skills to drive sophisticated issues to resolution. Able to communicate effectively and work optimally with different teams across AMD.  \n KEY RESPONSIBILITIES: \nDesign, develop, and optimize algorithms for collective communication operations (e.g., All-Reduce, All-to-All, Broadcast) within AMD's RCCL.\nAnalyze and tune the performance of collective communication libraries on large-scale GPU clusters, focusing on latency, bandwidth, and scalability over high-speed network fabrics.\nIntegrate and validate RCCL with various network transport layers and protocols, such as UEC, RoCE (RDMA over Converged Ethernet), and custom interconnects.\nCollaborate closely with hardware, driver, and machine learning framework teams to co-design and debug system-level performance issues.\nDevelop robust benchmarking and profiling tools to identify and resolve bottlenecks in the communication software stack.\nContribute to the upstream open-source RCCL project and stay current with the latest advancements in the field.\nProvide expert guidance on GPU cluster network topology and configuration to maximize collective communication performance.\n PREFERRED EXPERIENCE: \n10+ years of experience in software development with a strong focus on high-performance computing or distributed systems.\nHighly proficient in C/C++ programming and debugging in a Linux environment.\nExperience with performance analysis, profiling, and debugging of complex, distributed systems in a Linux environment.\nProven track record of optimizing software for specific hardware architectures.\nStrong analytical and problem-solving skills, with a proven ability to diagnose and resolve complex performance issues.\nHands-on experience with AMD ROCm RCCL or similar GPU collective communication libraries (NVIDIA NCCL, MSICCL, oneCCL, Open MPI, MPICH, or other MPI implementations etc.), RoCEv2/RDMA is a huge plus.\nEffective communication and problem-solving skills.\n ACADEMIC CREDENTIALS: \nBachelor’s or Master's degree in Computer Science, Computer Engineering, Electrical Engineering, or equivalent \n #LI-PM2\n\n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/67029?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-11T00:29:22.595717"
=======
    "scraped_at": "2025-09-11T02:37:14.679061"
>>>>>>> Stashed changes
  },
  {
    "title": "Lead Software System Design Engineer",
    "location": "IN,Bangalore\n#102-103, Export Promotion Industrial Park\nBangalore, Karnataka\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\nSMTS SOFTWARE SYSTEMS DESIGN ENGINEER \n THE ROLE: \nWe are seeking an engineer to join our team that will thrive in a fast-paced work environment, using effective communication, problem-solving and prioritization skills. Individuals that are well organized, show great attention to detail, and employ critical thinking are well-suited for our team.   \n THE PERSON: \nThis AMD (Advanced Micro Devices) team is looking for a senior level person that can help guide the team, mentor upcoming developers, provide long range strategy, and is willing to jump in to help resolve issues quickly.  You will be involved in all areas that impact the team including performance, automation, and development.  The right candidate will be informed on the latest trends and become prepared to give consultative direction to senior management.  \n KEY RESPONSIBILITIES: \nA powerful desire to learn new skills and understand new features as they are added \nProven record of accomplishment of working within and across groups. \nEffective communication skills \nResponsible for exploring opportunities to improve product \nWork closely with other team members to understand design architecture and to propose solutions to improve and enhance products \nPREFERRED EXPERIENCE: \nProficiency in C, C++ and Python\nKnowledge of Object Oriented programming principles and practices\nUnderstanding of Software design and development methodologies\nStrong problem-solving skills and analytical skills\nExperience developing applications in Linux and Windows\nExposure to low-level hardware interactions\nExperience running, analyzing, and system benchmarks\nFamiliarity with unit testing frameworks\nBasic understanding of database systems and related concepts.\nFamiliarity with JTAG debugging will be nice to have skill\nFamiliarity with Scripting will be nice to have \n ACADEMIC CREDENTIALS: \nBachelor’s or Master’s in Electrical Engineer, Computer Engineering, Computer Science, or a closely related field with \nRelevant work experience of about 12 - 18 years in product development \n  #LI-SG\n\n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/69344?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-11T00:29:27.219943"
=======
    "scraped_at": "2025-09-11T02:37:16.350312"
>>>>>>> Stashed changes
  },
  {
    "title": "Technical Program Manager - Physical Design",
    "location": "IN,Bangalore\n#102-103, Export Promotion Industrial Park\nBangalore, Karnataka\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\nPROGRAM MANAGER 2 \n THE ROLE: \nWe are in search of an experienced program manager with strong analytical, problem-solving and risk management skills. You will be the program manager for India CPU team programs from concept to execution. You will work across all of engineering and business to meet overall product objectives. The right candidate will have solid knowledge of technical program management, an outstanding track record of delivering sophisticated SOC/complex IPs programs\n THE PERSON: \nAs a Program Manager you will partner with our cross functional teams to manage customer accounts and their portfolio, understand our customers platforms/solutions. Identify and document customer requirements and establish engineering schedules. Drive AMD product solution deliverables and alignment with customers’ platforms to ensure highest level customer satisfaction throughout their product lifecycle.  \n KEY RESPONSIBILITIES: \nDefines, plans and drives projects and program plans based on management and senior technical guidance \nPossesses a thorough knowledge of the principles of project management and can apply them effectively on small to large size projects \nHas responsibility for projects or processes of significant technical importance and for results that cross engineering project areas \nInitiates significant changes to existing processes and methods to improve project and team efficiency \nCreates and maintains project management artifacts such as schedule, resource and resource forecast, risk and issues logs \nProvides unique views of project status updates and facilitates cross development team dependencies and communications \nIdentify action or mitigation plans for issues or risks that arise during the project lifecycle \nCollaborates with core teams and execution teams to identify areas that require special attention or escalations to identify corrective actions \nCollect, analyze, organize and publish work performance data via dashboards and recurring status reports \n PREFERRED EXPERIENCE: \nDetailed oriented, self-driven with a strong sense of pride and ownership. \nStrong organizational, problem-solving, interpersonal, presentation, written and verbal communication skills \nAbility to build relationships and work effectively as a self-starter and as part of a team \nProactively involve team members in planning, decision-making and execution efforts \nPeople management experience is desirable \nExcellent verbal and written communication skills to handle all levels of interaction, including executive level \nHorizontal leadership/Matrix management experience \nTechnical program management and customer relationship management \nCollaborate in problem solving and mitigating risks with Engineering, Program/Project Management, Business Units and Product Management - both internal and external \nStrong knowledge of productivity and project tools including Jira, Confluence, Microsoft Office Suite \n ACADEMIC CREDENTIALS: \nBachelor’s or Master’s degree in Computer/Electrical Engineering \nFormal project management education, PMP / Scrum Master \n #LI-RR1\n#LI-Hybrid\n\n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/66297?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-11T00:29:32.099499"
=======
    "scraped_at": "2025-09-11T02:37:24.614221"
>>>>>>> Stashed changes
  },
  {
    "title": "Lead Software Development Eng.",
    "location": "IN,Bangalore\n#102-103, Export Promotion Industrial Park\nBangalore, Karnataka\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\nMTS SOFTWARE DEVELOPMENT ENGINEER \n THE ROLE: \nThe team works on cutting edge research opportunities helping AMD business to flourish against competition. The team takes up research problems/challenges by the Business Units and help them resolve those issues in the AMD products. The engineer is expected to be highly innovative, motivated to solve real engineering problems with doing independent research. The areas may include CPU design/optimizations, Deep Learning optimizations for CPU/GPUs/AIEs, and related areas. The candidate is expected to have deep understanding of systems (both architectures, OS/Compilers) and domain knowledge such as Deep Learning.  \nWe are looking for a Member of Technical Staff with experience in research in the above areas and ability to deliver innovative solutions in systems/architecture and domain specific software.\nTHE PERSON: \nYou are a self-starter with passion for driving large-scale technical projects, consistent record of solving highly sophisticated problems along with solid technical background. You possess excellent interpersonal, verbal, and written communication skills, as well as excellent organizational and time management skills. You are used to working independently, yet as part of a team where teamwork is of utmost importance. \nKEY RESPONSIBILITIES: \nUnderstand the challenges in current design/optimization opportunities in the software.\nWork with Business units to articulate the problem.\nComing out with a plan for solving this for next couple of years\nDriving the research to solve the problem and possibly publishing the work in competitive journals.\nReporting the progress and presenting this to execs\n PREFERRED EXPERIENCE: \nPhD/MTech in CSE from a reputed institute with exceptional grades\nGood knowledge of C++, proven ability to read and understand Java and Python code \nWorking knowledge of scripting languages such as shell scripts and Perl is an added advantage.  \nExcellent research and analytical skills \nExcellent organizational and time management skills \nExcellent interpersonal, verbal, and written communication skills\nDeep understanding of CPU designs and Deep Learning stack \nACADEMIC CREDENTIALS: \nPhD/Master’s in Computer Science & Engineering Degree or equivalent\n10+ years of software development experience\nUnderstanding of IP licensing principles and open-source compliance\n #LI-SK3\n\n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/64456?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-11T00:29:35.960332"
=======
    "scraped_at": "2025-09-11T02:37:26.350492"
>>>>>>> Stashed changes
  },
  {
    "title": "Director Engineering",
    "location": "IN,Bangalore\n2nd Fl, Front Wing, Kabra Excelsior, 6A, 1st Block, 7th Main Road\nBangalore, Karnataka\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\nTHE ROLE:\nAs a Wired System Architect, you will be responsible for participating in standards bodies and understanding wired comms technology trends, defining products (silicon, IP, boards), defining system reference designs & implementation, system architecture engagement with customers, ecosystem partner engagements for solution development, and sales & field enablement for AMD technology adoption. This role requires prior experience in system architecture, systems engineering, design & implementation, test & validation, performance benchmarking preferably at leading OEMs for comms infrastructure segments such as packet/ optical networks, security – data & control path, datacenter interconnect, enterprise/ service provider broadband access, and emerging AI ML model inference applications in wired networks.\n THE PERSON:\nThe ideal person has outstanding problem-solving skills, analytical skills, attention to design details, creative & out of box thinking, interpersonal skills at driving collaboration across cross-functional teams for common goals, penchant for listening to/ learning from peers, persistence & perseverance at the face of obstacles, patience to iterate for optimal solution, and ability to document & share best design practices. AMD culture of execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives is critical for success in this role.\n KEY RESPONSIBILITIES:\nSpecify product roadmaps for FPGA/SoC, IP, custom ASIC aligned with technological trends and emerging use cases\nIdentify customer system requirements, develop system architecture proposals to help customer differentiate, lower cost, power, and TTM\nContributing to business strategy & successful execution of strategy to fruition, sales and field training/ enablement and demand generation Identify\nDefine system design requirements, design & implementation of system reference designs\nGuide/ mobilize/ and work with internal engineering teams and partner ecosystem for timely execution of IP and system reference designs\nCollaborate with Silicon and Tools marketing teams for alignment and execution on product/ market requirements\nEnable sales and field to drive AMD technology adoption for successful execution on business, revenue, and profitability goals\n PREFERRED EXPERIENCE:\n15+ years of experience in design and development of wired subsystems at leading OEM vendors using FPGA/ SoC and/ or ASICs\nDeep knowledge of Ethernet protocols and associated security standards, packet/ optical networks, and broadband access technologies\nExpert levels skills in RTL design, FPGA tools and/or ASIC design methodologies\nExperience in wired subsystem design performance benchmarking, power optimization, and system thermal design considerations\nAbility to operate effectively in a fast-paced environment with changing deadlines\nStrong project management, process management, analytical and consulting skills\nACADEMIC CREDENTIALS:\nBachelor’s in engineering is a must. Master’s or PhD degree is a plus\n  #LI-NS2\n\n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/65693?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-11T00:29:40.027667"
=======
    "scraped_at": "2025-09-11T02:37:28.004526"
>>>>>>> Stashed changes
  },
  {
    "title": "Director Systems Design Eng.",
    "location": "IN,Bangalore\n2nd Fl, Front Wing, Kabra Excelsior, 6A, 1st Block, 7th Main Road\nBangalore, Karnataka\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\nTHE ROLE:\nAs a Wired System Architect, you will be responsible for participating in standards bodies and understanding wired comms technology trends, defining products (silicon, IP, boards), defining system reference designs & implementation, system architecture engagement with customers, ecosystem partner engagements for solution development, and sales & field enablement for AMD technology adoption. This role requires prior experience in system architecture, systems engineering, design & implementation, test & validation, performance benchmarking preferably at leading OEMs for comms infrastructure segments such as packet/ optical networks, security – data & control path, datacenter interconnect, enterprise/ service provider broadband access, and emerging AI ML model inference applications in wired networks.\n THE PERSON:\nThe ideal person has outstanding problem-solving skills, analytical skills, attention to design details, creative & out of box thinking, interpersonal skills at driving collaboration across cross-functional teams for common goals, penchant for listening to/ learning from peers, persistence & perseverance at the face of obstacles, patience to iterate for optimal solution, and ability to document & share best design practices. AMD culture of execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives is critical for success in this role.\n KEY RESPONSIBILITIES:\nSpecify product roadmaps for FPGA/SoC, IP, custom ASIC aligned with technological trends and emerging use cases\nIdentify customer system requirements, develop system architecture proposals to help customer differentiate, lower cost, power, and TTM\nContributing to business strategy & successful execution of strategy to fruition, sales and field training/ enablement and demand generation Identify\nDefine system design requirements, design & implementation of system reference designs\nGuide/ mobilize/ and work with internal engineering teams and partner ecosystem for timely execution of IP and system reference designs\nCollaborate with Silicon and Tools marketing teams for alignment and execution on product/ market requirements\nEnable sales and field to drive AMD technology adoption for successful execution on business, revenue, and profitability goals\n PREFERRED EXPERIENCE:\n15+ years of experience in design and development of wired subsystems at leading OEM vendors using FPGA/ SoC and/ or ASICs\nDeep knowledge of Ethernet protocols and associated security standards, packet/ optical networks, and broadband access technologies\nExpert levels skills in RTL design, FPGA tools and/or ASIC design methodologies\nExperience in wired subsystem design performance benchmarking, power optimization, and system thermal design considerations\nAbility to operate effectively in a fast-paced environment with changing deadlines\nStrong project management, process management, analytical and consulting skills\nACADEMIC CREDENTIALS:\nBachelor’s in engineering is a must. Master’s or PhD degree is a plus\n #LI-NS2\n\n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/68211?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-11T00:29:44.414580"
=======
    "scraped_at": "2025-09-11T02:37:29.699073"
>>>>>>> Stashed changes
  },
  {
    "title": "MTS Software System Design Eng.",
    "location": "IN,Bangalore\n2nd Fl, Front Wing, Kabra Excelsior, 6A, 1st Block, 7th Main Road\nBangalore, Karnataka\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\nTHE ROLE:\nWe offer the industry’s strongest portfolio of High Performance and Adaptive Computing products spanning CPUs, GPUs, FPGAs, and Adaptive SoCs. With these, we deliver differentiated solutions for cloud, edge, and intelligent end devices, that accelerate a diverse set of emerging workloads, from AI to smart networking and software-defined infrastructure. If you want to work with leading professors in top universities supporting exciting research and teaching projects using our state-of-the-art technologies, we invite you to apply to join our University Program team, which is part of the AMD Research and Advanced Development group.\nWe advance academic teaching, research, and entrepreneurial activities with our technologies by:\nProviding educators and researchers with access to our latest technology\nDeveloping and delivering teaching and training workshops designed for academia\nDeveloping open-source hardware and software projects for and with academia\nOrganizing academic contests, hackathons, and other events\nEnabling new business and technical opportunities through partnerships\nTHE PERSON:\nWe are seeking a Software Engineer to join our team.  You will join a team that is passionate about enabling academics with AMD High Performance and Adaptive Computing technologies. In this position you will be working our latest hardware and software. You will make use of innovative technologies to help us to support and continuously streamline our engineering and business processes necessary to ensure that our academic customers have a great service.\nKEY RESPONSIBILITIES:\nEnabling the use of AI, High Performance and Adaptive Computing technologies in academia\nDelivering technical training workshops to professors and graduate students on our latest hardware and software technologies\nCreating teaching materials, labs, design examples, demos and application notes\nCollaborating with faculty and students on research and teaching programs\nCollaborating with faculty on external funding opportunities and large programs\nDeveloping technical projects and supervising intern projects as required\nSupporting conferences, trade shows and customer-facing events\nSupporting academic customer queries and technical issues\nCollaborating with other teams at AMD and external partners on academic programs\nContributing to the specification, evaluation, and development of systems for academic use\nIdentifying and disseminating examples of best practices in teaching and research\nKeeping up to date with latest developments in the related markets and local industries\nManaging of operations and special programs\nPREFERRED EXPERIENCE:\nHands-on use of AI tools, frameworks, and platforms (e.g., TensorFlow, PyTorch, or similar).\nFamiliarity with AMD AI, high-performance, and adaptive computing hardware, as well as related software tools.\nStrong software programming and development skills.\nProven problem-solver and self-starter, able to work independently and take the lead on new initiatives.\nExcellent communicator with strong interpersonal skills, comfortable working across cross-functional and remote teams.\nWillingness to travel nationally and internationally to support program needs.\nADDITIONAL SKILLS AND EXPERIENCE\nWe recognize that strong candidates may come from a variety of backgrounds. You don’t need to have all of the following, but experience in some of the following areas would be a strong advantage:\nData science, AI/ML infrastructure, or applications development.\nHigh-performance computing (HPC) and compute acceleration.\nBackground in academic research or teaching — or experience as a product, applications, or customer support engineer.\nTechnical proficiency in:\nProgramming languages: Python, C/C++\nProgramming models: HIP/ROCm/CUDA, MPI, OpenMP, BLAS\nDevOps tools: Kubernetes, Slurm, VMware\nContributions to open-source projects or communities.\nWriting successful technical proposals.\nPublishing and presenting technical papers at conferences.\nProgram management; leading projects from concept to completion, aligning teams, resources, and timelines for maximum impact.\nACADEMIC CREDENTIALS:\nBachelor’s or Master’s degree with relevant experience, or a PhD in Electrical Engineering, Computer Engineering/Science, or a related field, or equivalent expertise gained through other professional paths.\n #LI-NS2\n\n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/71058?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-11T00:29:47.869668"
=======
    "scraped_at": "2025-09-11T02:37:31.390826"
>>>>>>> Stashed changes
  },
  {
    "title": "IP/SoC Verification Engineer",
    "location": "IN,New Delhi\n2nd Floor, A – 25, Mohan Co-operative Industrial Estate, Mathura Road\nNew Dehli, \nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\nMTS SILICON DESIGN ENGINEER  \n THE ROLE: \nThe focus of this role is to plan, build, and execute the verification of new and existing features for AMD’s graphics processor IP, resulting in no bugs in the final design.   \n THE PERSON:  \nYou have a passion for modern, complex processor architecture, digital design, and verification in general. You are a team player who has excellent communication skills and experience collaborating with other engineers located in different sites/timezones. You have strong analytical and problem-solving skills and are willing to learn and ready to take on problems. \n KEY RESPONSIBILITIES:  \nCollaborate with architects, hardware engineers, and firmware engineers to understand the new features to be verified \nBuild test plan documentation, accounting for interactions with other features, the hardware, the firmware, and the software driver use cases \nEstimate the time required to write the new feature tests and any required changes to the test environment \nBuild the directed and random verification tests \nDebug test failures to determine the root cause; work with RTL and firmware engineers to resolve design defects and correct any test issues  \nReview functional and code coverage metrics – modify or add tests or constrain random tests to meet the coverage requirements \n PREFERRED EXPERIENCE:  \nProficient in IP level ASIC verification, SoC and Sub-system verification\nProficient in debugging firmware and RTL code using simulation tools  \nProficient in using UVM testbenches and working in Linux and Windows environments \nExperienced with Verilog, System Verilog, C, and C++   \nGraphics pipeline knowledge \nDeveloping UVM based verification frameworks and testbenches, processes and flows \nAutomating workflows in a distributed compute environment.   \nExposure to simulation profile, efficiency improvement, acceleration, HLS tools/process \nStrong background in the C++ language, preferably on Linux with exposure to Windows platform \nGood understanding and hands-on experience in the UVM concepts and SystemVerilog language \nGood working knowledge of SystemC and TLM with some related experience.   \nScripting language experience: Perl, Ruby, Makefile, shell preferred.   \nExposure to leadership or mentorship is an asset \nDesirable assets with prior exposure to video codec system or other multimedia solutions.   \n ACADEMIC CREDENTIALS:  \nBachelors or Masters degree in computer engineering/Electrical Engineering \n #LI-RP1\n\n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/69612?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-11T00:29:56.259000"
=======
    "scraped_at": "2025-09-11T02:37:33.090828"
>>>>>>> Stashed changes
  },
  {
    "title": "SoC Design Verification Engineer",
    "location": "IN,New Delhi\n2nd Floor, A – 25, Mohan Co-operative Industrial Estate, Mathura Road\nNew Dehli, \nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\nMTS SILICON DESIGN ENGINEER  (ASIC - SoC Design Verification Lead)\n THE ROLE: \nThe focus of this role is to plan, build, and execute the verification of new and existing features for AMD’s custom silicon/ASIC designs, resulting in no bugs in the final design.   \n THE PERSON:  \nYou have a passion for modern, complex processor architecture, digital design, and verification in general. You are a team player who has excellent communication skills and experience collaborating with other engineers located in different sites/timezones. You have strong analytical and problem-solving skills and are willing to learn and ready to take on problems. \n KEY RESPONSIBILITIES :\nCollaborate with the Arch, Design, Functional DV, Emulation, Platform Debug, etc teams to understand Architecture and verification asks\nAbility to come with detailed testplan based on the Arch specs\nGood understanding and exposure to SoC design and architecture\n10+ years of Design Verification experience with strong Verilog, System Verilog, C and UVM/OVM knowledge\nCandidate should be able to develop Testbench. Thorough understanding of verification environments including need, methodology, stimulus, checkers, scoreboards, coverage aspects. Developing functional coverage & assertions.\nOwn the DV sign-off and ensure a bug free design\nWork with the post-silicon team on debug support and to help root-cause any failures\nHave worked on wireless protocol design verification\nBringing up Testbench/SoC verification environment. Good understanding of SoC RESET/CLOCK flow\nExposure to DEBUG concepts such as JTAG etc\nComfortable with VCS/Verdi and excellent debug skills\nLogical in thinking and ability to gel well within a team\nGood communication skills\nContinuously drive methodology improvements to improve efficiency\nMentor junior engineers to build a high performing team\n PREFERRED EXPERIENCE:  \nProficient in SoC/sub-system/IP level ASIC verification \nProficient in debugging firmware and RTL code using simulation tools  \nProficient in using UVM testbenches\nExperienced with Verilog, System Verilog, C, and C++   \nWorked on any High Speed Interface like PCIE/DDR/USB/Other, Good understanding of AXI/AHB/APB Bus protocol\nPrior knowledge of ARM/RISC Processor based designs verification and bring-up verification\nDeveloping UVM based verification frameworks and testbenches, processes and flows \nGood understanding and hands-on experience in the UVM concepts and SystemVerilog language \nScripting language experience: Perl, Python, Makefile, shell preferred.\n\n\n#LI-RP1\n \n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/64584?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-11T00:30:00.559700"
=======
    "scraped_at": "2025-09-11T02:37:36.635669"
>>>>>>> Stashed changes
  },
  {
    "title": "Sr. Silicon Design Engineer",
    "location": "IN,New Delhi\n2nd Floor, A – 25, Mohan Co-operative Industrial Estate, Mathura Road\nNew Dehli, \nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\nSENIOR SILICON DESIGN ENGINEER \n (ASIC - SoC Design Verification Lead)\n THE ROLE: \nThe focus of this role is to plan, build, and execute the verification of new and existing features for AMD’s custom silicon/ASIC designs, resulting in no bugs in the final design.   \n THE PERSON:  \nYou have a passion for modern, complex processor architecture, digital design, and verification in general. You are a team player who has excellent communication skills and experience collaborating with other engineers located in different sites/timezones. You have strong analytical and problem-solving skills and are willing to learn and ready to take on problems. \n KEY RESPONSIBILITIES :\nCollaborate with the Arch, Design, Functional DV, Emulation, Platform Debug, etc teams to understand Architecture and verification asks\nAbility to come with detailed testplan based on the Arch specs\nGood understanding and exposure to SoC design and architecture\n8years of Design Verification experience with strong Verilog, System Verilog, C and UVM/OVM knowledge\nCandidate should be able to develop Testbench. Thorough understanding of verification environments including need, methodology, stimulus, checkers, scoreboards, coverage aspects. Developing functional coverage & assertions.\nOwn the DV sign-off and ensure a bug free design\nWork with the post-silicon team on debug support and to help root-cause any failures\nHave worked on wireless protocol design verification\nBringing up Testbench/SoC verification environment. Good understanding of SoC RESET/CLOCK flow\nExposure to DEBUG concepts such as JTAG etc\nComfortable with VCS/Verdi and excellent debug skills\nLogical in thinking and ability to gel well within a team\nGood communication skills\nContinuously drive methodology improvements to improve efficiency\nMentor junior engineers to build a high performing team\n PREFERRED EXPERIENCE:  \nProficient in SoC/sub-system/IP level ASIC verification \nProficient in debugging firmware and RTL code using simulation tools  \nProficient in using UVM testbenches\nExperienced with Verilog, System Verilog, C, and C++   \nWorked on any High Speed Interface like PCIE/DDR/USB/Other, Good understanding of AXI/AHB/APB Bus protocol\nPrior knowledge of ARM/RISC Processor based designs verification and bring-up verification\nDeveloping UVM based verification frameworks and testbenches, processes and flows \nGood understanding and hands-on experience in the UVM concepts and SystemVerilog language \nScripting language experience: Perl, Python, Makefile, shell preferred.\n #LI-SR4  \n\n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/68032?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-11T00:30:04.828474"
=======
    "scraped_at": "2025-09-11T02:37:41.609701"
>>>>>>> Stashed changes
  },
  {
    "title": "DFT Lead",
    "location": "IN,New Delhi\n2nd Floor, A – 25, Mohan Co-operative Industrial Estate, Mathura Road\nNew Dehli, \nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\nDFT Lead\n\nTHE ROLE: \nAECG SSD ASIC is a centralized ASIC design group within AMD’s Adaptive and Embedded Computing Organization. The group consists of design teams located in several AMD locations in North America and Asia. It is primarily responsible for architecture, design, and implementation of critical Design-for-Test (DFT) and Design-for-Debug (DFD) features for cutting edge AMD products.\nAs a member of the AECG SSD ASIC Group, you will help bring to life cutting-edge designs. As a member of the DFT design/integration team, you will work closely with the architecture, IP design, Physical Design teams, and product engineers to achieve first pass silicon success.\n\nTHE PERSON:\nA successful candidate will work with senior silicon design engineers. The candidate will be highly accurate and detail-oriented, possessing good communication and problem-solving skills.\n\nKEY RESPONSIBLITIES:\nImplementation and verification of DFT architecture and features \nScan insertion and ATPG pattern generation \nATPG patterns verification with gate-level simulation \nTest coverage and test cost reduction analysis \nPost silicon support to ensure successful bring up and enhance yield learning\nWorking with a multi-functional and cross-GEOs team of engineers on DFT (design-for-test) and DFD (design-for-debug) architecture and methodology.\nPerforming design-for-test (DFT) RTL design using architectural specifications and design generation flows\nPerforming DFT RTL integration, synthesis, equivalency checking, timing analysis and defining constraints, verification of DFx logic at RTL and GLS.\nWriting and maintain DFT documentation and specifications.\nDeveloping CAD software, scripts and other support technology to enable successful construction of DFT logics in complex SoC design.\nPerforming scan insertion, ATPG verification and test pattern generation\nProviding DFT feature bring-up and pattern debug support to production engineering team during first silicon bring-up, qualification and failure analysis.\n\nPREFERRED EXPERIENCE:\nDFT design, integration, verification, ATPG and Silicon Debug experience.\nDemonstrated technical leadership and works well with cross-functional teams.\nExcellent communication and interpersonal skills\nUnderstanding of Design for Test methodologies and DFT verification experience (eg. IEEE1500, JTAG 1149.x, Scan, memory BIST etc.) \nExperience in complex ASIC design (multi-million gates) in DFT/DFD techniques such as JTAG/IEEE standards, scan and ATPG, on-chip test pattern compression and at-speed testing using PLL, memory BIST and repair, logic BIST, power-gating, on-chip debug logic, testing of high speed SerDes IO and analog design.\nUnderstanding various technologies that must work with DFT/DFD technology such as CPU’s, memory and I/O controllers, etc.\nExpertise in scan compression architecture, scan insertion and ATPG methodologies are essential.\nWorking knowledge and experience in Verilog simulator and waveform debugging tools, proficiency in debugging both RTL and gate level simulations\nExperience in solving logic design or timing issues with integration, synthesis and PD teams.\nGood working knowledge of UNIX/Linux and scripting languages (e.g., TCL, c-shell, Perl), C++ programming\nKnowledge in EDA tools/methodology, such as synthesis, equivalency checking, static timing analysis.\nKnowledge of ATE and digital IC manufacturing test is a plus.\nStrong problem-solving skills.\nTeam player with strong communication skills.\n ACADEMIC CREDENTIALS:\nBachelors or Masters degree in computer engineering/Electrical Engineering \n\n\n\n#LI-RG2\n\n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/66818?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-11T00:30:09.061536"
=======
    "scraped_at": "2025-09-11T02:37:43.398748"
>>>>>>> Stashed changes
  }
]