[
  {
    "title": "Senior Test Development Engineer",
    "location": "IN,Hyderabad\nBuilding 11, Survey No. 64 at Campus, Mindspace, Madhapur\nHyderabad, Telangana\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\nSenior Test Development Engineer\n THE ROLE: \nAMD is looking for a specialized software product engineer who is passionate about improving the quality of products and benchmarks. You will be a member of a core team of incredibly talented industry specialists and will work with the very latest hardware and software technology. The right engineer will drive the success of features in AMD (Advanced Micro Devices) products through leadership & coordination, resolution of technical dependencies, and achievement of schedule commits.\n THE PERSON: \nThe ideal candidate should be passionate about software engineering and possess leadership skills to drive sophisticated issues to resolution. Your curiosity will drive your learning and innovation to improve how we as a group, and an organization, can get better every day. Your peers will provide you a results-oriented and encouraging environment for your career growth, fueling your opportunity to be a part of Delighting Our Customers.    \n KEY RESPONSIBILITIES: \nYou will be responsible for the development of the test suites that ensure enterprise quality for AMD’s Software Compute stack\nYou will work closely with other software and hardware engineers and architects\nEnsure test coverage for the GPU product features\nReview requirements and create associated test cases to ensure traceability\nCoordinate triaging of issues and drive them to closure \nMake tough decisions such as priority calls based on partial or incomplete data   \nProactively drive continuous improvement for functional and performance QA activities \nMust be a self-starter, and able to independently drive tasks to completion \n PREFERRED EXPERIENCE: \nProduct development or systems engineering background with hardware platforms and their software & firmware ecosystems \nTest plan and test development experience for a range of industry workloads\nStrong knowledge of GPU, CPU, SoC or computer system architecture\nKnowledge of OpenCL or CUDA GPU Computing Languages a plus\nProven record in large scale data center engineering\nParallel Computing Skills with MPI Programing experience a plus\nDeep Learning, High Performance Computing or GPU Server Based computing a big plus\nFamiliar with\nAI/ML concepts\nGeneral Computer Architecture concepts\nBasics of programming\nMicrosoft and Linux Operating Systems\nCloud, Virtualization and Container environments\nSystem level, functional and environmental stress testing\nExcellent interpersonal, organizational, analytical, planning, and technical leadership skills \n ACADEMIC CREDENTIALS: \nBachelor’s or Master's degree in Computer/Electronics/Electrical Engineering or equivalent \n #LI-NR1\n\n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/65460?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
    "scraped_at": "2025-09-10T15:28:25.311088"
  },
  {
    "title": "Sr Technical QA Engineer",
    "location": "IN,Hyderabad\nBuilding 11, Survey No. 64 at Campus, Mindspace, Madhapur\nHyderabad, Telangana\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\nSr Technical QA Engineer\n THE ROLE: \nWe are seeking an engineer to join our team that will thrive in a fast-paced work environment, using effective communication, problem-solving and prioritization skills. Individuals that are well organized, show great attention to detail, and employ critical thinking are well-suited for our team.\n  THE PERSON: \nWe are looking for an experienced Senior QA engineer with expertise in virtualization, hypervisors, GPU virtualization, and advanced I/O technologies. This role drives comprehensive feature validation and roadmap projects while ensuring robust quality assurance strategies across traditional and specialized virtual environments. Your remit will include validating GPU virtualization and the intricacies of SR-IOV (Single Root I/O Virtualization) and pass-through technologies, all crucial for delivering high-performance computing, AI, platform specific and data-intensive applications\n  As a QA Tech lead, you will be the driving force behind the quality assurance process for our cutting-edge AI SDK products. You will drive accountability in development practices, audit CI processes, enforce stringent unit test code coverage, and oversee high-level functional test content execution. In addition, you must have hands-on development and validation expertise, including robust experience in SDK development and validation, as well as a deep understanding of AI/ML, GPU environments, and Linux systems. You will work directly with development teams—holding them accountable for maintaining and exceeding quality metrics—while also leading collaborative efforts with our Test Content Teams (TCT) and Automation groups to keep our product at the forefront of innovation.\n  Key Responsibilities\n Establish and maintain high-quality standards by defining QA best practices and promoting a culture of accountability across development teams.\nUtilize your hands-on development knowledge to design integrated validation strategies that align with overall project goals.\nCollaborate directly with engineers, ensuring they deliver high-quality code that complies with established test coverage and CI/CD best practices.\nDefine, monitor, and enforce high standards for unit test (UT) code coverage, ensuring that all critical functionalities are thoroughly validated.\nOversee the execution of high-level functional tests, ensuring that software features and end-to-end user scenarios operate seamlessly.\nDrive the validation efforts for Software Development Kits (SDKs) by designing comprehensive test cases and testplans to verify functionality, performance, compatibility, and integration.\nConduct regular audits of the Continuous Integration (CI) pipeline, ensuring that all code undergoes rigorous automated testing and validation before integration.\nFacilitate clear communication among development, QA, and product teams; provide actionable insights to continuously improve product quality.\nWork closely with the Test Content Team to align on test content strategies and ensure the execution aligns with product requirements.\nActively participate participate in design and code reviews from a QA perspective to ensure quality is embedded in every stage of product development.\nUse your development and debugging expertise to assist in troubleshooting complex issues alongside the development teams.\nApply your knowledge and experience in AI/ML to validate data models, performance, and integration within relevant projects.\nExcellent communication and leadership skills, with the capability to bridge efforts across development and QA teams to ensure quality and timely project delivery.\nIdentify, propose, and implement process improvements to reduce the cycle time of testing phases and improve product quality.\n Serve as a trusted advisor to your peers and junior QA engineers, fostering a culture of accountability, quality, and continuous learning.\n  Requirements\nBachelor’s or master’s degree in computer science, Engineering, or a related field with 12+ yrs of related experience\nDemonstrated hands-on development expertise with practical experience in coding, debugging, and designing validation strategies.\nDeep understanding and experience with unit testing frameworks (such as JUnit, NUnit, LCOV, or similar code coverage tools).\nExtensive knowledge of CI/CD pipelines, unit testing frameworks, automated testing tools, and functional testing methodologies.\nStrong proficiency in SDK development and validation—proven ability to create and execute comprehensive test strategies that ensure robust and reliable APIs and libraries.\nIn-depth understanding of AI/ML concepts and practical testing experience in data-driven, machine learning environments.\nExposure to advanced test automation frameworks and willingness to explore new testing paradigms involving AI/ML and GPU-optimized processes.\nHands-on experience working with GPU environments and optimizing tests for performance on hardware-accelerated systems.\nStrong proficiency in working within Linux environments (Ubuntu, CentOS, etc.).\nFamiliarity with GPU computing technologies (e.g., ROCm, CUDA, OpenCL) for performance-critical applications.\nDemonstrable expertise with Docker containerization practices. Exposure to additional container orchestration tools like Kubernetes.\nPrior experience with AI/ML frameworks such as TensorFlow or PyTorch.is a plus\nAdvanced scripting and programming skills in languages such as Python, C/C++, or similar\nExceptional analytical, problem-solving, and communication skills.\nA self-driven, detail-oriented mindset with an ability to judiciously hold teams accountable.\nComfort working independently in a fast-paced, dynamic environment.\n #LI-NR1 \n\n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/65371?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
    "scraped_at": "2025-09-10T15:29:26.053588"
  },
  {
    "title": "Senior ML Application Engineer",
    "location": "IN,Hyderabad\nBuilding 11, Survey No. 64 at Campus, Mindspace, Madhapur\nHyderabad, Telangana\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\nMTS SOFTWARE DEVELOPMENT ENGINEER \n THE ROLE: \nAMD is looking for a specialized software engineer who is passionate about improving the performance of key applications and benchmarks. You will be a member of a core team of incredibly talented industry specialists and will work with the very latest hardware and software technology.  \n THE PERSON: \nThe ideal candidate should be passionate about software engineering and possess leadership skills to drive sophisticated issues to resolution. Able to communicate effectively and work optimally with different teams across AMD.  \n Key Responsibilities\nDevelop test cases to validate functionality and performance.\nMonitor and maintain end-to-end ML test cases for the compiler in production, addressing issues as they arise.\nContribute to open-source projects, sharing your developments with the community.\nInfluence the direction of the AMD AI platform.\nCollaborate across teams with various groups and stakeholders.\n  Preferred Experience\nA minimum of 7+ years of experience in relevant fields.\nProficiency with AI/DL frameworks such as PyTorch, ONNX, or TensorFlow.\nExceptional programming skills in Python, including debugging, profiling, and performance analysis.\nExperience with machine learning pipelines and CI/CD pipelines.\nKnowledge of MLIR is a significant advantage.\nStrong communication and problem-solving abilities.\nKEY RESPONSIBILITIES: \nWork with AMD’s architecture specialists to improve future products  \nApply a data minded approach to target optimization efforts \nStay informed of software and hardware trends and innovations, especially pertaining to algorithms and architecture \nDesign and develop new groundbreaking AMD technologies \nParticipating in new ASIC and hardware bring ups  \nDebugging/fix existing issues and research alternative, more efficient ways to accomplish the same work \nDevelop technical relationships with peers and partners \n \n#LI-NR1 \n\n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/66815?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
    "scraped_at": "2025-09-10T15:30:00.284443"
  },
  {
    "title": "Sr. Silicon Design Engineer",
    "location": "IN,Hyderabad\nBuilding 11, Survey No. 64 at Campus, Mindspace, Madhapur\nHyderabad, Telangana\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\n Sr. SILICON DESIGN ENGINEER  \n THE ROLE: \nThe position will involve working with a very experienced physical design team of Server SOC and is responsible for delivering the physical design of tiles to meet challenging goals for frequency, power and other design requirements for AMD next generation processors in a fast-paced environment on cutting edge technology.\n THE PERSON:  \nEngineer with good attitude who seeks new challenges and has good analytical and and problem-solving skills. Candidate needs to have the ability and desire to learn quickly and should be a good team player who has excellent communication skills and experience collaborating with other engineers located in different sites/timezones.  \n KEY RESPONSIBILITIES:  \nImplementing RTL to GDS2 flow\nHandling Floor-plan, Physical Implementation of Power-plan, Synthesis, Placement, CTS, Timing Closure, Routing, Extraction, Physical Verification (DRC & LVS), Crosstalk Analysis, EM/IR\nHandling different PNR tools - Synopsys ICC2, ICC, Design Compiler, PrimeTime, StarRC, Mentor Graphics Calibre, Apache Redhawk\n PREFERRED EXPERIENCE:  \n5+ years of professional experience in physical design, preferably with high performance designs.\nExperience in automated synthesis and timing driven place and route of RTL blocks for high speed datapath and control logic applications.\nExperience in automated design flows for clock tree synthesis, clock and power gating techniques, scan stitching, design optimization for improved timing/power/area, and design cycle time reduction.\nExperience in floorplanning, establishing design methodology, IP integration, checks for logic equivalence, physical/timing/electrical quality, and final signoff for large IP delivery\nStrong experience with tools for logic synthesis, place and route, timing analysis, and design checks for physical and electrical quality, familiarity with tools for schematics, layout, and circuit/logic simulation\nVersatility with scripts to automate design flow.\nStrong communication skills, ability to multi-task across projects, and work with geographically spread out teams\nExperience in FinFET & Dual Patterning nodes such as 16/14/10/7/5nm\nExcellent physical design and timing background.\nGood understanding of computer organization/architecture is preferred.\nStrong analytical/problem solving skills and pronounced attention to details.\nACADEMIC CREDENTIALS:\nQualification: Bachelors or Masters in Electronics/Electrical Engineering\n  \n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/69335?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
    "scraped_at": "2025-09-10T15:30:31.682270"
  },
  {
    "title": "Design Verification Engineer",
    "location": "IN,Hyderabad\nBuilding 11, Survey No. 64 at Campus, Mindspace, Madhapur\nHyderabad, Telangana\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\nMTS SILICON DESIGN ENGINEER  \n THE ROLE: \nThe focus of this role is to plan, build, and execute the verification of new and existing features for AMD’s graphics processor IP, resulting in no bugs in the final design.   \n THE PERSON:  \nYou have a passion for modern, complex processor architecture, digital design, and verification in general. You are a team player who has excellent communication skills and experience collaborating with other engineers located in different sites/timezones. You have strong analytical and problem-solving skills and are willing to learn and ready to take on problems. \n KEY RESPONSIBILITIES:  \nCollaborate with architects, hardware engineers, and firmware engineers to understand the new features to be verified \nBuild test plan documentation, accounting for interactions with other features, the hardware, the firmware, and the software driver use cases \nEstimate the time required to write the new feature tests and any required changes to the test environment \nBuild the directed and random verification tests \nDebug test failures to determine the root cause; work with RTL and firmware engineers to resolve design defects and correct any test issues  \nReview functional and code coverage metrics – modify or add tests or constrain random tests to meet the coverage requirements \n PREFERRED EXPERIENCE:  \nProficient in IP level ASIC verification \nProficient in debugging firmware and RTL code using simulation tools  \nProficient in using UVM testbenches and working in Linux and Windows environments \nExperienced with Verilog, System Verilog, C, and C++   \nGraphics pipeline knowledge \nDeveloping UVM based verification frameworks and testbenches, processes and flows \nAutomating workflows in a distributed compute environment.   \nExposure to simulation profile, efficiency improvement, acceleration, HLS tools/process \nStrong background in the C++ language, preferably on Linux with exposure to Windows platform \nGood understanding and hands-on experience in the UVM concepts and SystemVerilog language \nGood working knowledge of SystemC and TLM with some related experience.   \nScripting language experience: Perl, Ruby, Makefile, shell preferred.   \nExposure to leadership or mentorship is an asset \nDesirable assets with prior exposure to video codec system or other multimedia solutions.   \n ACADEMIC CREDENTIALS:  \nBachelors or Masters degree in computer engineering/Electrical Engineering\n#LI-PK2  \n\n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/68986?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
    "scraped_at": "2025-09-10T15:31:03.635087"
  },
  {
    "title": "Sr. Silicon Design Engineer",
    "location": "IN,Hyderabad\nBuilding 11, Survey No. 64 at Campus, Mindspace, Madhapur\nHyderabad, Telangana\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\n Sr. SILICON DESIGN ENGINEER  \nTHE ROLE: \nThe position will involve working with a very experienced physical design team of Server SOC and is responsible for delivering the physical design of tiles to meet challenging goals for frequency, power and other design requirements for AMD next generation processors in a fast-paced environment on cutting edge technology.\n THE PERSON:  \nEngineer with good attitude who seeks new challenges and has good analytical and and problem-solving skills. Candidate needs to have the ability and desire to learn quickly and should be a good team player who has excellent communication skills and experience collaborating with other engineers located in different sites/timezones.  \n KEY RESPONSIBILITIES:  \nImplementing RTL to GDS2 flow\nHandling Floor-plan, Physical Implementation of Power-plan, Synthesis, Placement, CTS, Timing Closure, Routing, Extraction, Physical Verification (DRC & LVS), Crosstalk Analysis, EM/IR\nHandling different PNR tools - Synopsys ICC2, ICC, Design Compiler, PrimeTime, StarRC, Mentor Graphics Calibre, Apache Redhawk\n PREFERRED EXPERIENCE:  \n5+ years of professional experience in physical design, preferably with high performance designs.\nExperience in automated synthesis and timing driven place and route of RTL blocks for high speed datapath and control logic applications.\nExperience in automated design flows for clock tree synthesis, clock and power gating techniques, scan stitching, design optimization for improved timing/power/area, and design cycle time reduction.\nExperience in floorplanning, establishing design methodology, IP integration, checks for logic equivalence, physical/timing/electrical quality, and final signoff for large IP delivery\nStrong experience with tools for logic synthesis, place and route, timing analysis, and design checks for physical and electrical quality, familiarity with tools for schematics, layout, and circuit/logic simulation\nVersatility with scripts to automate design flow.\nStrong communication skills, ability to multi-task across projects, and work with geographically spread out teams\nExperience in FinFET & Dual Patterning nodes such as 16/14/10/7/5nm\nExcellent physical design and timing background.\nGood understanding of computer organization/architecture is preferred.\nStrong analytical/problem solving skills and pronounced attention to details.\nACADEMIC CREDENTIALS:\nQualification: Bachelors or Masters in Electronics/Electrical Engineering\n  \n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/69336?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
    "scraped_at": "2025-09-10T15:31:39.531969"
  },
  {
    "title": "DFT Engineer",
    "location": "IN,Hyderabad\nBuilding 11, Survey No. 64 at Campus, Mindspace, Madhapur\nHyderabad, Telangana\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\nSMTS SILICON DESIGN ENGINEER\n\nTHE ROLE: \nAs a member of the Server SoC Group, you will help bring to life cutting-edge designs. As a member of the front-end design/integration team, you will work closely with the architecture, IP design, Physical Design teams, and product engineers to achieve first pass silicon success.\n\nTHE PERSON:\nA successful candidate will work with senior silicon design engineers. The candidate will be highly accurate and detail-oriented, possessing good communication and problem-solving skills.\n\nKEY RESPONSIBLITIES:\nImplementation and verification of DFT architecture and features \nScan insertion and ATPG pattern generation \nATPG patterns verification with gate-level simulation \nTest coverage and test cost reduction analysis \nPost silicon support to ensure successful bring up and enhance yield learning\n\nPREFERRED EXPERIENCE:\nUnderstanding of Design for Test methodologies and DFT verification experience (eg. IEEE1500, JTAG 1149.x, Scan, memory BIST etc.) \nExperience with Mentor testkompress and/or Synopsys Tetramax/DFTMAX \nExperience with VCS simulation tool, Perl/Shell scripting, and Verilog RTL design \n ACADEMIC CREDENTIALS:\nBachelors or Masters degree in computer engineering/Electrical Engineering \n #LI-AA1\n\n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/66470?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
    "scraped_at": "2025-09-10T15:32:11.525271"
  },
  {
    "title": "AI Software System Engineer",
    "location": "IN,Hyderabad\nBuilding 11, Survey No. 64 at Campus, Mindspace, Madhapur\nHyderabad, Telangana\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\nJob Title: AI Systems Engineer \nJob Overview: We are seeking an AI Systems Engineer to join our AMD IT compute platforms engineering team. The AI Systems Engineer is responsible for the design, development, and administration of High-Performance Computing (HPC) infrastructure, GPU clusters, and AI workload schedulers. \n ABOUT YOU: \nYou have a passion for learning. You are passionate about the field of large-scale distributed computing in AI and HPC workloads. You take responsibility for end-to-end outcomes of your efforts. You want to build scalable and highly performant HPC/AI/Data services with AMD hardware, software, people and processes. You have a curiosity to learn and improve scalable HPC systems. You have significant experience in working across a globally distributed organization. \nResponsibilities: \nDevelop, implement, and maintain GPU-based clusters, ensuring optimal performance  \nAdminister ML/AI platforms – Distributed ML services, LLMs and  AI inferencing, by managing deployments, resource allocation, monitoring, and security. \nAutomate system provisioning and Cluster management end to end \nCollaborate with cross-functional teams to address AI infrastructure requirements, support AI-related projects, and provide technical expertise. \nMonitor and evaluate the performance of AI systems and clusters, ensuring that they adhere to industry best practices and meet company standards. \nUse AI/ML to continuously improve internal processes and tools that are used in end-to-end delivery of your services in this team \nExperience and Qualifications: \n5+ years of experience in developing python based AI apps and UI \n5+ years of experience in HPC infrastructure engineering for AI/HPC domain \n5+ years of experience in SLURM and Kubernetes management \n2+ years of experience managing GPU clusters optimizing GPU-based services/tools/software \nExperience in creating web services with HPC backend (like AI) \nProficiency in RoCEv2, K8s, KVM, Ubuntu, Python, Shell, GPU drivers, and Cluster interconnect with 400G networking. \nDemonstrated experience with AI workload schedulers and allocation optimization. \nAutomation/monitoring tool - ansible / saltstack, terraform, Prometheus,  grafana \nStrong organizational, problem-solving, and troubleshooting skills, with the ability to manage multiple projects simultaneously. \nExcellent verbal and written communication skills, with the ability to collaborate effectively with team members and stakeholders at all levels of the organization. \nLocation: Hyderabad  \n #LI-SK4\n\n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/69060?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
    "scraped_at": "2025-09-10T15:32:43.279941"
  },
  {
    "title": "MTS Silicon Design Engineer",
    "location": "IN,Hyderabad\nBuilding 11, Survey No. 64 at Campus, Mindspace, Madhapur\nHyderabad, Telangana\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\nSoC Verification ENGINEER  \n THE ROLE: \nThe focus of this role is to plan, build, and execute the verification of new and existing features for AMD’s graphics processor IP, resulting in no bugs in the final design.   \n THE PERSON:\nYou have a passion for modern, complex processor architecture, digital design, and verification in general. You are a team player who has excellent communication skills and experience collaborating with other engineers located in different sites/timezones. You have strong analytical and problem-solving skills and are willing to learn and ready to take on problems.\n KEY RESPONSIBILITIES:\n·       Collaborate with architects, hardware engineers, and firmware engineers to understand the new features to be verified\n·       Build test plan documentation, accounting for interactions with other features, the hardware, the firmware, and the software driver use cases\n·       Estimate the time required to write the new feature tests and any required changes to the test environment\n·       Build the directed and random verification tests\n·       Debug test failures to determine the root cause; work with RTL and firmware engineers to resolve design defects and correct any test issues\n·       Review functional and code coverage metrics – modify or add tests or constrain random tests to meet the coverage requirements\n PREFERRED EXPERIENCE:\n·       Proficient in IP/Sub-System/SOC level ASIC verification\n·       Proficient in debugging firmware and RTL code using simulation tools\n·       Proficient in using UVM testbenches and working in Linux and Windows environments\n·       Experienced with Verilog, System Verilog, C, and C++\n·       Processor Micro-Architecture concepts – Reset/Boot-flow/Cache Coherency/Interrupt flows knowledge\n·       Developing UVM based verification frameworks and testbenches, processes and flows\n·       Automating workflows in a distributed compute environment.\n·       Exposure to simulation profile, efficiency improvement, acceleration, HLS tools/process\n·       Strong background in the C++ language, preferably on Linux with exposure to Windows platform\n·       Good understanding and hands-on experience in the UVM concepts and SystemVerilog language\n·       Good working knowledge of SystemC and TLM with some related experience.\n·       Scripting language experience: Perl, Ruby, Makefile, shell preferred.\n·       Exposure to leadership or mentorship is an asset\n·       Desirable assets with prior exposure to video codec system or other multimedia solutions.\n ACADEMIC CREDENTIALS:  \nBachelors or Masters degree in computer engineering/Electrical Engineering \n#LI-SR5\n\n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/70081?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
    "scraped_at": "2025-09-10T15:33:14.654927"
  },
  {
    "title": "Sr. Silicon Design Engineer",
    "location": "IN,Hyderabad\nBuilding 11, Survey No. 64 at Campus, Mindspace, Madhapur\nHyderabad, Telangana\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\nSENIOR SILICON DESIGN ENGINEER \n THE ROLE: \nWe are looking for an adaptive, self-motivative design verification engineer to join our growing team. As a key contributor, you will be part of a leading team to drive and improve AMD's abilities to deliver the highest quality, industry-leading technologies to market. The Verification Engineering team furthers and encourages continuous technical innovation to showcase successes as well as facilitate continuous career development. \n THE PERSON: \nYou have a passion for modern, complex processor architecture, digital design, and verification in general. You are a team player who has excellent communication skills and experience collaborating with other engineers located in different sites/timezones. You have strong analytical and problem-solving skills and are willing to learn and ready to take on problems. \n KEY RESPONSIBILITIES: \nDevelop/Maintain tests for functional verification and performance verification at the core level \nBuild testbench components to support the next generation IP \nMaintain or improve current test libraries to support IP level testing \nCreate hardware emulation build to verify the IP functional performance \nMaintain and improve current hardware emulation environment to speed up the runtime performance and improve the debug facility \nProvide technical support to other teams \n PREFERRED EXPERIENCE: \nGood at C/C++ \nFamiliarity with SystemVerilog and modern verification libraries like UVM \nExperience/Background on Computing/Graphics is a benefit \nExperience with OpenGL/OpenCL/D3D programming is a benefit \n ACADEMIC CREDENTIALS: \nBachelors or Masters degree in computer engineering/Electrical Engineering \n #LI-PK2\n\n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/69138?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
    "scraped_at": "2025-09-10T15:33:45.926438"
  },
  {
    "title": "MTS Silicon Design Engineer",
    "location": "IN,Hyderabad\nBuilding 11, Survey No. 64 at Campus, Mindspace, Madhapur\nHyderabad, Telangana\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\nSoC Verification Engineer\n THE ROLE: \nThe focus of this role is to plan, build, and execute the verification of new and existing features for AMD’s graphics processor IP, resulting in no bugs in the final design.   \n THE PERSON:\nYou have a passion for modern, complex processor architecture, digital design, and verification in general. You are a team player who has excellent communication skills and experience collaborating with other engineers located in different sites/timezones. You have strong analytical and problem-solving skills and are willing to learn and ready to take on problems.\n KEY RESPONSIBILITIES:\n·       Collaborate with architects, hardware engineers, and firmware engineers to understand the new features to be verified\n·       Build test plan documentation, accounting for interactions with other features, the hardware, the firmware, and the software driver use cases\n·       Estimate the time required to write the new feature tests and any required changes to the test environment\n·       Build the directed and random verification tests\n·       Debug test failures to determine the root cause; work with RTL and firmware engineers to resolve design defects and correct any test issues\n·       Review functional and code coverage metrics – modify or add tests or constrain random tests to meet the coverage requirements\n PREFERRED EXPERIENCE:\n·       Proficient in IP/Sub-System/SOC level ASIC verification\n·       Proficient in debugging firmware and RTL code using simulation tools\n·       Proficient in using UVM testbenches and working in Linux and Windows environments\n·       Experienced with Verilog, System Verilog, C, and C++\n·       Processor Micro-Architecture concepts – Reset/Boot-flow/Cache Coherency/Interrupt flows knowledge\n·       Developing UVM based verification frameworks and testbenches, processes and flows\n·       Automating workflows in a distributed compute environment.\n·       Exposure to simulation profile, efficiency improvement, acceleration, HLS tools/process\n·       Strong background in the C++ language, preferably on Linux with exposure to Windows platform\n·       Good understanding and hands-on experience in the UVM concepts and SystemVerilog language\n·       Good working knowledge of SystemC and TLM with some related experience.\n·       Scripting language experience: Perl, Ruby, Makefile, shell preferred.\n·       Exposure to leadership or mentorship is an asset\n·       Desirable assets with prior exposure to video codec system or other multimedia solutions.\n ACADEMIC CREDENTIALS:  \nBachelors or Masters degree in computer engineering/Electrical Engineering #LI-SR5\n\n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/70083?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
    "scraped_at": "2025-09-10T15:34:17.603031"
  },
  {
    "title": "Power Architecture - Team Lead (PTPX, Power Artist)",
    "location": "IN,Hyderabad\nBuilding 11, Survey No. 64 at Campus, Mindspace, Madhapur\nHyderabad, Telangana\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\nThe Role:\nWe are looking for a technical leader to join and lead the SOC Power Modeling team in the AMD Client Computing and Graphics group. This role involves collaboration with many engineering teams including SoC architecture definition, IP design, integration/physical design, verification, platform architecture, software, and firmware.  Contributions have a direct impact on the power & performance of AMD’s Client products.\n The Person:\nThe candidate should have strong SOC design process experience from front end to tapeout. The candidate will lead a team working closely with the SOC design teams on RTL and emulation-based power estimation, simulation and design flow extraction.  The candidate must be organized, self-motivated and able to work effectively on teams large and small across multiple sites. He or she must be able to prioritize assignments and drive them to completion. Strong verbal and written communication skills are essential for driving technical discussions to successful and actionable outcomes.\n Key Responsibilities:\nTeam leader for Hyderabad based power modeling group, work with management to define department objectives and growth plans. Make recommendations to improve processes or procedures as appropriate. Implement changes to engineering processes based on new technologies or industry standards. Work with department management on recruiting, hiring, training, and team evaluations.\nWork with frontend RTL, DFT, Synthesis, and Physical design teams in the development of power intent (UPF) design at SoC level.\nLead team with power estimates during the pre-silicon design process using Power Artist/PTPX emulation environments and ensure power objectives and goals are met.\nWork with RTL and physical design teams to scientifically assess and manage tradeoffs with impacts of power management options such as, but not limited to clock and power gating, device type mix and physical implementation options.\nTrack IP power development through the design cycle ensuring it meets power budgets - leakage/dynamic at every milestone.\nImprove power design flows in areas of power modeling, clock power analysis, structural power validation, IP power intent.\nWork with design verification in validating low power design features at SoC and IP level.\nPreferred Experience\nExtensive experience with Synopsys EDA tools, particularly PtPx/Power Artist.\nDetailed understanding of hardware emulation process, stimulus and EDA flow data extraction.\nAbility to define data reporting and requirements needs using EDA flows, Tcl and Python based scripting.\nAbility to work independently and lead a world-wide team.\nExcellent communication skills, written and verbal skills\nAcademic Credentials\nPhD or Master of Science degree in Electrical Engineering, Computer architecture, or Computer Science.\n10+ years of experience.\n #LI-RR1\n#LI-Hybrid\n\n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/65111?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
    "scraped_at": "2025-09-10T15:34:49.348359"
  },
  {
    "title": "Soc Power Architecture - Power Artist/PTPX",
    "location": "IN,Hyderabad\nBuilding 11, Survey No. 64 at Campus, Mindspace, Madhapur\nHyderabad, Telangana\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\nThe Role:\nWe are looking for an experienced engineer to join the SOC Power Modeling team in the AMD Client Computing and Graphics group. This role involves collaboration with multiple engineering teams including SoC architecture definition, IP design, integration/physical design, verification, and platform architecture.  Contributions have a direct impact on the power & performance of AMD’s Client products.\n The Person:\nThe candidate should have SOC design process experience from front end to tapeout. The candidate will work closely with the SOC design teams on RTL and emulation-based power estimation, simulation and design data extraction.  The candidate must be organized, self-motivated and able to work effectively on teams large and small across multiple sites. He or she must be able to prioritize assignments and drive them to completion. Good verbal and written communication skills are helpful for technical discussions with team members across the globe.\n Key Responsibilities:\nWork with front end RTL, DFT, Synthesis, and Physical design teams in the development of power intent (UPF) design at SoC level.\nWork with emulation team on power estimates during the pre-silicon design process using Power Artist/PTPX emulation environments and ensure power objectives and goals are met.\nWork with RTL and physical design teams to generate data on design impact from clock and power gating, device type mix and physical implementation options.\nTrack IP power development through the design cycle ensuring it meets power budgets - leakage/dynamic at every milestone.\nWork with design verification in validating low power design features at SoC and IP level.\nPreferred Experience\nExperience with Synopsys EDA tools, particularly PtPx/Power Artist.\nUnderstanding of hardware emulation process, stimulus and EDA flows.\nExperience with Tcl and Python based scripting.\nExperience with UPF.\nAcademic Credentials\nMaster or Bachelor of Science degree in Electrical Engineering.\n3+ years of experience.\n #LI-RR1\n#LI-Hybrid\n\n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/66223?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
    "scraped_at": "2025-09-10T15:35:21.157057"
  },
  {
    "title": "GFX- IP Verification Lead",
    "location": "IN,Hyderabad\nBuilding 11, Survey No. 64 at Campus, Mindspace, Madhapur\nHyderabad, Telangana\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\n THE ROLE:\n We are currently seeking a highly skilled verification engineer for GFX Verification team.\n Responsibilities:\nIn this role, he/she would be responsible for verification of GPU Verification by meeting the demands of the constantly evolving project schedule. The successful candidate will be a member of the GFX team. He/she will demonstrate passion towards design, design verification, be a teammate, a problem solver with independence, creativity, and interpersonal skills.\n Working with all partners such as lead architects and block design teams to understand features to be implemented and verified.\n Developing robust test plan for both synthetic testing and real workload trace\n Debug verification test failures, working with the design team to accurate defects.\n Make sure AMD next generation GFXIP can meet performance/power/function expectation.\nRequirements:\n Demonstrated expertise in UVM based verification environment and Formal Verification\nDevelopment of UVM based verification environment from scratch, including scoreboard, checkers etc,\nHandson work on subsystem level verification involving complex design and processors/ DSP\nGood hands-on work on AXI protocols verification\nHands-on experience in code coverage and functional coverage closure.\nGood in scripting languages\nGood understating of IO protocols like I2S, MIPI-soundwire, PDM,\nAcademic credentials:\nB.E/B.Tech or M.E/M.Tech degree in ECE/ Electrical Engineering / Computer Engineering with Digital Systems/VLSI as major with 8+ Years of Exp\nLocation: Bangalore, India\n #LI-NS1\n  \n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/65220?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
    "scraped_at": "2025-09-10T15:35:56.502159"
  },
  {
    "title": "Software Validation Engineer (QA)",
    "location": "IN,Hyderabad\nBuilding 11, Survey No. 64 at Campus, Mindspace, Madhapur\nHyderabad, Telangana\nIN",
    "experience_required": "Not specified",
    "job_description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. \nAMD together we advance_\n\n\n\nMTS SOFTWARE SYSTEM DESIGN ENGINEER \n THE ROLE: \nThe right engineer will drive the success of power IP (Intellectual Property) and features in AMD (Advanced Micro Devices) products through leadership & coordination, resolution of technical dependencies, and achievement of schedule commits. This is a high-visibility and widely multi-functional role, spanning pre-silicon architecture to post-silicon implementation & product delivery.   \n THE PERSON: \nYour curiosity will drive your learning and innovation to improve how we as a group, and an organization, can get better every day. Your peers will provide you a results-oriented and encouraging environment for your career growth, fueling your opportunity to be a part of Delighting Our Customers.   \n KEY RESPONSIBILITIES:   \nReceives assignments in the form of objectives with goals and the process by which to\nmeet those goals.\nProvides direction to employees according to established policies and management guidance.\nResponsible to drive AMD’s new GPU/System bring up, ROCm SW stack testing, quality and performance timeliness of result for a portion of project/process.\nManagement reviews work to measure meeting of objectives, process adherence and quality standards defined. \nParticipate in making more complex technical decisions for the product.\nImplement checks and balances independently to minimize the impact of mistakes.\nLead collaborative approaches with multiple teams.  \nCoach and Mentor staff to achieve their bussines goals and be a solution provider for their challenges.\nEstablishing and sharing best practices.\nLead by an example and promote the AMD Culture\n PREFERRED EXPERIENCE:   \nGood understanding of test lifecycle, QA process & terminology.\nStrong knowledge of Device drivers, graphics, multimedia, Codec.\nHandling of Test Execution infra in an automation lab with multiple systems.\nProven track record of every stages of QA and Defect life cycle.\nStrong understanding & Hands-on exp. with Linux OS internals, device manager.\nHands-on issue debugging skills, issue isolation with Linux kernel, driver module level.\nStrong understanding of PC hardware, SoC, Chipsets, Graphics cards, BIOS & VBIOS.\nUnderstanding machine learning, artificial intelligence, computer vision technologies is a plus.\nGood verbal & written communication skill is a must.\nGood attitude, result-driven & ability to make team deliver on next-gen technology.\nKnowledge of KVM/XEN/VMWARE is a plus\n10+ years of relevant work experience\n ACADEMIC CREDENTIALS: \nBachelor’s or Master's degree in Computer or Electrical Engineering or equivalent\n #LI-NR1\n\n\n\nBenefits offered are described:  AMD benefits at a glance.\n AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "job_link": "https://careers.amd.com/careers-home/jobs/70513?lang=en-us",
    "posted_date": "Not specified",
    "company": "AMD",
    "scraped_at": "2025-09-10T15:36:36.567921"
  }
]