[
  {
    "title": "IN-Business Pro",
    "location": "Various locations within India",
    "experience_required": "Not specified",
    "job_description": "Description\nEstablish and engage business customers by showcasing our technology and helping them discover how Apple and third-party products and solutions can enhance and support their businesses and enrich the lives of their customers and employees.\n\nProactively engage with and provide excellent customer service to Apple Retail Business customers by seeking to understand their needs, identifying ownership opportunities, presenting products and services, and educating them on relevant ways to buy.\n\nServe as the go-to expert on business solutions, and mentor the store team on business customer needs and solutions.\n\nCollaborate across the Apple Store in business sessions, briefings, workshops and events by identifying and recommending unique offerings to fit customers’ business needs.\n\nPartner with leadership and cross-functional partners to transition accounts in line with account engagement strategy to help create a seamless customer experience.\n\nStrategise, plan and forecast business performance through account management, pipeline building and opportunity management, using Customer Relationship Management (CRM) and other tools.\n\nMaintain process mastery of all Retail Business programmes and offerings to guarantee compliance with policies and procedures.\n\nPerform other tasks as needed, including but not limited to supporting customer-facing activities.\n\nContribute to an inclusive environment by respecting each other’s differences and having the curiosity to learn.\n\nDemonstrate Apple’s values of inclusion and diversity in daily activities.\n\n\nMinimum Qualifications\nYou should:\nBe available to work a schedule based on business needs that may include nights, weekends and public holidays in the retail store, and reliably attend work as scheduled, in line with local laws and subject to any approved accommodations.\nHave experience in retail or sales, or related work experience.\nHave extensive business solutions experience with Apple products and services.\nBe proficient in the local language, both written and spoken.\n\n\nPreferred Qualifications\nYou can:\nShow a track record of strong performance and results in technology or business solutions sales.\nCommunicate effectively and tailor your communication style to different audiences.\nWork in a fast-paced environment and make timely decisions, sometimes under tight deadlines and pressure.\nBuild rapport and work effectively with both internal and external customers, including business owners and executives.\nDemonstrate excellent organisational and process management skills, the ability to set priorities, and responsiveness to customer requests.\nDemonstrate excellent learning, negotiation, interpersonal and customer service skills.\nDraw from advanced Apple expertise on mobility adoption and business transformation with general knowledge of key SMB industries, technology trends and challenges.\nLearn, navigate and use new tools and systems.",
    "job_link": "https://jobs.apple.com/en-in/details/200314003/in-business-pro?team=APPST",
    "posted_date": "10 Sept 2025",
    "company": "Apple",
    "scraped_at": "2025-09-10T15:25:05.732827"
  },
  {
    "title": "IN-Business Expert",
    "location": "Various locations within India",
    "experience_required": "Not specified",
    "job_description": "Description\nEstablish and engage business customers by showcasing our technology and helping them discover how Apple and third-party products and solutions can enhance and support their businesses and enrich the lives of their customers and employees.\n\nProactively engage with and provide excellent customer service to Apple Retail Business customers by seeking to understand their needs, identifying ownership opportunities, presenting products and services, and educating them on relevant ways to buy.\n\nServe as the go-to expert and store team mentor on business customer needs and solutions.\n\nCollaborate across the Apple Store in business sessions, briefings, workshops and events by identifying and recommending unique offerings to fit customers’ business needs.\n\nLay a foundation for long-term relationships between local business customers and Apple Retail through proactive and informative engagement, exceptional service and tailored recommendations.\n\nMaintain accurate business customer contact and relationship information in our Customer Relationship Management app so Apple has accurate business intelligence. \n\nPerform other tasks as needed, including but not limited to providing customer service and support in other areas of the store.\n\nContribute to an inclusive environment by respecting each other’s differences and having the curiosity to learn.\n\nDemonstrate Apple’s values of inclusion and diversity in daily activities.\n\n\nMinimum Qualifications\nYou should:\nBe available to work a schedule based on business needs that may include nights, weekends and public holidays in the retail store, and reliably attend work as scheduled, in line with local laws and subject to any approved accommodations.\nHave experience in retail or sales, or related work experience.\nHave experience with Apple products, services and solutions.\nBe proficient in the local language, both written and spoken.\n\n\nPreferred Qualifications\nYou can:\nShow a track record of strong performance and results.\nCommunicate effectively and tailor your communication style to different audiences.\nWork in a fast-paced environment and make timely decisions, sometimes under tight deadlines and pressure.\nBuild rapport and work effectively with both internal and external customers, including business owners and executives.\nDemonstrate excellent organisational skills, the ability to set priorities and responsiveness to customer requests.\nDraw from a deep technical understanding of Apple products and services, both in store and online, along with expertise in business solutions and industry trends.\nLearn, navigate and use new tools and systems.",
    "job_link": "https://jobs.apple.com/en-in/details/200313970/in-business-expert?team=APPST",
    "posted_date": "10 Sept 2025",
    "company": "Apple",
    "scraped_at": "2025-09-10T15:25:07.130578"
  },
  {
    "title": "IN-Creative",
    "location": "Various locations within India",
    "experience_required": "Not specified",
    "job_description": "Description\nDeliver engaging Today at Apple sessions to encourage strong customer participation.\n\nGenerate excitement, engagement and enthusiasm among customers for Apple products and services through Today at Apple programming and events.\n\nCreate interactive customer experiences that help others get the most from the Apple ecosystem.\n\nDrive ownership by recommending solutions that meet customer needs.\n\nSupport customers in setting up their devices.\n\nDemonstrate familiarity with internal support resources available to customers who want to expand their technical knowledge.\n\nPerform other tasks as needed, including but not limited to supporting customer-facing activities on or off the sales floor.\n\nContribute to an inclusive environment by respecting each other’s differences and having the curiosity to learn.\n\nDemonstrate Apple’s values of inclusion and diversity in daily activities.\n\n\nMinimum Qualifications\nYou should:\nBe available to work a schedule based on business needs that may include nights, weekends and public holidays in the retail store, and reliably attend work as scheduled, in line with local laws and subject to any approved accommodations.\nHave experience in retail or sales, or related work experience.\nBe proficient in the local language, both written and spoken.\n\n\nPreferred Qualifications\nYou can:\nDraw from experience with teaching or public presentations and be comfortable presenting to live audiences.\nAdapt facilitation styles to meet the needs of the audience with many learning styles, sizes and settings.\nUnderstand the benefits of the Apple ecosystem and influence others to see those benefits.\nWork in a team environment, demonstrating shared responsibility and accountability with other team members.\nWork in a fast-paced environment and balance multiple priorities at the same time.",
    "job_link": "https://jobs.apple.com/en-in/details/200313991/in-creative?team=APPST",
    "posted_date": "10 Sept 2025",
    "company": "Apple",
    "scraped_at": "2025-09-10T15:25:08.514834"
  },
  {
    "title": "IN-Expert",
    "location": "Various locations within India",
    "experience_required": "Not specified",
    "job_description": "Description\nDemonstrate and sustain top-performing sales and service to Apple customers by seeking to understand their needs, identifying ownership opportunities, presenting products and services, and educating customers on relevant ways to buy products.\n\nBe knowledgeable about and proactively stay up to date on Apple’s products, services, purchase options and Product Zone sales processes. \n\nSupport your peers throughout the store as needed by sharing knowledge about Apple’s products, services and purchase options, and assist in offering ownership opportunities. \n\nMaintain accuracy and follow guidance.\n\nPerform other tasks as needed, including but not limited to providing customer service and support in other areas of the store. \n\nContribute to an inclusive environment by respecting each other’s differences and having the curiosity to learn.\n\nDemonstrate Apple’s values of inclusion and diversity in daily activities.\n\n\nMinimum Qualifications\nYou should:\nBe available to work a schedule based on business needs that may include nights, weekends and public holidays in the retail store, and reliably attend work as scheduled, in line with local laws and subject to any approved accommodations.\nHave experience in retail or sales, or related work experience.\nBe proficient in the local language, both written and spoken.\n\n\nPreferred Qualifications\nYou can:\nDemonstrate knowledge of Apple products and services.\nShow a track record of producing top-performing sales and customer experience results.\nPersonalise solutions based on customer needs, and effectively communicate them.\nSolve customer concerns using care, learning and presentation skills.\nWork in a fast-paced environment, often supporting multiple customers at the same time.\nLearn about and deepen your understanding of Apple products and services, and third-party products, to enhance the customer experience.\nSupport and educate the broader team by sharing knowledge, experiences and insights.",
    "job_link": "https://jobs.apple.com/en-in/details/200314010/in-expert?team=APPST",
    "posted_date": "10 Sept 2025",
    "company": "Apple",
    "scraped_at": "2025-09-10T15:25:09.946863"
  },
  {
    "title": "IN-Genius",
    "location": "Various locations within India",
    "experience_required": "Not specified",
    "job_description": "Description\nHave extensive knowledge and stay up to date on all Apple products, services and Genius Bar repair processes and procedures to support efficient and high-quality repairs.\n\nSupport customers having Apple product or software issues with care and empathy, using all tools and resources provided by Apple. \n\nTroubleshoot, diagnose, repair and resolve service concerns for Apple hardware and software. \n\nProvide excellent service to Apple customers by seeking to understand their needs, identifying ownership opportunities, presenting product and service recommendations, and educating customers on relevant ways to buy.\n\nWork with team leaders to identify recurring repair problems and other service concerns, and make sure that feedback is provided to Apple.\n\nUse extensive knowledge of hardware and software components to identify where technical concerns may originate from and educate others on the team.\n\nServe as a Mentor, resource and positive role model for Genius Bar team members. \n\nSupport leadership in providing timely resolution to customer escalations.\n\nPerform other tasks as needed, including but not limited to supporting customer-facing activities on or off the sales floor.\n\nContribute to an inclusive environment by respecting each other’s differences and having the curiosity to learn.\n\nDemonstrate Apple’s values of inclusion and diversity in daily activities.\n\n\nMinimum Qualifications\nYou should:\nBe available to work a schedule based on business needs that may include nights, weekends and public holidays in the retail store, and reliably attend work as scheduled, in line with local laws and subject to any approved accommodations.\nHave experience in retail or sales, or related work experience.\nHave the ability to visually inspect hardware and the fine motor skills to safely conduct repairs.\nHave experience troubleshooting hardware and software issues in a customer service environment.\nBe proficient in the local language, both written and spoken.\n\n\nPreferred Qualifications\nYou can:\nDemonstrate technical expertise of Apple products and services, including repairing devices.\nAnalyse problems and follow troubleshooting steps to identify the root cause of a technical issue.\nNavigate customer service issues with care and strong interpersonal skills.\nApply an action-oriented mindset and sense of motivation to do what’s best for the customer and Apple, often anticipating and adjusting for problems and roadblocks.\nWork in a fast-paced environment, often under tight deadlines and pressure, while supporting multiple customers or hardware repairs at the same time.\nCommunicate effectively and tailor your communication style to different audiences.\nCollaborate and motivate across the store and and among key partners to achieve individual and overall team goals.\nSupport and educate the broader team by sharing knowledge, experiences and insights.\nFrequently handle, lift and move merchandise safely.",
    "job_link": "https://jobs.apple.com/en-in/details/200314015/in-genius?team=APPST",
    "posted_date": "10 Sept 2025",
    "company": "Apple",
    "scraped_at": "2025-09-10T15:25:11.352358"
  },
  {
    "title": "IN-Operations Expert",
    "location": "Various locations within India",
    "experience_required": "Not specified",
    "job_description": "Description\nComplete inventory receiving, counting, returning and shipping tasks in compliance with Retail Inventory processes, and mentor and support team members in doing so.\n\nComplete product fulfilment tasks and deliver items from Runner requests to customers and team members in support of creating an exceptional customer experience. \n\nSupport Operations Specialists by sharing knowledge about the Retail Inventory processes. \n\nPromote understanding of inventory performance among all store team members and gather inventory data to aid with leadership decision-making. \n\nMonitor all inventory, including non-sellable product, in the inventory management system for accuracy and consistency, and to identify variance trends and understand their root causes. \n\nPerform other tasks as needed, including but not limited to supporting customer-facing activities.\n\nContribute to an inclusive environment by respecting each other’s differences and having the curiosity to learn.\n\nDemonstrate Apple’s values of inclusion and diversity in daily activities.\n\n\nMinimum Qualifications\nYou should:\nBe available to work a schedule based on business needs that may include nights, weekends and public holidays in the retail store, and reliably attend work as scheduled, in line with local laws and subject to any approved accommodations.\nBe able to lift and carry product to various locations within and near the store.\nHave experience in retail or sales, or related work experience.\nBe proficient in the local language, both written and spoken.\n\n\nPreferred Qualifications\nYou can:\nFocus on the customer experience, with an emphasis on serving both the internal and external customer.\nBe a self-starter who is detail-oriented, organised and can work without close supervision.\nPrioritise workload and meet deadlines in a fast-paced environment.\nWork in a team environment, demonstrating shared responsibility and accountability with other team members.\nDemonstrate effective problem-solving, analytical and communication skills.",
    "job_link": "https://jobs.apple.com/en-in/details/200314033/in-operations-expert?team=APPST",
    "posted_date": "10 Sept 2025",
    "company": "Apple",
    "scraped_at": "2025-09-10T15:25:12.723218"
  },
  {
    "title": "IN - Specialist",
    "location": "Various locations within India",
    "experience_required": "Not specified",
    "job_description": "Description\nDeliver excellent service to Apple customers by seeking to understand their needs, identifying ownership opportunities, presenting products and services, and educating customers on relevant ways to buy products.\n\nUnderstand and proactively stay up to date on Apple’s products, services, purchase options and Product Zone sales processes.\n\nSupport your peers throughout the store as needed by sharing knowledge about Apple’s products, services and purchase options, and assist in offering ownership opportunities.\n\nMaintain accuracy and follow guidance.\n\nPerform other tasks as needed, including but not limited to providing customer service and support in other areas of the store.\n\nContribute to an inclusive environment by respecting each other’s differences and having the curiosity to learn.\n\nDemonstrate Apple’s values of inclusion and diversity in daily activities.\n\n\nMinimum Qualifications\nYou should have availability to work a schedule based on business needs that may include nights, weekends and public holidays in the retail store, and reliably attend work as scheduled, in line with local laws and subject to any approved accommodations.\nYou should also be proficient in the local language, both written and spoken.\n\n\nPreferred Qualifications\nYou can:\nDemonstrate knowledge of Apple products and services.\nPersonalise solutions based on customer needs, and effectively communicate them.\nWork in a fast-paced environment, often supporting multiple customers at the same time.\nWork in a team environment, demonstrating shared responsibility and accountability with other team members.\nBe curious and open to learning from others and helping each other grow.\nLearn about and deepen your understanding of Apple products and services, and third-party products, to enhance the customer experience.\nBe trusted with sensitive or confidential information, keeping with Apple’s core values.",
    "job_link": "https://jobs.apple.com/en-in/details/200314117/in-specialist?team=APPST",
    "posted_date": "10 Sept 2025",
    "company": "Apple",
    "scraped_at": "2025-09-10T15:25:14.094416"
  },
  {
    "title": "IN-Technical Specialist",
    "location": "Various locations within India",
    "experience_required": "Not specified",
    "job_description": "Description\nDevelop knowledge and stay up to date on Apple products, services and Genius Bar repair processes to support efficient and high-quality repairs.\n\nSupport customers having Apple product or software issues with care and empathy, using all tools and resources provided by Apple.\n\nTroubleshoot, diagnose and resolve service concerns for select Apple hardware and software.\n\nWork with team leaders to identify recurring repair problems and other service concerns, and make sure that feedback is provided to Apple.\n\nProvide excellent service to Apple customers by seeking to understand their needs, identifying ownership opportunities, presenting product and service recommendations, and educating customers on relevant ways to buy.\n\nPerform other tasks as needed, including but not limited to supporting customer-facing activities on or off the sales floor.\n\nContribute to an inclusive environment by respecting each other’s differences and having the curiosity to learn.\n\nDemonstrate Apple’s values of inclusion and diversity in daily activities.\n\n\nMinimum Qualifications\nYou should have availability to work a schedule based on business needs that may include nights, weekends and public holidays in the retail store, and reliably attend work as scheduled, in line with local laws and subject to any approved accommodations.\nYou should also be proficient in the local language, both written and spoken.\n\n\nPreferred Qualifications\nYou can:\nDemonstrate technical expertise of Apple products and services.\nFollow troubleshooting steps to identify the root cause of a technical issue in a customer service environment.\nNavigate customer service issues with care and strong interpersonal skills.\nConsistently learn about and deepen your understanding of Apple products and services and third party products to enhance the customer experience.\nWork in a fast-paced environment and balance multiple tasks at the same time.\nWork well in a team environment, demonstrating shared responsibility and accountability with other team members.\nBe trusted with sensitive or confidential information, keeping with Apple’s core values.\nBe curious and open to learning from others and helping each other grow.",
    "job_link": "https://jobs.apple.com/en-in/details/200314122/in-technical-specialist?team=APPST",
    "posted_date": "10 Sept 2025",
    "company": "Apple",
    "scraped_at": "2025-09-10T15:25:15.533654"
  },
  {
    "title": "Lead ASC",
    "location": "India",
    "experience_required": "Not specified",
    "job_description": "Description\nLeading account level plans and managing sales operations and business objectives in the specified territory. We develop account plans that align Apple and the partner’s growth strategies to expand adoption of the Apple ecosystem.\n\n-  We effectively achieve plans by collaborating with Sales Operations, Authorised Reseller teams and strategic partners. Through working closely with our reseller’s sales force, we capture their hearts and minds for Apple.\n\n-  We use sales programs, enablement tools, and training to develop partner capabilities. We regularly assess and communicate the strength and efficiency of the partnership.\n\n-  We identify new business opportunities and support them through closure. We make certain that any client issues and/or concerns are raised and addressed.\n\n-  We share status, progress and facilitate sales activity across the reseller and Apple sales teams.\n\n\nMinimum Qualifications\n3+ years of work experience as field ASM\nExperience of account management and channel sales\nBachelor’s degree or equivalent experience in business administration / Sales\n\n\nPreferred Qualifications\nYou are an expert at communicating. And, you’re cool under pressure. You make the complex simple and you command an audience by bringing them along for the journey. You empower others to learn, to be curious and ultimately, share your passion for what you believe in.\nApple doesn’t cut corners, in products or in business. You bring the highest level of integrity, honesty, and accountability in all that you do, every single day. You are a trusted advisor who does what you say you’ll do – and always does what’s best for Apple.\nCustomer and partner needs can often be unique – but, you’re quick on your feet and connect and influence the right people both inside and outside of Apple. As a go to person with leadership, you are trusted and are comfortable in tough situations. You can settle disputes, negotiations and be responsible for the hard calls with minimal noise. You step up to conflicts and see them as opportunities to shine.\nBelieve that communication is key to Apple’s success. You’re a futurist and someone who actively talks and listens through endless possibilities – with customers and teammates alike. To ensure the most innovative ideas become a reality, you recognize perspectives, patiently listen to every detail and contribute to what is right, in order to move us forward.\nYou know yourself – you have strengths and areas of improvements, and are open to feedback. You relate well to all kinds of people – inside and outside the organization. When faced with a challenging opportunity, you know who to connect with and when. People know you as a true collaborator who knows what it takes to win.\nBuild competitive and breakthrough strategies that truly craft the future. You do this by asking why and why not, both stripping out what is not crucial and identifying what is. By doing so, you are able to see what’s ahead and identify trends that will be critical for growth.\nStrive for excellence in everything you do. Due to changing priorities, urgent customer needs, or a final push to meet a quarterly forecast, you face the daily challenge of where to focus your time and energy.",
    "job_link": "https://jobs.apple.com/en-in/details/200619845-1052/lead-asc?team=SLDEV",
    "posted_date": "09 Sept 2025",
    "company": "Apple",
    "scraped_at": "2025-09-10T15:25:17.020255"
  },
  {
    "title": "Materials Failure Analysis Engineer",
    "location": "India",
    "experience_required": "Not specified",
    "job_description": "Description\nWe're seeking a self-driven, energetic individual to join the Failure Analysis Team in Bangalore. The team is responsible for root cause failure analysis across all Apple Hardware products and advanced material characterisation for guiding design and process changes.\n\n\nMinimum Qualifications\nMasters degree in Materials Science, Mechanical Engineering, Chemical Engineering, Polymer Science or related discipline.\n5+ years of experience in materials characterization (ceramic, metal, polymer, composites) or failure analysis.\n2+ years of hands on experience in operating Focussed Ion Beam (FIB), Scanning Electron Microscopy) and Electron Back Scatter Diffraction (EBSD).\nGood understanding of mechanical behaviour of materials and structure property correlation.\nCreating comprehensive technical reports with crisp and concise data for presenting to cross-functional teams\nExcellent verbal and written communication and presentation skills.\nStrong interest in problem solving and can do attitude\nAbility to communicate complex technical information in a simple, concise manner\nAdaptability to fast changing environment and scope of work to meet business needs\nAbility to prioritise and juggle multiple high priority tasks at the same time\nWilling to collaborate closely across organisations\nEnjoys working in a fast-paced environment\n\n\nPreferred Qualifications\nPhD. in Materials Science, Mechanical Engineering, Chemical Engineering, Polymer Science or related discipline.\n10+ years of experience in materials characterization (ceramic, metal, polymer, composites) with at least 5+ years of experience in the semiconductor or consumer electronics industry.\n5+ years of hands on experience in operating Focussed Ion Beam (FIB), Scanning Electron Microscopy) and Electron Back Scatter Diffraction (EBSD).\nHands on experience in Transmission Electron Microscopy (TEM), (Scanning Transmission Electron Microscopy (STEM), XRD (X-ray Diffraction).\nExperience with FTIR and other spectroscopic techniques (Raman, UV-VIS, etc) is a plus.\nExperience in technically mentoring and managing Jr. Engineers and / or technicians.\nExpertise in mechanical behaviour of materials and structure property correlation.",
    "job_link": "https://jobs.apple.com/en-in/details/200619617-0321/materials-failure-analysis-engineer?team=HRDWR",
    "posted_date": "08 Sept 2025",
    "company": "Apple",
    "scraped_at": "2025-09-10T15:25:18.178943"
  },
  {
    "title": "Engineering Program Manager, Strategy & Implementation",
    "location": "India",
    "experience_required": "Not specified",
    "job_description": "Description\nIn this role, you will lead multi-functional collaboration and communication between Apple Internal project teams as well as Contract Manufacturers / External vendors. Work with Engineering Management, Design Teams, and Contract Manufacturers / Vendors to develop and certify products and module sub-systems for commercialisation. You will work closely with internal engineering teams, external laboratories, agencies, and certifying bodies to ensure our products meet the highest international and Apple-specified requirements.You will also ensure timely issue resolution and critical path management, driving day-to-day Engineering activities to meet program objectives.\n\n\nMinimum Qualifications\nB.S. or M.S. Engineering or Technical degree with 4+ years of experience in a related field or industry. Commensurate and relevant experience to be considered on case-by-case basis.\n10+ yrs of relevant hardware engineering experience in consumer electronics\n5+ yrs of project management experience in a fast-paced, demanding environment focused on product deliverables.\nExcellent organisational, interpersonal, presentation and communication skills.\nRespond to critical issues and short-fused tasking or investigations needed to resolve time-sensitive issues or emergent requirements\nDrive compliance and strategic-regulatory engagements and initiatives, particularly at a regional level; Work with technical experts to meet product goals.\nStrong proficiency in presentation applications and project management tools, not limited to Keynote, Powerpoint, Wrike, OmniPlan, MS-Project, Jira-Confluence, etc.\nAbility to operate effectively in an environment with rapid development cycles and constant change, while collaborating with multi-functional team to achieve project goals.\nUnderstanding of consumer electronics system architectures\nDeveloped skills for planning and executing development in advanced consumer electronics products\nProactive and highly self-motivated approach to work; exceptional critical thinking capabilities accompanied with strong attention to detail.\nAbility to travel (domestically and internationally) without restrictions, up 15 percent of the time.\n\n\nPreferred Qualifications\nExperience driving a highly diverse set of cross-functional team members and perspectives and yielding the best possible product solution\nExperience as primary point of contact with vendors and CM partners to provide clear direction and guidance to meet the program objectives.\nExperience working in fast-paced R&D centers and laboratories, or large-scale manufacturing plants.\nFamiliarity in, or experience with, international and/or regional product Environmental, EMI, Wireless, and Safety standards.\nForeign language proficiency, to include local Indian dialects, highly desirable.",
    "job_link": "https://jobs.apple.com/en-in/details/200619397-0321/engineering-program-manager-strategy-implementation?team=HRDWR",
    "posted_date": "08 Sept 2025",
    "company": "Apple",
    "scraped_at": "2025-09-10T15:25:19.370236"
  },
  {
    "title": "Senior Machine Learning Engineer / Senior Applied Scientist, Search & AI",
    "location": "India",
    "experience_required": "Not specified",
    "job_description": "Description\nOur team is responsible for delivering next-generation Search and Question Answering systems across Apple products including Siri, Safari, Spotlight, and more. This is your chance to shape how people get information by leveraging your Search and applied machine learning expertise along with robust software engineering skills.\n\n\nMinimum Qualifications\n8+ years experience in shipping Search and Q&A technologies and ML systems\nExcellent programming skills in mainstream programming languages such as C++, Python, Scala, and Go\nExperience delivering tooling and frameworks to evaluate individual components and end-to-end quality\nStrong analytical skills to systematically identify opportunities to improve search relevance and answer accuracy\nStrong written and verbal communication with the ability to articulate complex topics\nExcellent interpersonal skills and teamwork; demonstrated ability to connect and collaborate with others\nPassion for building phenomenal products and curiosity to learn\n\n\nPreferred Qualifications\nBackground in Search Relevance and Ranking, Question Answering systems, Query Understanding, Personalization or Recommendation systems, or data-informed decision-making\nHands-on experience in Retrieval Augmented Generation (RAG), including developing, evaluating and enhancing for both retrievers and generative LLMs\nExperience presenting plans, progress, and results or demos regularly and concisely\nMS or Ph.D in AI, Machine Learning, Information Retrieval, Computer Science, Statistics, or a related field",
    "job_link": "https://jobs.apple.com/en-in/details/200619406-0321/senior-machine-learning-engineer-senior-applied-scientist-search-ai?team=MLAI",
    "posted_date": "08 Sept 2025",
    "company": "Apple",
    "scraped_at": "2025-09-10T15:25:20.717732"
  },
  {
    "title": "Engineering Manager",
    "location": "India",
    "experience_required": "Not specified",
    "job_description": "Description\nYou will need to be hands-on and directly responsible for your own deliverables.\nYou will have to apply creative problem-solving approaches and advocate for innovative technical solutions\nYou will have to mentor and guide engineers, providing technical leadership and fostering professional growth. \nYou will lead an impactful team of individual contributors with responsibilities that span the entire software engineering lifecycle. \nYou will be accountable for your team's engineering decisions, delivery quality, and commitments. \nYou will build and maintain relationships with global leaders, peers, and partners in a matrix organizational structure\nYour portfolio will include critical platform services, each with multiple complex, fast-moving concurrent projects. \nYou will have to adapt to an environment where the business priorities may change rapidly. \nYou will collaborate with peers to build the technical roadmap that should be aligned with the business vision for the product. \nYou will plan work distribution and drive execution for your team. \nAchieving objectives and outcomes will require advocating for your ideas, solving problems creatively, and working smartly to cross the finish line.\n\n\nMinimum Qualifications\n10 years of hands-on experience in building and implementing web services solutions (preferably Java)\nOptional 1 year experience in managing and mentoring a team of impactful software engineers working on internet-scale products.\nBachelor's degree in Computer Science or related field\n10 years or relevant work experience\n\n\nPreferred Qualifications\nAbility to communicate effectively and work collaboratively with geographically distributed leaders, peers, and partners.\nSolid knowledge of software development process including agile methods and ability to adjust for what works best\nAbility to make priority and trade-off decisions based on sound Software Engineering & Architecture principles\nExcellent communication, leadership, and presentation skills",
    "job_link": "https://jobs.apple.com/en-in/details/200618640-1052/engineering-manager?team=SFTWR",
    "posted_date": "05 Sept 2025",
    "company": "Apple",
    "scraped_at": "2025-09-10T15:25:22.059753"
  },
  {
    "title": "IN-Manager",
    "location": "India",
    "experience_required": "Not specified",
    "job_description": "Description\nLead a team, developing and empowering each team member to learn, grow and achieve performance and developmental goals.\n\nAssist with recruiting, training, developing and retaining a diverse, high-performing team.\n\nActively participate in Floor Leadership by interacting with team members and customers throughout the store, modelling what good looks like, and making sure that business priorities are met and exceptional customer service is delivered.\n\nAddress customer and team member concerns and escalations, and partner with leadership and key business or People partners when appropriate.\n\nDrive business priorities and achieve store performance goals by planning and executing operational strategies within assigned functional areas.\n\nMaintain and uphold company policies and procedures, and protect all company assets, including confidential business, customer, team member and financial information.\nPerform other tasks as needed.\n\nContribute to an inclusive environment by respecting each other’s differences and having the curiosity to learn.\n\nDemonstrate Apple’s values of inclusion and diversity in daily activities.\n\nBe a role model for inclusive leadership behaviours and build, develop and retain diverse teams.\n\nTake action to create a safe, respectful and inclusive environment for all team members.\n\n\nMinimum Qualifications\nYou should:\nBe available to work a schedule based on business needs that may include nights, weekends and public holidays in the retail store, and reliably attend work as scheduled, in line with local laws and subject to any approved accommodations.\nBe proficient in the local language, both written and spoken.\nHave experience leading others in retail, sales or a related field.\n\n\nPreferred Qualifications\nYou can:\nExceed goals successfully, and persist in accomplishing objectives despite obstacles and setbacks.\nFollow through on commitments and establish mechanisms to encourage others to do the same.\nInstil trust within the team and operate with a high level of integrity.\nMake timely and sound decisions by asking questions and using analytics, experience and judgment.\nCommunicate with excellence, and tailor your communication style to different audiences.\nDevelop others through mentorship, coaching and effective feedback.\nProvide support and guide others through challenges while remaining calm in a fast-paced and constantly changing retail environment.\nResolve conflict and settle differences in productive ways.",
    "job_link": "https://jobs.apple.com/en-in/details/200583759-6957/in-manager?team=APPST",
    "posted_date": "04 Sept 2025",
    "company": "Apple",
    "scraped_at": "2025-09-10T15:25:23.624585"
  },
  {
    "title": "IN-Manager",
    "location": "India",
    "experience_required": "Not specified",
    "job_description": "Description\nLead a team, developing and empowering each team member to learn, grow and achieve performance and developmental goals.\n\nAssist with recruiting, training, developing and retaining a diverse, high-performing team.\n\nActively participate in Floor Leadership by interacting with team members and customers throughout the store, modelling what good looks like, and making sure that business priorities are met and exceptional customer service is delivered.\n\nAddress customer and team member concerns and escalations, and partner with leadership and key business or People partners when appropriate.\n\nDrive business priorities and achieve store performance goals by planning and executing operational strategies within assigned functional areas.\n\nMaintain and uphold company policies and procedures, and protect all company assets, including confidential business, customer, team member and financial information.\nPerform other tasks as needed.\n\nContribute to an inclusive environment by respecting each other’s differences and having the curiosity to learn.\n\nDemonstrate Apple’s values of inclusion and diversity in daily activities.\n\nBe a role model for inclusive leadership behaviours and build, develop and retain diverse teams.\n\nTake action to create a safe, respectful and inclusive environment for all team members.\n\n\nMinimum Qualifications\nYou should:\nBe available to work a schedule based on business needs that may include nights, weekends and public holidays in the retail store, and reliably attend work as scheduled, in line with local laws and subject to any approved accommodations.\nBe proficient in the local language, both written and spoken.\nHave experience leading others in retail, sales or a related field.\n\n\nPreferred Qualifications\nYou can:\nExceed goals successfully, and persist in accomplishing objectives despite obstacles and setbacks.\nFollow through on commitments and establish mechanisms to encourage others to do the same.\nInstil trust within the team and operate with a high level of integrity.\nMake timely and sound decisions by asking questions and using analytics, experience and judgment.\nCommunicate with excellence, and tailor your communication style to different audiences.\nDevelop others through mentorship, coaching and effective feedback.\nProvide support and guide others through challenges while remaining calm in a fast-paced and constantly changing retail environment.\nResolve conflict and settle differences in productive ways.",
    "job_link": "https://jobs.apple.com/en-in/details/200583759-5639/in-manager?team=APPST",
    "posted_date": "04 Sept 2025",
    "company": "Apple",
    "scraped_at": "2025-09-10T15:25:25.124711"
  },
  {
    "title": "SAP SD Functional Analyst",
    "location": "India",
    "experience_required": "Not specified",
    "job_description": "Description\nThe successful candidate will work with Apple business and technical teams across regions, as well as external business partners and other 3rd parties in other time zones. \n\nThis close collaboration is key to resolve, recommend and implement scalable & robust solutions, following Apple’s own software development and project management methodologies and guidelines.\n\n\nMinimum Qualifications\n5 Plus years' experience in OTC business process, SAP SD configuration, development,\nStrong expertise in S/4 HANA\nOne full life-cycle implementations of SAP OTC related projects for a global, multi-national corporation.\nBachelors Degree or equivalent experience in Computer Science, Management Information Systems or related field\n\n\nPreferred Qualifications\nExperience with Pricing Management, and E2E Integration with CRM, MM and FICO, Testing skills\nExtensive hands-on functional design and configuration experience, including detailed specifications for user exits, utilities, interfaces, reports, etc.\nStrong and outstanding written and verbal communication skills, including presentation skills to all levels of an organization and ability to operate in different time zones.\nAbility to work comfortably with incomplete information and deal with ambiguity in a fast paced, high-pressure environment and drives issues to root cause.\nExtensive experience working on SD interfaces\nPayment’s processing (including credit cards, loans, wire transfer, and mobile payments)\nThird party Sales processing\nGenAI experience a plus\nService Management, Repair process & Condition Contract Management\nExperience in APO\nAbap code walk through and debugging\nProblem solving - Logical approach to analyze issues",
    "job_link": "https://jobs.apple.com/en-in/details/200618907-1052/sap-sd-functional-analyst?team=SFTWR",
    "posted_date": "03 Sept 2025",
    "company": "Apple",
    "scraped_at": "2025-09-10T15:25:26.491679"
  },
  {
    "title": "IN-Manager",
    "location": "India",
    "experience_required": "Not specified",
    "job_description": "Description\nLead a team, developing and empowering each team member to learn, grow and achieve performance and developmental goals.\n\nAssist with recruiting, training, developing and retaining a diverse, high-performing team.\n\nActively participate in Floor Leadership by interacting with team members and customers throughout the store, modelling what good looks like, and making sure that business priorities are met and exceptional customer service is delivered.\n\nAddress customer and team member concerns and escalations, and partner with leadership and key business or People partners when appropriate.\n\nDrive business priorities and achieve store performance goals by planning and executing operational strategies within assigned functional areas.\n\nMaintain and uphold company policies and procedures, and protect all company assets, including confidential business, customer, team member and financial information.\nPerform other tasks as needed.\n\nContribute to an inclusive environment by respecting each other’s differences and having the curiosity to learn.\n\nDemonstrate Apple’s values of inclusion and diversity in daily activities.\n\nBe a role model for inclusive leadership behaviours and build, develop and retain diverse teams.\n\nTake action to create a safe, respectful and inclusive environment for all team members.\n\n\nMinimum Qualifications\nYou should:\nBe available to work a schedule based on business needs that may include nights, weekends and public holidays in the retail store, and reliably attend work as scheduled, in line with local laws and subject to any approved accommodations.\nBe proficient in the local language, both written and spoken.\nHave experience leading others in retail, sales or a related field.\n\n\nPreferred Qualifications\nYou can:\nExceed goals successfully, and persist in accomplishing objectives despite obstacles and setbacks.\nFollow through on commitments and establish mechanisms to encourage others to do the same.\nInstil trust within the team and operate with a high level of integrity.\nMake timely and sound decisions by asking questions and using analytics, experience and judgment.\nCommunicate with excellence, and tailor your communication style to different audiences.\nDevelop others through mentorship, coaching and effective feedback.\nProvide support and guide others through challenges while remaining calm in a fast-paced and constantly changing retail environment.\nResolve conflict and settle differences in productive ways.",
    "job_link": "https://jobs.apple.com/en-in/details/200618905-5640/in-manager?team=APPST",
    "posted_date": "03 Sept 2025",
    "company": "Apple",
    "scraped_at": "2025-09-10T15:25:28.219879"
  },
  {
    "title": "Junior Functional Tester",
    "location": "India",
    "experience_required": "Not specified",
    "job_description": "Description\nApple's Retail Store Applications team has immediate opening for a creative and motivated QA Engineer with excellent problem solving and social skills. We are looking for an organized critical thinker who will play a key role in driving the testing and coordination of QA effort across multiple applications\n\nThe ideal candidate will be responsible for leading and owning all testing activities for several of our systems. In addition to being the subject matter expert, this role’s core focus will be to work closely with cross-functional teams to ensure the business is successful in delivering high quality software to production consistently and expertly\n\nThis position calls for a self-motivated individual with strong technical prowess, communication skills, and a deep interest in Software Quality. You will be responsible for the functional testing of first-party applications; customer and employee facing. You will design and implement test plans, test cases, risk analysis, and integration testing across the Retail ecosystem. You will need to identify, escalate, and communicate key build quality issues, software defects, environmental issues and work towards resolution in partnership with Development, Operations and Project Management teams. Other responsibilities include end-to-end testing of small and large scale software features across multiple organizations, designing / reviewing tests and coverage plans in alignment with various testing teams, and leading a team of testers to successfully deliver quality product\n\n\nMinimum Qualifications\nProven experience in full QA life-cycle of major software products\n1-2 years of hands on experience in Software Test\nDeep understanding of QA methodologies and practices\nExperience in developing test plans, assessing risk, filing appropriate defects, and providing relevant data for test reporting\nStrong organizational and verbal/written communication skills\nAbility to triage problems, prioritize accordingly, and propose a resolution\nDetail oriented, analytical, and creative thinker with passion for quality processes\n\n\nPreferred Qualifications\nExperience working in Agile development environment\nProven track record to deliver high-quality work on tight schedules\nAbility to work in a fast-paced environment with frequent context switching\nHunger to learn and explore new technologies which will optimize the existing technologies\nSelf-motivated, independent and proactive\nOutstanding collaboration and organizational skills\nRetail experience as a nice to have",
    "job_link": "https://jobs.apple.com/en-in/details/200617141-0321/junior-functional-tester?team=SFTWR",
    "posted_date": "03 Sept 2025",
    "company": "Apple",
    "scraped_at": "2025-09-10T15:25:29.673197"
  },
  {
    "title": "Product RF Design Engineer India",
    "location": "India",
    "experience_required": "Not specified",
    "job_description": "Description\nProduct RF Design Engineers should have a broad-based knowledge in RF architecture, design, integration and manufacturing. They have deep theoretical and practical knowledge in one or more areas of electromagnetic theory, RF and Wireless circuit design, communication theory, and product design trade-off. They use electromagnetic and system simulation, hands-on prototyping, test and measurement to understand complex system and sub-system interactions, implications to product level design, and manufacturing trade-offs to enable mass production.\n\nProduct RF Design Engineers apply their expertise in all aspects of product design from concept, architecture definition, integration and prototyping to final production. They work closely with wireless and software architects, industrial designers, and product designers to guide and sculpt the product design with an eye towards optimising RF/Wireless functionality for the user. They work closely with manufacturing teams to support builds from the prototype phase to mass production.\n\n\nMinimum Qualifications\nBachelor's Electrical Engineering or equivalent\nExperience in working with antenna/RF design, wireless communications, EM, or circuits\nKnowledge of EM or RF hardware or antenna design\nKnowledge of integration of wireless technologies such as cellular, GPS, Wifi, and NFC into products\nKnowledge of RF schematic and PCB layout practices and guidelines\nExperience with production environment and statistical analysis\n\n\nPreferred Qualifications\nKnowledge of electromagnetic simulation tools\nHands-on experience with RF lab instrumentation\nAbility to debug desense issues and characterise noise sources\nExcellent interpersonal skills",
    "job_link": "https://jobs.apple.com/en-in/details/200618696-0321/product-rf-design-engineer-india?team=HRDWR",
    "posted_date": "02 Sept 2025",
    "company": "Apple",
    "scraped_at": "2025-09-10T15:25:31.035582"
  },
  {
    "title": "AIML - Data Operations Senior Team Lead",
    "location": "India",
    "experience_required": "Not specified",
    "job_description": "Description\nIn this role, you will be leading day-to-day operations to ensure organizational delivery of quality results. You’ll assist in the development of tools and reports to analyze and run the business, including workflow optimizations, workforce management, and volume predictions. You will help determine staffing requirements and participate in interviewing and hiring. You will effectively lead team performance with a focus on developing managers through one-on-ones, team meetings, coaching sessions and setting expectations.\n\nThis position comes with competitive pay, great benefits, eligibility to participate in our company stock plan, time off, an employee discount, and dedicated resources to support your ongoing growth and career development.\n\nApple is an equal opportunity employer that is committed to inclusion and diversity, and thus we treat all applicants fairly and equally. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities.\n\n\nMinimum Qualifications\nMinimum 8 to 10 years experience in people management, leading teams focused on consumer-facing applications, content or service\nAbility to empower and drive the team’s performance and be accountable for business priorities\nSelf-starter with forward thinking capability, strategic vision, and strong executional track record\nExperience defining and analyzing KPI’s, with the ability to identify trends and opportunities for innovation and improvement\nProven track record of collaborating cross-functionally to drive operational improvements\nStrong interpersonal skills, effective communication skills and the ability to influence and communicate across all levels of the organization\n\n\nPreferred Qualifications\nBachelor’s degree or equivalent experience\nManagement experience in a global organization\nExperience scaling operations in a fast-paced and dynamic environment\nExcellent verbal and written communication skills\nGood analytical skills to use data to optimize the organizational efficiency and drive strategic decision making",
    "job_link": "https://jobs.apple.com/en-in/details/200618666-1052/aiml-data-operations-senior-team-lead?team=MLAI",
    "posted_date": "02 Sept 2025",
    "company": "Apple",
    "scraped_at": "2025-09-10T15:25:32.702537"
  }
]