[
  {
    "title": "Software Engineer III, Google Cloud",
    "location": "India",
    "experience_required": "Mid",
    "job_description": "info_outline\nNote: By applying to this position you will have an opportunity to share your preferred working location from the following: Bengaluru, Karnataka, India; Hyderabad, Telangana, India.\n\nMinimum qualifications:\nBachelor’s degree or equivalent practical experience.\n2 years of experience with software development in one or more programming languages, or 1 year of experience with an advanced degree.\n\nPreferred qualifications:\nMaster's degree or PhD in Computer Science or related technical fields.\n2 years of experience with data structures or algorithms.\nExperience developing accessible technologies.\n\nAbout the job\nGoogle's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.\n\nWith your technical expertise you will manage project priorities, deadlines, and deliverables. You will design, develop, test, deploy, maintain, and enhance software solutions.\nGoogle Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.\n\nResponsibilities\nWrite product or system development code.\nParticipate in, or lead design reviews with peers and stakeholders to decide amongst available technologies.\nReview code developed by other developers and provide feedback to ensure best practices (e.g., style guidelines, checking code in, accuracy, testability, and efficiency).\nContribute to existing documentation or educational content and adapt content based on product/program updates and user feedback.\nTriage product or system issues and debug/track/resolve by analyzing the sources of issues and the impact on hardware, network, or service operations and quality.",
    "job_link": "https://www.google.com/about/careers/applications/jobs/results/74939955737961158-software-engineer-iii-google-cloud?location=India",
    "posted_date": "Not specified",
    "company": "Google",
    "scraped_at": "2025-09-10T22:05:31.589599"
  },
  {
    "title": "Senior Service Strategy Activation Lead",
    "location": "Google | Gurugram, Haryana, India",
    "experience_required": "Advanced",
    "job_description": "info_outline\nNote: By applying to this position you will have an opportunity to share your preferred working location from the following: Gurugram, Haryana, India; Hyderabad, Telangana, India.\n\nMinimum qualifications:\nBachelor's degree or equivalent practical experience.\n7 years of experience in program or project management, or managing cross-functional or cross-team projects.\n\nPreferred qualifications:\nCertification in Program Management.\nExperience in managing cross-functional or cross-team projects.\nExperience in stakeholder management.\nAbility to identify, collect, and analyze data to help selection making.\nExcellent communication skills for executive audiences to present information through presentations.\n\nAbout the job\nPeople Experience (PX) is the team at Google that delivers hire-to-retire experiences for Google employees. We deliver end-to-end global Human Resource (HR) processes. PX teams span Recruiting, Analytics and Planning, HR Operations, Vendor Management, Service Model Excellence, and Google employees and Market-level HR support.\n\nIn this role, you will be focused on transforming Google's People Operations service delivery. You will drive initiatives like Artificial Intelligence (AI)-powered transformations, Service Delivery Transformation through intelligent operations and measurement frameworks.\n\nResponsibilities\nManage the service model design strategy by data-motivated analysis and problem structuring. Advocate the Google employees and People Operations (POps) teams, build measurement frameworks to uncover unmet needs across the service journey.\nDevelop business cases with return on investments, impact assessments, and resource requirements to secure executive buy-in for service projects.\nCollaborate with product and technical teams to prioritize initiatives on technology roadmaps, ensuring development and implementation of service capabilities.\nLead cross-functional project teams to drive projects.",
    "job_link": "https://www.google.com/about/careers/applications/jobs/results/77773300364649158-senior-service-strategy-activation-lead?location=India",
    "posted_date": "Not specified",
    "company": "Google",
    "scraped_at": "2025-09-10T22:05:37.099953"
  },
  {
    "title": "Customer Engineer, Marketing Technology, Google Cloud",
    "location": "Google | Gurugram, Haryana, India",
    "experience_required": "Mid",
    "job_description": "info_outline\nNote: By applying to this position you will have an opportunity to share your preferred working location from the following: Gurugram, Haryana, India; Bengaluru, Karnataka, India.\n\nMinimum qualifications:\nBachelor's degree in Computer Science, or a related technical field, or equivalent practical experience.\n6 years of experience as a Technical Pre Sales Engineer in a Cloud Computing or a Marketing/Advertising software company in a customer-facing role.\nExperience in data and analytics with Cloud technologies like BigQuery, etc.\n\nPreferred qualifications:\nExperience with one or more public cloud platforms such as data and analytics platforms.\nExperience working in the marketing technology space including solutions for first-party data integration, customer data platform, single view of customer, churn, Lifetime Value (LTV) prediction and personalization.\nKnowledge of tools like Google analytics, Google marketing platform, Ads Data Hub or platforms from SFDC.\n\nAbout the job\nThe Google Cloud Platform team helps customers transform and build what's next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. Our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life. As part of an entrepreneurial team in this rapidly growing business, you will play a key role in understanding the needs of our customers and help shape the future of businesses of all sizes use technology to connect with customers, employees and partners.\n\nAs a Customer Engineer in Marketing Technology (MarTech), you will work with the Sales team to help customers and partners understand the value of Google Cloud's marketing technology solutions. You will solve business and technical issues using cloud-based tools for customer data, acquisition, engagement and growth. This role involves working with marketing platforms and may require travel to customer sites and events.Google Cloud accelerates organizations’ ability to digitally transform their business with the best infrastructure, platform, industry solutions and expertise. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology – all on the cleanest cloud in the industry. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.\n\nResponsibilities\nEngage with Chief Marketing Officer (CMOs), Chief Data Officer (CDOs), and Chief Information Officer (CIOs) in a trusted advisor capacity, leveraging expertise in MarTech to influence their approach of solving for business and campaign objectives like business, volume, awareness, leads, consideration, conversion, app installs, etc.\nInspire customers and peers to solve difficult marketing technology issues by applying solutions and technical expertise across marketing, data analytics and cloud while identifying key opportunities, objections and strategies to overcome technical blockers.\nCollaborate with customers to demonstrate and prototype first-party data integration using Google analytics, Google marketing platform, Google cloud based marketing tools, while guiding them towards scalable solutions.\nBuild accelerators for marketing technology solutions separately and collaborate with teams across data, analytics, Independent Sales Vendor (ISV), Google Ads, gTech, product management, and other specialists to drive implementation.",
    "job_link": "https://www.google.com/about/careers/applications/jobs/results/137288895187296966-customer-engineer-marketing-technology-google-cloud?location=India",
    "posted_date": "Not specified",
    "company": "Google",
    "scraped_at": "2025-09-10T22:05:42.569403"
  },
  {
    "title": "Investigations Specialist",
    "location": "India",
    "experience_required": "Mid",
    "job_description": "info_outline\nNote: By applying to this position you will have an opportunity to share your preferred working location from the following: Bengaluru, Karnataka, India; Gurgaon, Haryana, India; Hyderabad, Telangana, India.\n\nMinimum qualifications:\nBachelor's degree or equivalent practical experience in investigations.\n6 years of experience leading security investigations involving threat mitigation, investigative interviewing, or risk analysis that impact end users across multiple regions.\n4 years of experience analyzing, interpreting, and drawing solutions from data, as it relates security investigations, and reporting issues.\n\nPreferred qualifications:\n6 years of experience directly conducting legally compliant security investigations regarding threats, risks, or other physical/information security issues in APAC.\nExperience with formal investigative and interview training from a national or internationally recognized organization.\nKnowledge of local legal and regulatory requirements regarding corporate investigations across India.\nUnderstanding of insider threat types and trends.\nExcellent written and verbal communication skills.\n\nAbout the job\nSecurity is at the core of Google's design and development process: it is built into the DNA of our products. The same is true of our offices. You're an expert who shares our seriousness about security and our commitment to confidentiality. You'll collaborate with our Facilities Management team to create innovative security strategies, investigate breaches and create risk assessment plans for the future. You believe that providing effective security doesn't come at the expense of customer service - you will be our bodyguard (and our long lost pal).\nAs an Investigations Specialist on the Security Investigations and Assessments (SIA) team, you will be responsible for protecting Google's assets, people, and information from insider threats by conducting comprehensive investigations and proactive threat assessments. You will collaborate with cross-functional teams such as Security Operations, Security Engineering, Ethics and Compliance, People Operations (Human Resources) and others to ensure a safe and secure environment.\n\nWith significant experience in corporate investigations and threat assessments in APAC, you must be able to dynamically respond to a broad range of fast-paced security incidents. You will deliver holistic outcomes which will include objective, evidence based findings and recommendations to prevent, detect, deter and disrupt future issues.\n\nResponsibilities\nInvestigate a wide range of security incidents, including information and physical security policy violations. Gather and analyze evidence, conduct interviews, and present legally compliant objective findings and recommendations to stakeholders at all levels.\nAssess potential internal threats to Google and its employees. Evaluate identified risks and collaborate with relevant teams to implement strategies to mitigate potential harm.\nAssess existing processes to identify security vulnerabilities that could enable unethical behaviour, and develop comprehensive recommendations to enhance security protocols.\nWork collaboratively with various teams across Google to foster a culture of security awareness and preparedness. Build strong relationships with stakeholders to ensure effective communication and coordination of security efforts.",
    "job_link": "https://www.google.com/about/careers/applications/jobs/results/119106232744059590-investigations-specialist?location=India",
    "posted_date": "Not specified",
    "company": "Google",
    "scraped_at": "2025-09-10T22:05:48.073495"
  },
  {
    "title": "Program Manager, Legal Tooling Solutions Enablement",
    "location": "Google | Hyderabad, Telangana, India",
    "experience_required": "Advanced",
    "job_description": "info_outline\nNote: By applying to this position you will have an opportunity to share your preferred working location from the following: Hyderabad, Telangana, India; Gurugram, Haryana, India.\n\nMinimum qualifications:\nBachelor's degree or equivalent practical experience.\n8 years of experience in program or project management.\n8 years of experience in compliance, information security, IT audit, or risk management.\n\nPreferred qualifications:\n8 years of experience managing cross-functional or cross-team projects.\nExperience managing partner teams for delivery\nExperience managing software solutions, system implementations or product launches.\nExperience working in client solutions, service delivery, legal, risk or compliance.\n\nAbout the job\nA problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Program Manager at Google, you’ll lead complex, multi-disciplinary projects from start to finish — working with stakeholders to plan requirements, manage project schedules, identify risks, and communicate clearly with cross-functional partners across the company. Your projects will often span offices, time zones, and hemispheres. It's your job to coordinate the players and keep them up to date on progress and deadlines.\nAs a member of Solutions Enablement team you will work with cross-functional partner teams to identify top user pain points, translate them into business requirements, help prioritize participating business needs, align executive audiences to gain buy-in, and influence first-party and third-party product roadmaps to ensure governance across Google’s global suite of hardware and software products. You will balance Google’s legal, regulatory and compliance requirements with our users’ needs, and our company’s values. This role will be responsible for interfacing directly with product, engineering, executive leadership, and other cross-functional teams on a continuous basis and will allow you to build the future of the Global Affairs solutions and technology ecosystem.\n\nResponsibilities\nManage the full lifecycle of first-party and third-party tech and process implementations, from definition to delivery, collaborating with stakeholders, providers, and engineering teams.\nDefine and implement program design structures for efficient execution. Oversee supporting communication plans, program charters, tracking, and reporting to ensure outcomes.\nContribute to the development of tooling and solution goals, strategy and roadmap for Global Affairs stakeholders in partnership with engineering teams such as Legal and Risk Engineering, Privacy, Safety and Security.\nManage the client pipeline and align cross-functional stakeholders and partners towards opportunities and challenges, assisting leadership with continuous and annual planning exercises by clearly communicating business needs and priorities to secure engineering and business resource commitments.\nDesign, implement, and maintain system configurations, including rule configuration and contract template creation.",
    "job_link": "https://www.google.com/about/careers/applications/jobs/results/90038530813633222-program-manager-legal-tooling-solutions-enablement?location=India",
    "posted_date": "Not specified",
    "company": "Google",
    "scraped_at": "2025-09-10T22:05:53.548071"
  },
  {
    "title": "Data Scientist Product, Analytics, Insights and Measurement",
    "location": "India",
    "experience_required": "Mid",
    "job_description": "Minimum qualifications:\nBachelor's degree in Statistics, Mathematics, Data Science, Engineering, Physics, Economics, or a related quantitative field.\n5 years of work experience with analysis applications (extracting insights, performing statistical analysis, or solving business problems), and coding (Python, R, SQL) or 2 years work experience with a Master's degree.\n\nPreferred qualifications:\nMaster's degree in Statistics, Mathematics, Data Science, Engineering, Physics, Economics, or a related quantitative field.\nExperience with privacy-preserving technologies and data regulations.\nUnderstanding of digital advertising measurement concepts, including attribution modeling, incrementality testing, and media mix modeling (MMM).\n\nAbout the job\nHelp serve Google's worldwide user base of more than a billion people. Data Scientists provide quantitative support, market understanding and a strategic perspective to our partners throughout the organization. As a data-loving member of the team, you serve as an analytics expert for your partners, using numbers to help them make better decisions. You will weave stories with meaningful insight from data. You'll make critical recommendations for your fellow Googlers in Engineering and Product Management. You relish tallying up the numbers one minute and communicating your findings to a team leader the next.\n\nResponsibilities\nDriving business growth and help the team to empower advertisers with the tools and insights they need to navigate the evolving digital advertising landscape.\nDevelop quantitative models and frameworks to assess the business opportunity associated with improvements in attribution, incrementality testing, full-funnel measurement, and online-to-offline (O2O) measurement.\nQuantify the impact of data deprecation and regulatory changes on Ads performance. Develop metrics to track the effectiveness of the mitigation strategies and data durability initiatives.\nDefine success metrics for the efforts to create a unified measurement platform. Analyze the impact of closing measurement gaps and enhance the customer value proposition.",
    "job_link": "https://www.google.com/about/careers/applications/jobs/results/131668377503441606-data-scientist-product-analytics-insights-and-measurement?location=India",
    "posted_date": "Not specified",
    "company": "Google",
    "scraped_at": "2025-09-10T22:05:58.441527"
  },
  {
    "title": "Software Engineer III, Front End, Google Cloud",
    "location": "India",
    "experience_required": "Mid",
    "job_description": "Minimum qualifications:\nBachelor’s degree or equivalent practical experience.\n2 years of experience with software development in one or more programming languages, or 1 year of experience with an advanced degree.\n\nPreferred qualifications:\nMaster's degree or PhD in Computer Science or related technical field.\n2 years of experience with front-end frameworks, full-stack development, or API development.\n2 years of experience with data structures or algorithms in either an academic or industry setting.\nExperience developing accessible technologies.\n\nAbout the job\nGoogle's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.\nBehind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We keep our networks up and running, ensuring our users have the best and fastest experience possible.\n\nWith your technical expertise you will manage project priorities, deadlines, and deliverables. You will design, develop, test, deploy, maintain, and enhance software solutions.Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.\n\nResponsibilities\nWrite product or system development code.\nParticipate in, or lead design reviews with peers and stakeholders to decide amongst available technologies.\nReview code developed by other developers and provide feedback to ensure best practices (e.g., style guidelines, checking code in, accuracy, testability, and efficiency).\nContribute to existing documentation or educational content and adapt content based on product/program updates and user feedback.\nTriage product or system issues and debug/track/resolve by analyzing the sources of issues and the impact on hardware, network, or service operations and quality.",
    "job_link": "https://www.google.com/about/careers/applications/jobs/results/90871665348485830-software-engineer-iii-front-end-google-cloud?location=India",
    "posted_date": "Not specified",
    "company": "Google",
    "scraped_at": "2025-09-10T22:06:03.225963"
  },
  {
    "title": "Search Specialist, Ads Solutions",
    "location": "Google | Hyderabad, Telangana, India; +2 more",
    "experience_required": "Early",
    "job_description": "info_outline\nNote: By applying to this position you will have an opportunity to share your preferred working location from the following: Hyderabad, Telangana, India; Bengaluru, Karnataka, India; Gurgaon, Haryana, India.\n\nMinimum qualifications:\nBachelor's degree or equivalent practical experience.\n2 years of experience working with digital media or digital marketing/advertising solutions, implementing and measuring campaigns and providing client solutions.\n\nPreferred qualifications:\n3 years of experience with Internet products and technologies.\nExperience in data analysis with the ability to interpret datasets, identify trends, and translate findings into compelling narratives.\nKnowledge of apps platforms and products, the performance advertising market, or online ads landscape.\nAbility to collaborate cross-functionally with multiple teams and stakeholders while building relationships.\nExcellent project management skills with the ability to oversee multiple, simultaneous solutions supported by internal teams.\nExcellent business communication, negotiation, and influencing skills.\n\nAbout the job\ngTech Ads is responsible for all support and media and technical services for customers big and small across our entire Ad products stack. We help our customers get the most out of our Ad and Publisher products and guide them when they need help. We provide a range of services from enabling better self help and in-product support, to providing better support through interactions, setting up accounts and implementing ad campaigns, and providing media solutions for customers business and marketing needs and providing complex technical and measurement solutions along with consultative support for our large customers. These solutions range from bespoke and customized ones for our customers to scalable support for millions of customers worldwide. Based on the evolving needs of our ads customers, we partner with Sales, Product and Engineering teams within Google to develop better solutions, tools, and services to improve our products and enhance our client experience. As a cross-functional and global team, we ensure our customers get the best return on investment with Google and we remain a trusted partner.\nGoogle creates products and services that make the world a better place, and gTech’s role is to help bring them to life. Our teams of trusted advisors support customers globally. Our solutions are rooted in our technical skill, product expertise, and a thorough understanding of our customers’ complex needs. Whether the answer is a bespoke solution to solve a unique problem, or a new tool that can scale across Google, everything we do aims to ensure our customers benefit from the full potential of Google products.\n\nTo learn more about gTech, check out our video.\n\nResponsibilities\nAdvise key Google Ads clients, leveraging digital marketing and tech solutions to address business issues, collaborate as a thought partner, design media plans, and deliver technical solutions to achieve business goals.\nBuild relationships with external advertisers to deliver business outcomes through Google Ads, supporting planning, pitching, implementation, and optimization to boost product adoption and business growth.\nCollaborate with teams to drive growth plans for clients. Develop and apply insights of market and competitive environment for vertical and sub-verticals in solutions offered.\nDeliver consultative digital marketing solutions that address issues and enhance the customer's experience.\nAdvocate new product features, assist with adoption through setup, and provide technical guidance for infrastructure and data integration in Google Ads.",
    "job_link": "https://www.google.com/about/careers/applications/jobs/results/80773057190208198-search-specialist-ads-solutions?location=India",
    "posted_date": "Not specified",
    "company": "Google",
    "scraped_at": "2025-09-10T22:06:08.394526"
  },
  {
    "title": "Performance Lead, AI Agent",
    "location": "India",
    "experience_required": "Mid",
    "job_description": "Minimum qualifications:\nBachelor’s degree or equivalent practical experience.\n5 years of experience in an analytical role in customer operations or for an AI/ML product.\n5 years of experience in manipulating datasets and conducting analyses using SQL and Python.\nExperience creating executive communications (e.g., memos, slide decks, etc.) and presenting to non-technical/analytics audiences.\n\nPreferred qualifications:\nMaster’s degree in Business, Statistics, Mathematics, Economics, Engineering or Applied Science, or a related field.\nExperience in data analysis and modeling, specifically for AI/ML products, including forecasting and predictive modeling.\nExperience developing Key Performance Indicators (KPIs) and measurement frameworks for Large Language Models (LLMs) or other generative AI products.\nFamiliarity with experimental design (A/B testing) in the context of conversational AI or user-facing ML products.\nAbility to navigate ambiguity, manage projects, and drive issues to resolution.\nExcellent communication and presentation skills, with the ability to translate complex data into actionable insights.\n\nAbout the job\nOur goal is to ensure millions of creators and partners on YouTube have easy access to comprehensive support when and where they need it—a mission we are increasingly scaling through our AI agent—and to allow our creators’ voices to help shape product solutions.\n\nAs a Performance Lead focused on our AI Agent, you will drive data-driven decision-making to enhance the creator experience on YouTube. You will translate complex conversational and performance data into actionable insights, using strong problem solving skills to identify key drivers of AI performance and solve defined business problems in automated support. You will also develop new measurement frameworks to improve AI agent operations and address future needs.\n\nAs a thought leader, you will contribute to strategic planning, defining objectives, and developing novel KPIs specifically for LLM-based support, providing data-backed recommendations. You will conduct discrete modeling on new AI capabilities and prompt changes to forecast their impact on containment, user satisfaction, and escalations, using historical data to improve accuracy. You will influence teams and build cross-functional relationships to align resources and drive projects forward. You will communicate complex findings to both executive leadership and stakeholders, driving a deeper understanding of AI performance and opportunities.\n\nFinally, you will apply your expertise in business and data analytics, including statistical methods and research fluency, to design and evaluate A/B experiments on prompts and conversational flows, and conduct advanced analyses to optimize the end-to-end AI journey for creators across YouTube.At YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connect with one another in the process. Working at the intersection of cutting-edge technology and boundless creativity, we move at the speed of culture with a shared goal to show people the world. We explore new ideas, solve real problems, and have fun — and we do it all together.\n\nResponsibilities\nEstablish and manage the core KPIs for the AI Agent, including novel LLM-based metrics for quality and satisfaction.\nAnalyze performance and conversational data to identify optimization opportunities and provide data-driven recommendations that shape the product roadmap.\nStructure and interpret A/B tests on prompts and conversational flows, delivering clear impact analyses to guide AI development and improve performance.\nBuild forecasting models to project the impact of new AI capabilities and analyze pre- and post-launch data to measure their actual effect.\nTranslate analytical findings into clear, actionable insights for PSM, Engineering, and Leadership to drive the overall AI support strategy.",
    "job_link": "https://www.google.com/about/careers/applications/jobs/results/75238916398949062-performance-lead-ai-agent?location=India",
    "posted_date": "Not specified",
    "company": "Google",
    "scraped_at": "2025-09-10T22:06:13.374774"
  },
  {
    "title": "Data Analytics Apprenticeship, March 2026 Start (English)",
    "location": "Google | Hyderabad, Telangana, India; +3 more",
    "experience_required": "Not specified",
    "job_description": "info_outline\nPlease complete your application before September 14, 2025.\nThis role is not eligible for immigration sponsorship.\nELIGIBILITY CRITERIA:\nApplicants should not have been enrolled in any prior Government Apprenticeship programs.\nApplicants must have their Aadhaar number linked to their active mobile number and have a personal email ID. This is a mandatory requirement for registration and verification.\nPLEASE NOTE:\n\nApprentices are expected to complete the tenure of the respective program track to receive the certificate of completion in accordance with the program guidelines. This timeline ensures you get the full value of the program and are best prepared for future opportunities. Apprentices may apply for full-time employee (FTE) roles at Google only when they reach the final three months of the apprenticeship program.\n\nThis is a hybrid role, which requires regular in-person work at a Google office. Relocation is not supported during the apprenticeship. We are looking for candidates who are committed to successfully completing the entire program in a hybrid capacity.\nThe whole process will spread across 18 to 20 weeks, kindly be patient during the same.\nNote: By applying to this position you will have an opportunity to share your preferred working location from the following: Hyderabad, Telangana, India; Bengaluru, Karnataka, India; Gurgaon, Haryana, India; Mumbai, Maharashtra, India.\n\nMinimum qualifications:\nBachelor's degree or equivalent practical experience.\nLess than 1 year of experience in data analytics post graduation.\nExperience with using Google Workspace (e.g., Gmail, Chrome, Docs, Sheets, etc.) or similar applications.\nAbility to communicate in English fluently, to understand and execute instructions and learn via training documentations and presentations.\n\nPreferred qualifications:\nUnderstanding of SQL programming.\nKnowledge of data analysis or interest in working with numbers and patterns.\nAbility to navigate ambiguous tasks, find suitable solutions, and seek help/advice where appropriate.\nAbility to work independently and within a team framework.\nExcellent problem solving and critical thinking skills.\n\nAbout the job\nThe Google Data Analytics Apprenticeship is a learning and development program for 24 months, Apprentices are expected to join in person at their assigned in-office and participate full-time (~40 hours, weekly) throughout the program. The program includes work experience with a Google team supported by external training to empower those looking to start a career in Data Analytics. You will spend 20% of your time studying in a tailored training program and the rest of the time on projects with assigned Google teams to gain experience.\nSelected applicants will be matched to a team and will need to colocate, teams could be in Hyderabad, Gurugram, Mumbai or Bengaluru. Relocation assistance is provided for those who move +100km to their matched office location.\nApprenticeships are not a full-time permanent opportunity, the program is 24 months in duration. While the program is open to those who are interested in Data Analytics careers, recent graduates and individuals with work experience in other industries may apply.\n\nAt Google, we don’t just accept differences — we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products, and our community.\n\nApprenticeships contribute towards the development of digital skills by providing opportunities for work and study. They can serve as part of your journey to a meaningful career. During the program, apprentices get exposure to different areas and teams at Google, while receiving external training and developing their professional skills on the job.\n\nResponsibilities\nAssess data accurately and identify anomalies, create documents for knowledge sharing, and conduct custom analysis to uncover industry insights for Google's customers.\nSolve real life problems while developing and learning from working leaders. Use data to quantify the business impact of Google media recommendations.\nGain an understanding of the data lifecycle and how this translates to different business units solving issues with data. Gain practice with a range of tools and techniques, distilling down data for actionable takeaways and making recommendations across different business groups.\nDevelop knowledge of essential data analysis skills and use spreadsheets and programming languages to organize and analyze data.",
    "job_link": "https://www.google.com/about/careers/applications/jobs/results/110851089779040966-data-analytics-apprenticeship-march-2026-start-english?location=India",
    "posted_date": "Not specified",
    "company": "Google",
    "scraped_at": "2025-09-10T22:06:28.355085"
  },
  {
    "title": "Senior Software Engineer, Infrastructure, Core",
    "location": "India",
    "experience_required": "Mid",
    "job_description": "Minimum qualifications:\nBachelor’s degree or equivalent practical experience.\n5 years of experience with software development in one or more programming languages.\n3 years of experience testing, maintaining, or launching software products.\n3 years of experience developing large-scale infrastructure, distributed systems or networks, or experience with compute technologies, storage or hardware architecture.\n1 year of experience with software design and architecture.\n\nPreferred qualifications:\nMaster's degree or PhD in Computer Science or related technical field.\n5 years of experience with data structures/algorithms.\n1 year of experience in a technical leadership role.\nExperience developing accessible technologies.\n\nAbout the job\nGoogle's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.\nWith your technical expertise you will manage project priorities, deadlines, and deliverables. You will design, develop, test, deploy, maintain, and enhance software solutions.\nThe Core team builds the technical foundation behind Google’s flagship products. We are owners and advocates for the underlying design elements, developer platforms, product components, and infrastructure at Google. These are the essential building blocks for excellent, safe, and coherent experiences for our users and drive the pace of innovation for every developer. We look across Google’s products to build central solutions, break down technical barriers and strengthen existing systems. As the Core team, we have a mandate and a unique opportunity to impact important technical decisions across the company.\n\nResponsibilities\nWrite and test product or system development code.\nParticipate in, or lead design reviews with peers and stakeholders to decide amongst available technologies.\nReview code developed by other developers and provide feedback to ensure best practices (e.g., style guidelines, checking code in, accuracy, testability, and efficiency).\nContribute to existing documentation or educational content and adapt content based on product/program updates and user feedback.\nTriage product or system issues and debug/track/resolve by analyzing the sources of issues and the impact on hardware, network, or service operations and quality.",
    "job_link": "https://www.google.com/about/careers/applications/jobs/results/85973834967982790-senior-software-engineer-infrastructure-core?location=India",
    "posted_date": "Not specified",
    "company": "Google",
    "scraped_at": "2025-09-10T22:06:32.931578"
  },
  {
    "title": "Engineering Director, AI, HR Engineering",
    "location": "Google | Hyderabad, Telangana, India",
    "experience_required": "Not specified",
    "job_description": "Minimum qualifications:\nBachelor's degree in Electrical Engineering, Computer Science, relevant technical field (with an emphasis on machine learning/artificial intelligence), or equivalent practical experience.\n15 years of experience in software engineering, with 3 years of experience in a leadership role managing engineering teams (40+ engineers).\nExperience in leading the development and deployment of machine learning and AI-powered products in a production environment.\n\nPreferred qualifications:\nExperience in the HR domain or HR tech.\nExperience in strategic thinking with strong communication and problem-solving abilities.\nDeep understanding of various AI/ML techniques, including Natural Language Processing (NLP), computer vision, predictive analytics, recommendation systems, etc.\nFamiliarity with ML frameworks (e.g., TensorFlow, PyTorch, Scikit-learn).\nStrong background in MLOps, data engineering, and cloud platforms (GCP).\n\nAbout the job\nThe HR Engineering team builds people and culture solutions and powers the HR technology that underpins the entirety of a Googler’s career, from hire to retire.\nWe are seeking a highly accomplished and visionary Engineering Director to lead the technical strategy, prototype to development, and execution for our new \"AI Accelerator for HR Function\" team in Hyderabad. This is a foundational leadership role, pivotal in building and scaling a team of AI/ML engineers and Product Managers collaborating closely with UX to deliver innovative artificial intelligence solutions that revolutionize our HR operations.\nAt Corp Eng, we build world-leading business solutions that scale a more helpful Google for everyone. As Google’s IT organization, we provide end-to-end solutions for organizations across Google. We deliver the right tools, platforms, and experiences for all Googlers as they create more helpful products and services for everyone. In the simplest terms, we are Google for Googlers.\n\nResponsibilities\nDefine the AI Accelerator's technical vision and roadmap. Stay current with AI, HR Tech, and cloud technologies to ensure scalable, secure, and high-performance architectural solutions.\nRecruit and lead a team of AI/ML engineers and scientists. Mentor talent, foster a culture of innovation, optimize processes, and support team career growth.\nOversee the complete development lifecycle of AI products. Ensure  timely delivery of high-quality solutions that meet business needs while identifying and mitigating technical risks.\nWork with product managers to create technical specifications from business requirements. Partner with stakeholders and other teams to ensure seamless integration and adherence to enterprise standards.\nImplement monitoring for production AI models. Manage budgets, resource allocation, and project planning to drive operational efficiency.",
    "job_link": "https://www.google.com/about/careers/applications/jobs/results/87008173956702918-engineering-director-ai-hr-engineering?location=India",
    "posted_date": "Not specified",
    "company": "Google",
    "scraped_at": "2025-09-10T22:06:53.170288"
  },
  {
    "title": "Senior Cloud Security Consultant, Google Cloud Professional Services",
    "location": "Google | Mumbai, Maharashtra, India",
    "experience_required": "Mid",
    "job_description": "Minimum qualifications:\nBachelor’s degree in Computer Science, Engineering, or a related technical field, or equivalent practical experience.\n5 years of experience in delivering technical solutions for security, with 1 year of experience in Google Security Operations (SecOps).\nExperience architecting and developing secure cloud solutions.\nExperience in consulting, project management and ownership of security during execution.\n\nPreferred qualifications:\nExperience with SIEM and SOAR platforms such as Arcsight, QRadar, Splunk, Securonix, Sentinel or similar.\nExperience in Identity and Access Management, network security, data protection, cryptography, security governance, or cyber incident response programs.\nExperience working with cloud architecture across a broad set of enterprise use cases and creating end-to-end solution architectures.\nExperience in leading complex delivery programs, managing executive relationships, and the ability to navigate the intricacies of Security delivery/consulting in organizations with varied styles of working.\nExperience with industry compliance frameworks (e.g., PCI-DSS, ISO 27017/27018, GDPR, SOC).\nExcellent organizational, problem-solving, articulating and influencing skills.\n\nAbout the job\nThe Google Cloud Platform team helps customers transform and build what's next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. Our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life. As part of an entrepreneurial team in this rapidly growing business, you will play a key role in understanding the needs of our customers and help shape the future of businesses of all sizes use technology to connect with customers, employees and partners.\nAs a Senior Cloud Security Consultant, you will be responsible for strategic delivery helping our customers securely adopt Google Cloud services. You will span operational, tactical, and strategic levels as well as tasks that address difficult problems that businesses are facing when building out and improving their security posture on Google Cloud. You will showcase your communication skills and experience in security governance, security risk management, security operations, security architecture, building and modernizing security capabilities, or cyber incident response programs. You will have high visibility at the executive levels of customer organizations, including frequent interaction with CIOs, CISOs, CTOs, their staff, and Google Cloud Professional leadership.\nGoogle Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.\n\nResponsibilities\nProvide domain expertise in modernizing Security Operations using Google SecOps (SIEM and SOAR), cloud security, compliance, and enterprise security best practices.\nLead the scoping, structuring, planning, and execution of critical security engagements with Google Cloud customers.\nWork with customer development leads, client executives, and partners to manage and deliver successful cloud security architectures, serving as a cloud security and compliance subject matter expert and a trusted advisor to decision makers throughout the engagement.\nCreate and deliver security best practices recommendations, tutorials, blog articles, sample code and technical presentations, adapting to different levels of key business and technical stakeholders; and influence the Google Cloud technology roadmap by taking customer and partner feedback to our product engineering teams.\nTravel up to 40% of the time in-region for onsite delivery activities, as needed.",
    "job_link": "https://www.google.com/about/careers/applications/jobs/results/131121594880664262-senior-cloud-security-consultant-google-cloud-professional-services?location=India",
    "posted_date": "Not specified",
    "company": "Google",
    "scraped_at": "2025-09-10T22:06:57.719345"
  },
  {
    "title": "Application Engineering Manager, ServiceNow Platform",
    "location": "Google | Hyderabad, Telangana, India",
    "experience_required": "Advanced",
    "job_description": "Minimum qualifications:\nBachelor's degree in Computer Science, Management Information Systems, or other technical field, or equivalent practical experience.\n12 years of professional experience in software engineering or enterprise application development.\n3 years of experience in a technical leadership or engineering management role.\n\nPreferred qualifications:\nExperience in establishing a Center of Excellence (CoE) or a shared services platform in a large enterprise.\nExperience working with and managing implementation partners or professional services vendors.\nKnowledge of the ServiceNow platform, including experience with core IT Service Management/IT Asset Management (ITSM/ITAM) applications, the Configuration Management Database (CMDB), and platform scripting (JavaScript, GlideAPIs).\nUnderstanding of ITSM and ITAM processes and best practices (e.g., ITIL framework).\nAbility to perform technical in-depth, review code and configurations, and contribute directly to architectural decisions and also to articulate technical ideas to your team and executive stakeholders.\nExcellent communication skills.\n\nAbout the job\nYou lead all aspects of web development, requirements gathering, software development, testing, documentation, training, implementation, ongoing support, and maintenance for both in-house and customer-facing web applications. You will work closely with a cross-functional team of Googlers using UI and functional specs/prototypes as input. You are empowered to act like an owner, take action and innovate to meet user and customer needs. At Corp Eng, we build world-leading business solutions that scale a more helpful Google for everyone. As Google’s IT organization, we provide end-to-end solutions for organizations across Google. We deliver the right tools, platforms, and experiences for all Googlers as they create more helpful products and services for everyone. In the simplest terms, we are Google for Googlers.\n\nResponsibilities\nLead, manage, and provide technical mentorship to a growing team of Technical Leads and Software Engineers. You will be responsible for their coaching, career development.\nDrive engineering delivery by actively participating in technical design reviews, architectural discussions, and sprint planning. Remove roadblocks by digging into technical problems with your team and ensuring solutions are scalable.\nPartner with product managers and architects to define the strategy and technical roadmap for the Googler Technology and Engineering (GTE) ServiceNow Center of Excellence (CoE). You will be the engineering advocate for ITSM and ITAM.\nAct as the team's executive technical authority, guiding best practices in platform configuration, scripting, and integration.\nPlay a key role in building the team from the ground up by attracting, interviewing, and hiring technical talent who are excellent builders and collaborators.",
    "job_link": "https://www.google.com/about/careers/applications/jobs/results/82778043218567878-application-engineering-manager-servicenow-platform?location=India",
    "posted_date": "Not specified",
    "company": "Google",
    "scraped_at": "2025-09-10T22:07:02.268004"
  },
  {
    "title": "Senior Software Engineer",
    "location": "India",
    "experience_required": "Mid",
    "job_description": "Minimum qualifications:\nBachelor’s degree or equivalent practical experience.\n5 years of experience with software development in one or more programming languages.\n3 years of experience testing, maintaining, or launching software products, and 1 year of experience with software design and architecture.\n\nPreferred qualifications:\nExperience with large scale distributed systems.\nExperience with Cloud development (e.g., GCP, etc.).\nExperience partnering closely with Product Management and multiple engineering teams to achieve business goals.\nExperience working with Site Reliability Engineering (SRE) and carrying pager and supporting production environments.\nFamiliarity with control plane and managed service concepts, including scalability, availability, replication, workflows.\nFamiliarity with Google Cloud, Spanner, OnePlatform, Borg, Tenant Manager, GCE, etc.\n\nAbout the job\nGoogle's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.\nGoogle Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.\n\nResponsibilities\nProvide technical leadership to junior engineers focused on reliable, scalable, and secure Cloud SQL Control Plane and regionalization and modernization initiatives.\nOwn and drive the design, implementation, quality and rollout of key features that provide new managed databases experiences for our customers.\nWork with customer engineers on critical customer cases to fix underlying issues that cause customer's operational disruptions.\nAdapt and grow in an agile environment with support of leadership to continue prioritizing the most impactful things to work from a never ending list.\nCollaborate with Engineering Managers, Tech Leads (TLs), and Product Managers across various teams in Cloud SQL, in GCE, in Spanner, in Infrastructure, and Google at large to ensure alignment on direction, plans and execution.",
    "job_link": "https://www.google.com/about/careers/applications/jobs/results/139320694159614662-senior-software-engineer?location=India",
    "posted_date": "Not specified",
    "company": "Google",
    "scraped_at": "2025-09-10T22:07:06.859471"
  },
  {
    "title": "Business Systems Analyst, Anaplan",
    "location": "India",
    "experience_required": "Mid",
    "job_description": "Minimum qualifications:\nBachelor's degree or equivalent practical experience.\n5 years of experience in building integrated systems throughout the entire lifecycle (e.g., analyze, design, build, test, implement, and support).\n5 years of experience designing and implementing supply chain systems.\nExperience in Anaplan modeling and integration with other systems.\nExperience in Anaplan Model Builder with Business Planning.\nExperience in working with web or mobile application development, Unix/Linux environments, distributed and parallel systems, machine learning, information retrieval, networking, developing software systems or security software development.\n\nPreferred qualifications:\nCertification in Anaplan Solution Architecture or Master Anaplanner.\n5 years of experience in working with cross-functional teams to define requirements and manage technical projects.\nExperience with data analysis, Key Performance Indicator (KPIs) and reporting/dashboarding.\nExcellent technical process analysis skills to translate business requirements into solution design.\n\nAbout the job\nAt Google, we work at lightning speed. So when things get in the way of progress, the Business Systems Integration team steps in to remove those roadblocks. The team identifies time-consuming internal processes and then builds solutions that are reliable and scalable enough to work within the size and scope of the company. You listen to and translate Googler needs into high-level technical specifications, design and develop recommended systems and consult with Google executives to ensure smooth implementation. Whether battling large system processes or leveraging our homegrown suite of Google products for Googlers themselves, you help Googlers work faster and more efficiently.\n\nWith your technical expertise, you build business applications and influence the design of features that improve the reliability of our applications and systems. You also define the scope of technical projects and oversee execution.\nIt's an exciting time to join Google Cloud’s Go-To-Market team, leading the AI revolution for businesses worldwide. You’ll excel by leveraging Google's brand credibility—a legacy built on inventing foundational technologies and proven at scale. We’ll provide you with the world's most advanced AI portfolio, including frontier Gemini models, and the complete Vertex AI platform, helping you to solve business problems. We’re a collaborative culture providing direct access to DeepMind's engineering and research minds, empowering you to solve customer challenges. Join us to be the catalyst for our mission, drive customer success, and define the new cloud era—the market is yours.\n\nResponsibilities\nDesign, build, and maintain Anaplan models to support multiple aspects of business planning. Work with Data teams to reconcile differences with other systems.\nRefine and optimize Anaplan models to improve performance and accuracy across all regions.\nIntegrate data from multiple sources into Anaplan, ensuring data accuracy, consistency, and reliability.\nDocument models and processes. Test and validate Anaplan models for business requirements and performance.\nWork with Composite Service Operators (CSO), Business Compensation Operations, and Product Management to understand business requirements and translate them into Anaplan solutions. Work with Data Engineering and Business Operations teams to improve performance.",
    "job_link": "https://www.google.com/about/careers/applications/jobs/results/92678753510924998-business-systems-analyst-anaplan?location=India&page=2",
    "posted_date": "Not specified",
    "company": "Google",
    "scraped_at": "2025-09-10T22:07:25.780961"
  },
  {
    "title": "Scaled Delivery Manager, Ads Social Engagement",
    "location": "Google | Hyderabad, Telangana, India",
    "experience_required": "Mid",
    "job_description": "info_outline\nNote: By applying to this position you will have an opportunity to share your preferred working location from the following: Hyderabad, Telangana, India; Gurugram, Haryana, India.\n\nMinimum qualifications:\nBachelor's degree in Business, Logistics, Operations, Engineering, a related field, or equivalent practical experience.\n5 years of experience working with, supervising, and managing third party logistics relationships.\n\nPreferred qualifications:\nMBA or Master's degree.\n5 years of experience analyzing data and generating insights for the business decisions.\nExperience in Data center logistics.\nUnderstanding of Machine Learning and Artificial Intelligence applications in support operations.\n\nAbout the job\ngTech Ads is responsible for all support and media and technical services for customers big and small across our entire Ad products stack. We help our customers get the most out of our Ad and Publisher products and guide them when they need help. We provide a range of services from enabling better self help and in-product support, to providing better support through interactions, setting up accounts and implementing ad campaigns, and providing media solutions for customers business and marketing needs and providing complex technical and measurement solutions along with consultative support for our large customers. These solutions range from bespoke and customized ones for our customers to scalable support for millions of customers worldwide. Based on the evolving needs of our ads customers, we partner with Sales, Product and Engineering teams within Google to develop better solutions, tools, and services to improve our products and enhance our client experience. As a cross-functional and global team, we ensure our customers get the best return on investment with Google and we remain a trusted partner.\nBehind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We keep our networks up and running, ensuring our users have the best and fastest experience possible.\n\nResponsibilities\nMaintain an understanding of social media community guidelines and etiquette, ensuring all interactions are compliant.\nEscalate critical issues or negative sentiment identified on social media platforms to appropriate internal stakeholders, including the Marketing team.\nTrack and report on support activities and user sentiment within the social media platform. Collaborate with internal teams to stay informed on product developments, new features, and other changes related to Ads.\nEnsure issue ownership, coordination and communication across teams for resolution, minimizing negative user and organizational impact. Track issues/escalations throughout the life-cycle of an incident.\nUtilize the prioritization framework to manage key issues. Participate in fostering a positive and helpful online community around the Ads products/services.",
    "job_link": "https://www.google.com/about/careers/applications/jobs/results/104597885831520966-scaled-delivery-manager-ads-social-engagement?location=India&page=2",
    "posted_date": "Not specified",
    "company": "Google",
    "scraped_at": "2025-09-10T22:07:30.427814"
  },
  {
    "title": "Business Systems Analyst, Supply Chain Systems",
    "location": "India",
    "experience_required": "Mid",
    "job_description": "Minimum qualifications:\nBachelor's degree or equivalent practical experience.\n8 years of experience in designing and implementing supply chain functions.\nExperience in working with database technologies, including both standalone and cloud-based databases, for data extraction and quantitative data manipulation.\nExperience in defining and implementing standard procedures for solution design, solution development, systems configuration, test documentation/execution, issue identification, and resolution.\n\nPreferred qualifications:\n12 years of experience in designing and implementing supply chain functions.\nExperience with SAP ERP, supply chain management, contract manufacturing, sustainability, data analysis, data integration, and collaboration.\nUnderstanding of software development, build, and deployment processes, with the ability to work closely with developers to translate business requirements into technical solutions.\nAbility to architect innovative solutions that automate and scale business systems, and provide direction for architecture, design, build, and support activities, focusing on excellence, performance, and security.\n\nAbout the job\nAt Google, we work at lightning speed. So when things get in the way of progress, the Business Systems Integration team steps in to remove those roadblocks. The team identifies time-consuming internal processes and then builds solutions that are reliable and scalable enough to work within the size and scope of the company. You listen to and translate Googler needs into high-level technical specifications, design and develop recommended systems and consult with Google executives to ensure smooth implementation. Whether battling large system processes or leveraging our homegrown suite of Google products for Googlers themselves, you help Googlers work faster and more efficiently.\n\nResponsibilities\nIntegrate and scale both Google-designed systems and third-party available products for Alphabet. Lead large-scale implementation involving complex workflows and system architectures.\nCollaborate with internal business teams to architect and lead the system direction.\nDefine best practices for solution design, development, system configuration, test documentation, execution, issue identification, and resolution.\nArchitect solutions to automate and scale business systems, while providing direction for architecture, design, build, and support activities required for enterprise software platforms.\nEnsure the team delivers with quality and predictability.",
    "job_link": "https://www.google.com/about/careers/applications/jobs/results/114349394328724166-business-systems-analyst-supply-chain-systems?location=India&page=2",
    "posted_date": "Not specified",
    "company": "Google",
    "scraped_at": "2025-09-10T22:07:35.106523"
  },
  {
    "title": "Staff Critical Incident Manager, Google Cloud",
    "location": "Google | Pune, Maharashtra, India",
    "experience_required": "Advanced",
    "job_description": "Minimum qualifications:\nBachelor's degree in Computer Science, a related technical field, or equivalent practical experience.\n10 years of experience in managing critical incidents.\n3 years of experience in providing technical or infrastructure support.\nExperience in an operational and leadership role in a cloud services delivery environment.\n\nPreferred qualifications:\nCertification in ITIL v4 or Project Management.\nExperience in supporting and managing technical environments within a multi-tenant cloud environment.\nExperience with industry tools (e.g., SalesForce, Google Workspace).\nKnowledge of leadership in engineering, operations, or executive support roles.\nAbility to influence momentum of incident response across multiple teams.\nAbility to work in a changing environment with prioritization and time management.\n\nAbout the job\nThe Google Cloud Platform team helps customers transform and build what's next for their business — all with technology built in the cloud. Our products are developed for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. Our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life. As part of an entrepreneurial team in this rapidly growing business, you will play a key role in understanding the needs of our customers and help shape the future of businesses of all sizes use technology to connect with customers, employees and partners.\nAs a Staff Critical Incident Manager, you will execute existing, critical incident response operations. You will manage customer impacting incidents and executive level customer escalations. You will also collaborate and partner with the entire Google Cloud organization to drive resolution. You will partner and collaborate with Infrastructure, Engineering, Technical Support, Product Owners, Customer Success and Business Leadership to ensure delivery of a support experience for customers. You will ensure transparent communication that drives internal/external customer satisfaction.\nGoogle Cloud accelerates organizations’ ability to digitally transform their business with the best infrastructure, platform, industry solutions and expertise. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology – all on the cleanest cloud in the industry. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.\n\nResponsibilities\nLead incident response efforts in a fast-paced, 24/7 on-call environment, ensuring clear and transparent communications with internal teams and customers.\nCoordinate and manage escalations from executives or key customers, driving cross-functional collaboration to deliver fast and effective resolutions.\nAct as an Incident Response thought leader, contributing to process improvements and implementing automation for continuous optimization of incident management workflows.\nFacilitate post-incident reviews, using insights to recommend enhancements to incident response strategies and ensure alignment across all teams.\nLead complex projects to address ambiguity in operations, overcoming obstacles to deliver impact outcomes for both customers and Google.",
    "job_link": "https://www.google.com/about/careers/applications/jobs/results/95064398464197318-staff-critical-incident-manager-google-cloud?location=India&page=2",
    "posted_date": "Not specified",
    "company": "Google",
    "scraped_at": "2025-09-10T22:07:39.830832"
  },
  {
    "title": "Staff Software Engineer, Technical Infrastructure",
    "location": "Google | Hyderabad, Telangana, India",
    "experience_required": "Not specified",
    "job_description": "Minimum qualifications:\nBachelor's degree or equivalent practical experience.\n8 years of experience in software development.\n5 years of experience testing, and launching software products.\n3 years of experience with software design and architecture.\n\nPreferred qualifications:\nMaster’s degree or PhD in Engineering, Computer Science, or a related technical field.\n8 years of experience with data structures/algorithms.\n3 years of experience in a technical leadership role leading project teams and setting technical direction.\n3 years of experience working in a complex, matrixed organization involving cross-functional, or cross-business projects.\n\nAbout the job\nGoogle's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.\n\nWith your technical expertise you will manage project priorities, deadlines, and deliverables. You will design, develop, test, deploy, maintain, and enhance software solutions.\nBehind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We keep our networks up and running, ensuring our users have the best and fastest experience possible.\n\nResponsibilities\nProvide technical leadership on high-impact projects.\nInfluence and coach a distributed team of engineers.\nFacilitate alignment and clarity across teams on goals, outcomes, and timelines.\nManage project priorities, deadlines, and deliverables.\nDesign, develop, test, deploy, maintain, and enhance large scale software solutions.",
    "job_link": "https://www.google.com/about/careers/applications/jobs/results/78008566861963974-staff-software-engineer-technical-infrastructure?location=India&page=2",
    "posted_date": "Not specified",
    "company": "Google",
    "scraped_at": "2025-09-10T22:08:12.571262"
  },
  {
    "title": "Security Engineer, Android Malware",
    "location": "India",
    "experience_required": "Not specified",
    "job_description": "Job description available on company website",
    "job_link": "https://www.google.com/about/careers/applications/jobs/results/143196206091117254-security-engineer-android-malware?location=India&page=2",
    "posted_date": "Not specified",
    "company": "Google",
    "scraped_at": "2025-09-10T22:08:52.066329"
  },
  {
    "title": "Digital Marketing Strategist",
    "location": "Google | Hyderabad, Telangana, India",
    "experience_required": "Not specified",
    "job_description": "Job description available on company website",
    "job_link": "https://www.google.com/about/careers/applications/jobs/results/119785188690404038-digital-marketing-strategist?location=India&page=2",
    "posted_date": "Not specified",
    "company": "Google",
    "scraped_at": "2025-09-10T22:08:56.585438"
  },
  {
    "title": "Program Manager, Global Business Applied AI, SPARK",
    "location": "Google | Hyderabad, Telangana, India",
    "experience_required": "Not specified",
    "job_description": "Job description available on company website",
    "job_link": "https://www.google.com/about/careers/applications/jobs/results/137709548579234502-program-manager-global-business-applied-ai-spark?location=India&page=2",
    "posted_date": "Not specified",
    "company": "Google",
    "scraped_at": "2025-09-10T22:09:08.128254"
  },
  {
    "title": "Staff Front-end CAD and Methodology Engineer, Silicon",
    "location": "India",
    "experience_required": "Not specified",
    "job_description": "Job description available on company website",
    "job_link": "https://www.google.com/about/careers/applications/jobs/results/102735169252664006-staff-frontend-cad-and-methodology-engineer-silicon?location=India&page=2",
    "posted_date": "Not specified",
    "company": "Google",
    "scraped_at": "2025-09-10T22:09:13.562384"
  },
  {
    "title": "Staff Software Engineer, App Engine, Serverless",
    "location": "India",
    "experience_required": "Not specified",
    "job_description": "Job description available on company website",
    "job_link": "https://www.google.com/about/careers/applications/jobs/results/75982118613590726-staff-software-engineer-app-engine-serverless?location=India&page=2",
    "posted_date": "Not specified",
    "company": "Google",
    "scraped_at": "2025-09-10T22:09:20.776480"
  },
  {
    "title": "Staff Software Engineer, AIR, Platform and Devices",
    "location": "India",
    "experience_required": "Not specified",
    "job_description": "Job description available on company website",
    "job_link": "https://www.google.com/about/careers/applications/jobs/results/140559186365686470-staff-software-engineer-air-platform-and-devices?location=India&page=2",
    "posted_date": "Not specified",
    "company": "Google",
    "scraped_at": "2025-09-10T22:09:23.294357"
  },
  {
    "title": "Software Engineer, AI/ML, AI Innovation and Research",
    "location": "India",
    "experience_required": "Not specified",
    "job_description": "Job description available on company website",
    "job_link": "https://www.google.com/about/careers/applications/jobs/results/113195395672089286-software-engineer-aiml-ai-innovation-and-research?location=India&page=2",
    "posted_date": "Not specified",
    "company": "Google",
    "scraped_at": "2025-09-10T22:09:25.955318"
  },
  {
    "title": "Program Manager, Admin Console, Google Workspace",
    "location": "India",
    "experience_required": "Not specified",
    "job_description": "Job description available on company website",
    "job_link": "https://www.google.com/about/careers/applications/jobs/results/140967967394276038-program-manager-admin-console-google-workspace?location=India&page=2",
    "posted_date": "Not specified",
    "company": "Google",
    "scraped_at": "2025-09-10T22:09:32.285547"
  },
  {
    "title": "Head of Music Partnerships, Artist and Label Relations",
    "location": "Google | Mumbai, Maharashtra, India",
    "experience_required": "Not specified",
    "job_description": "Job description available on company website",
    "job_link": "https://www.google.com/about/careers/applications/jobs/results/87139927178781382-head-of-music-partnerships-artist-and-label-relations?location=India&page=2",
    "posted_date": "Not specified",
    "company": "Google",
    "scraped_at": "2025-09-10T22:09:35.366663"
  },
  {
    "title": "Technical Program Manager, Risk and Compliance Engineering",
    "location": "India",
    "experience_required": "Not specified",
    "job_description": "Job description available on company website",
    "job_link": "https://www.google.com/about/careers/applications/jobs/results/86647117262529222-technical-program-manager-risk-and-compliance-engineering?location=India&page=2",
    "posted_date": "Not specified",
    "company": "Google",
    "scraped_at": "2025-09-10T22:09:39.271216"
  }
]