[
  {
    "title": "Software Engineer, Infrastructure",
    "location": "Sunnyvale, CA •",
    "experience_required": "Not specified",
    "job_description": "Meta is seeking talented engineers to join our teams in building cutting-edge products that connect billions of people around the world. As a member of our team, you will have the opportunity to work on complex technical problems, build new features, and improve existing products across various platforms, including mobile devices and web applications. Our teams are constantly pushing the boundaries of user experience, and we're looking for passionate individuals who can help us advance the way people connect globally. If you're interested in joining a world-class team of industry veterans and working on exciting projects that have a significant impact, we encourage you to apply.\nSoftware Engineer, Infrastructure Responsibilities\nCollaborate with cross-functional teams (product, design, operations, infrastructure) to build innovative application experiences\nImplement custom user interfaces using latest programming techniques and technologies\nDevelop reusable software components for interfacing with back-end platforms\nAnalyze and optimize code for quality, efficiency, and performance\nLead complex technical or product efforts and provide technical guidance to peers\nArchitect efficient and scalable systems that drive complex applications\nIdentify and resolve performance and scalability issues\nWork on a variety of coding languages and technologies\nEstablish ownership of components, features, or systems with expert end-to-end understanding\nMinimum Qualifications\nBachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience\n6+ years of programming experience in a relevant language or 3+ years of experience + PhD\nTrack record of setting technical direction for a team, driving consensus and successful cross-functional partnerships\nExperience building maintainable and testable code bases, including API design and unit testing techniques\nPreferred Qualifications\n6+ years relevant experience building large-scale infrastructure applications or similar experience\nExperience with scripting languages such as Python, Javascript or Hack\nExperience designing, analyzing and improving efficiency, scalability, and stability of various system resources\nExperience owning a component, feature or system\nExperience building and shipping high quality work and achieving high reliability\nExperience improving quality through thoughtful code reviews, appropriate testing, proper rollout, monitoring, and proactive changes\nExposure to architectural patterns of large scale software applications\nExperience in programming languages such as C, C++, Java\nFor those who live in or expect to work from California if hired for this position, please click here for additional information.\nAbout Meta\nMeta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.\n\n$70.67/hour to $208,000/year + bonus + equity + benefits\n\nIndividual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta. \n\nEqual Employment Opportunity\nMeta is proud to be an Equal Employment Opportunity employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, reproductive health decisions, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information, political views or activity, or other applicable legally protected characteristics. You may view our Equal Employment Opportunity notice here.\nMeta is committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or an accommodation due to a disability, fill out the Accommodations request form.",
    "job_link": "https://www.metacareers.com/jobs/677160418622314",
    "posted_date": "Not specified",
    "company": "Meta",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-10T22:29:12.165357"
=======
    "scraped_at": "2025-09-11T02:22:55.799404"
>>>>>>> Stashed changes
  },
  {
    "title": "Product Design Engineer",
    "location": "Sunnyvale, CA •",
    "experience_required": "Not specified",
    "job_description": "At Reality Labs we aim to bring together cross-disciplinary minds in one place to deliver on our mission: build tools that help people feel connected, anytime, anywhere. As a Product Design Engineer, you will take a critical role in developing hardware systems for VR, AR, or New Technology Initiatives. You will become part of a team exploring developing concepts through prototyping and into mass-production consumer electronics. You will work as part of a cross functional team requiring collaboration in domains other than mechanical engineering. Our teams support mechanical engineering fundamentals, prototyping skills, CAD fluency, manufacturing process knowledge, and experience designing consumer electronics.\nProduct Design Engineer Responsibilities\nLead the mechanical design for a particular component, feature or system while having end-to-end product development understanding\nContribute to mechanical solutions as part of a highly cross-functional team\nModel, build, test, and refine prototypes and characterization test systems\nWork across the full product development cycle, from concept inception to shipping product\nCollaborate and manage work with Asia-based Supply Chain\nPush state-of-the-art technologies and approaches to solving complex mechanical problems while working with cross functional technical teams\nTravel to external vendors up to 20%\nMinimum Qualifications\nBS in Mechanical Engineering\n8+ years of industry experience in mechanical design\nExperience in Design for Manufacturability (DFM), Design for Assembly (DFA), statistical tolerance analysis techniques, functional dimensioning, geometric tolerancing, and 3D/2D CAD\nWorking knowledge in material properties, such as plastics, metal, adhesive, glass, etc\nTesting and analysis experience (FEA, Simulation, Design of Experiments, etc.)\nKnowledge of high-volume manufacturing techniques (stamping, machining, injection molding, etc.)\nPreferred Qualifications\n10+ years of product design and development experience of handheld and/or wearable electronics for high volume manufacturing, including full systems ownership\nMS or PhD in Mechanical Engineering\nExperience designing handheld and wearable electronics for high volume manufacturing\nExperience with NX\nExperience with products cosmetic surface treatments and interfacing with industrial design teams\nMandarin and/or Cantonese language skills\nExperience designing for human factors\nFor those who live in or expect to work from California if hired for this position, please click here for additional information.\nAbout Meta\nMeta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.\n\n$170,000/year to $240,000/year + bonus + equity + benefits\n\nIndividual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta. \n\nEqual Employment Opportunity\nMeta is proud to be an Equal Employment Opportunity employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, reproductive health decisions, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information, political views or activity, or other applicable legally protected characteristics. You may view our Equal Employment Opportunity notice here.\nMeta is committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or an accommodation due to a disability, fill out the Accommodations request form.",
    "job_link": "https://www.metacareers.com/jobs/1092822929374881",
    "posted_date": "Not specified",
    "company": "Meta",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-10T22:29:18.518297"
=======
    "scraped_at": "2025-09-11T02:23:01.470808"
  },
  {
    "title": "Public Affairs Manager, Legal and Regulatory",
    "location": "Menlo Park, CA •",
    "experience_required": "Not specified",
    "job_description": "Meta is seeking a Public Affairs Manager to join Public Affairs Legal and Regulatory team. This role will support media engagement and public affairs strategy across US state policy issues, state and local strategies, and major litigation matters.\nPublic Affairs Manager, Legal and Regulatory Responsibilities\nSupport development of communications plans for major litigation issues\nManage inbound media inquiries for legal and litigation issues\nHelp develop relationships with key media at the state and national level\nSupport implementation of state policy communications plans and announcements at the state and local media level\nMinimum Qualifications\n6+ years experience in communications, with media engagement experience\nExperience quickly understanding and explaining complex legal and regulatory issues in straightforward terms\nCross-functional partner management and collaboration skills\nExperience balancing multiple work streams simultaneously\nExperience using AI tools in a communications role\nExperience developing both long and short term public affairs strategies\nPreferred Qualifications\nBackground in policy or legal communications roles\nExperience at Meta\nExisting reporter relationships in the tech or policy space\nFor those who live in or expect to work from California if hired for this position, please click here for additional information.\nAbout Meta\nMeta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.\n\n$145,000/year to $204,000/year + bonus + equity + benefits\n\nIndividual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta. \n\nEqual Employment Opportunity\nMeta is proud to be an Equal Employment Opportunity employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, reproductive health decisions, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information, political views or activity, or other applicable legally protected characteristics. You may view our Equal Employment Opportunity notice here.\nMeta is committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or an accommodation due to a disability, fill out the Accommodations request form.",
    "job_link": "https://www.metacareers.com/jobs/767455716194138",
    "posted_date": "Not specified",
    "company": "Meta",
    "scraped_at": "2025-09-11T02:23:06.425674"
>>>>>>> Stashed changes
  },
  {
    "title": "Associate General Counsel, Employment Law & Investigations",
    "location": "Austin, TX •",
    "experience_required": "Not specified",
    "job_description": "Meta is seeking an attorney to join as Associate General Counsel, Employment Law & Investigations (Global Enterprise Wide Employment Law, GEWEL) in our Employment Law & Investigations Team. This position will report to the Director & Associate General Counsel, Employment Law and will advise on a wide range of employee benefits issues.\n\nYou will provide legal advice and counsel, with a focus on issues that arise primarily in the North America region in respect of benefit design and operation. This attorney will provide legal support, help ensure compliance with and provide education on a wide range of NORAM benefit related issues, with particular focus on ERISA, HIPAA and benefit corporate governance, alongside advice on NORAM employment tax, stock and payroll issues.\nAssociate General Counsel, Employment Law & Investigations Responsibilities\nAdvise on the design, implementation, and administration of Meta’s NORAM employee benefits plans, including: tax-qualified retirement plans, health plans, and various welfare and fringe benefits plans (e.g., short and long-term disability - including Voluntary Disability Plans - life insurance, survivor benefits, voluntary benefits, wellness, etc.) and Section 125 cafeteria plans\nDraft and maintain applicable plan documents, plan amendments, and summary plan descriptions\nNegotiate and draft contracts with third-party administrators and benefit service providers\nProvide legal advice and counsel relating to compliance with applicable state and federal retirement and health and welfare laws and regulations such as ERISA, state and federal tax, HIPAA, and ACA\nProvide legal counsel to fiduciary committees established to administer Meta’s NORAM employee benefits plans\nMonitor legislation, regulations, case law, and government enforcement activities related to the above substantive legal areas, and provide proactive strategic advice to the Employment Law Group and relevant stakeholders\nParticipate in creation and delivery of training related to employment and benefit law matters\nSupport audits, process reviews, and new policy creation and implementation related to any benefits programs\nFacilitate process improvements, create efficiencies, and provide trainings as necessary\nFlexibility and willing to work extended hours when necessary to connect with colleagues across regions\nTravel throughout the US and possibly internationally as needed\nMinimum Qualifications\nJ.D. degree and membership in at least one state bar\n8+ years of ERISA, employee benefits, and health and welfare experience\nPreferred Qualifications\nExperience with counseling on, or litigation related to, OSHA, FMLA, and/or ADA\nExperience advising on all aspects of labor and employment, including for example compensation, payroll, employment tax, incentives and M&A\nPrior in-house legal department experience\nExperience coordinating and driving to completion large-scale projects\nFor those who live in or expect to work from California if hired for this position, please click here for additional information.\nAbout Meta\nMeta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.\n\n$198,000/year to $266,000/year + bonus + equity + benefits\n\nIndividual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta. \n\nEqual Employment Opportunity\nMeta is proud to be an Equal Employment Opportunity employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, reproductive health decisions, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information, political views or activity, or other applicable legally protected characteristics. You may view our Equal Employment Opportunity notice here.\nMeta is committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or an accommodation due to a disability, fill out the Accommodations request form.",
    "job_link": "https://www.metacareers.com/jobs/1307247297596180",
    "posted_date": "Not specified",
    "company": "Meta",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-10T22:29:25.154843"
=======
    "scraped_at": "2025-09-11T02:23:11.887068"
>>>>>>> Stashed changes
  },
  {
    "title": "Commercial Sourcing Manager, ODM Sourcing",
    "location": "India",
    "experience_required": "Not specified",
    "job_description": "The ISCE (Infrastructure Supply Chain and Engineering) organization manages the entire supply chain and engineering efforts related to Meta's infrastructure, including the sourcing and procurement of data center equipment, network hardware, compute racks, and services, as well as inventory management and supply chain risk management. \n\nThe ODM commercial sourcing (CSM) team is part of Meta's Global Technology Sourcing (GTS) team within the Infrastructure Supply Chain Engineering (ISCE) organization. The ODM CSM leads the supplier strategy and commercial relationship for Meta's AI, NW, C&S L10/L11 platform design, development, and manufacturing engagements with Meta's data center infrastructure suppliers. The team is responsible for cost, contract, and overall supplier relationship management. \n\nThe leader in this role will own the commercial relationship and supply agreements for the assigned ODM design partners and manufacturers of compute, storage, and AI platforms. Together with numerous internal partners, you will develop sourcing strategies that address the unique needs of supply chain and manufacturing at hyperscale to ensure the timely delivery of quality infrastructure products globally.\nCommercial Sourcing Manager, ODM Sourcing Responsibilities\nStrategy: Responsible for the supplier and sourcing strategy for the assigned technology. Collaborate with peers in the development of short and long term strategy to achieve preferential service, pricing, and terms\nBusiness Development: Lead the RFP/RFI/RFQ process, evaluating supplier proposal, supplier selection mechanism, NPI business award process, negotiations, and associated contracts / statement of work\nMarket Intelligence: Develop and maintain relationships with suppliers’ operational team and executive leadership\nLeadership: Drive strategic discussions with Meta's executives and business partners. Be the leader that demonstrates extreme ownership and leverage supply chain expertise to provide solutions\nExecution: Be the point of escalation to resolve all commercial, supplier performance, contractual, and relationship issues for the assigned technology. Lead / participate in supplier business reviews and leverage supplier scorecard mechanism\nExternally: Influence supplier business models, roadmaps, and support structure to ensure Meta's commercial and technical requirements are met\nMinimum Qualifications\nBS degree in a related engineering discipline, supply chain, or equivalent experience\n12+ years of progressive supply chain experience with 5+ years experience in data center, hyperscalers, cloud service providers, compute, or AI system hardware supply chain\nExperience with AI/Compute & Storage L6/L10/L12 manufacturing in ODM/OEM/CM/JDM model\nExperience working with contractual agreements such as MSA, MPA, and SOW\nProven track record in managing Asia-based supply chains and building supplier relationships\nIn depth understanding of ODM cost structures, should cost models, and design for value trade-offs\nExperience in supplier evaluation, selection, management, predictive cost modeling, and contract negotiations\nExperience with driving decisions guided by analyzing data, cost models, and total cost of ownership\nExperience interfacing with internal and external partners in a fast-paced, often ambiguous, entrepreneurial and cross-functional environment, requiring a wide latitude for independent judgment while coordinating people and technical resources\nInterpersonal and communication skills, with experience influencing, negotiating, building consensus and making key strategic decisions\nPreferred Qualifications\nMS degree in a related engineering discipline, supply chain, or equivalent experience\n15+ years of business or supply chain experience in the data center, cloud service providers, Compute, or AI system server and hardware supply chain and associated industries\n5+ years of experience with directly managing commercial relationship for AI, Compute and Storage L10 server manufacturing in ODM/OEM/CM/JDM model\nDirect experience partnering with C-suite executives of suppliers/partner in the AI/C&S L10 server manufacturing\nKnowledge on the ODM/CM/OEM landscape, market, players, business models\nFor those who live in or expect to work from California if hired for this position, please click here for additional information.\nAbout Meta\nMeta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.\n\n$171,000/year to $239,000/year + bonus + equity + benefits\n\nIndividual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta. \n\nEqual Employment Opportunity\nMeta is proud to be an Equal Employment Opportunity employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, reproductive health decisions, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information, political views or activity, or other applicable legally protected characteristics. You may view our Equal Employment Opportunity notice here.\nMeta is committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or an accommodation due to a disability, fill out the Accommodations request form.",
    "job_link": "https://www.metacareers.com/jobs/636793459190715",
    "posted_date": "Not specified",
    "company": "Meta",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-10T22:29:42.598993"
=======
    "scraped_at": "2025-09-11T02:23:27.771351"
>>>>>>> Stashed changes
  },
  {
    "title": "Product Marketing Manager, Wearables Impact",
    "location": "India",
    "experience_required": "Not specified",
    "job_description": "We are seeking an experienced Product Marketing Manager for Wearables Impact to lead major initiatives that deliver and showcase the value and impact of our products. This role will spearhead high-profile, impactful programs, while collaborating cross-functionally across policy, product, marketing, and more to amplify and communicate the societal benefits of our innovations.\nProduct Marketing Manager, Wearables Impact Responsibilities\nDesign, lead and deliver two to three major impactful global programs that build and showcase the value created by our wearable products\nDevelop strategic program and measurement frameworks for these to ensure alignment with broader business goals and objectives\nDevelop and deepen compelling use cases that demonstrate the social impact of our wearable products\nTranslate program outcomes into compelling narratives and external campaigns that highlight the impact of our innovations to broad audiences in priority global markets\nCollaborate cross-functionally with Policy, Communications, Product, marketing, and other teams to identify, design, and execute high-impact programs that showcase Meta’s products to key stakeholders\nBuild programs that identify and nurture a global community of product advocates, connecting them to opportunities to influence our product roadmap and champion our innovations\nLead cross-functional teams from conception through execution and launch of go-to-market strategies, ensuring alignment and momentum through end of life\nServe as the single point of contact for communicating go-to-market updates and reviews with cross-functional leadership\nConduct market assessments using quantitative analysis and qualitative feedback, always representing the consumer point of view\nDesign tests, measure impact, and learn quickly by partnering with cross-functional teams in a results-focussed environment\nIdentify key external stakeholders to partner with around strategic product donation\nMinimum Qualifications\nBA/BS degree in marketing, business, product development, or related field, or equivalent practical experience\n10+ years of experience in product marketing, product management, trust management, management consulting, business strategy, or a similar field\nExperience working with high value partners in government, nonprofits and business\nExperience working on issues related to consumer trust, safety, and/or privacy in consumer products\nExperience of designing global product impact programs from the ground up, with demonstrable success in delivery and reputational impact\nDemonstrated combination of strategic direction and tactical execution\nExperience working in a cross-functional capacity within a time-sensitive, evolving environment\nExperience leveraging consumer research and user data insights to inform product and go-to-market strategy\nProven communication skills crafting clear and concise documents and updates for a wide range of stakeholders\nExperience working with products sold direct-to-consumer\nQuantitative, analytical, and conceptual problem-solving skills combined with demonstrated business acumen\nExperience structuring and solving complex problems and influencing product decisions from insights to action\nPreferred Qualifications\nMaster’s degree or equivalent in business, marketing, analytics, engineering, or other related quantitative discipline\nExperience working in emerging technology or category development\nExperience in consumer tech hardware and/or software for hardware products, especially those sold through both consumer and B2B channels\nDomain expertise in immersive devices, AI, or related fields\nAbout Meta\nMeta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.\n\n\n\nEqual Employment Opportunity\nMeta is proud to be an Equal Employment Opportunity employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, reproductive health decisions, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information, political views or activity, or other applicable legally protected characteristics. You may view our Equal Employment Opportunity notice here.\nMeta is committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or an accommodation due to a disability, fill out the Accommodations request form.",
    "job_link": "https://www.metacareers.com/jobs/1560274878682919",
    "posted_date": "Not specified",
    "company": "Meta",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-10T22:29:58.899890"
=======
    "scraped_at": "2025-09-11T02:23:43.790786"
>>>>>>> Stashed changes
  },
  {
    "title": "Client Solution Manager eCommerce DACH, 24 month STE",
    "location": "India",
    "experience_required": "Not specified",
    "job_description": "The Client Solutions Manager for Meta's DACH eCommerce team is a strategic and analytical solution-driver who puts our customers at the core of everything we do and supports their growth.\nClient Solution Manager eCommerce DACH, 24 month STE Responsibilities\nIn partnership with the Client Partner, identify, create, and implement marketing solutions grounded on achieving measurable business results for our partners\nServe as external product consultant educating clients on product solutions and best practices, and ultimately grow existing business partnership\nAnalyze data and insights to guide strategy and implementation of Meta solutions\nBuild and manage relationships with key stakeholders\nWork and collaborate with broad group of internal cross-functional teams\nGuide media and creative strategy, planning, and implementation of campaigns to deliver against KPIs\nOutline and manage measurement strategy, tracking, and results delivery\nIdentify optimization opportunities for improving performance\nProject manage complex work streams\nOversee internal account operations (e.g. troubleshooting issues, account set up, etc.)\nMinimum Qualifications\nDemonstrated knowledge of digital media platforms, advertising success metrics, and industry trends (Direct Response marketing, data and technology solutions, ad-tech, partnerships, CRM)\nKnowledgeable in eCommerce environment and trends\nEffective and creative problem solving and decision making skills, and the love to learn in an ambiguous environment\nExperience working effectively with cross-functional teams and all levels of management\nDemonstrated experience to manage complex work streams while maintaining strict attention to details\nStrong communication skills, collaboration and working effectively in a team\nAdvanced analytical skills, experience with analyzing datasets and delivering actionable insights, to be confidently presented to external clients\nAt least 5 years of relevant job experience\nBusiness level English\nPreferred Qualifications\nBA or BS degree preferred\nGerman Language Skills not a must\nExperience working with or at high-growth companies\nAbout Meta\nMeta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.\n\n\n\nEqual Employment Opportunity\nMeta is proud to be an Equal Employment Opportunity employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, reproductive health decisions, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information, political views or activity, or other applicable legally protected characteristics. You may view our Equal Employment Opportunity notice here.\nMeta is committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or an accommodation due to a disability, fill out the Accommodations request form.",
    "job_link": "https://www.metacareers.com/jobs/1489490448749320",
    "posted_date": "Not specified",
    "company": "Meta",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-10T22:30:15.713184"
=======
    "scraped_at": "2025-09-11T02:23:58.419153"
>>>>>>> Stashed changes
  },
  {
    "title": "Head of Business Messaging Partnerships, APAC",
    "location": "India",
    "experience_required": "Not specified",
    "job_description": "Meta is seeking a strategic and results-driven partnerships leader, who is passionate about technology and business strategy to lead our key partnerships in business messaging. You will grow and mentor a high-performing regional team of partner managers that works cross-functionally to build and develop business messaging partnerships for Meta and become a true partner to our partners.\n\nThis role will work with some of the most influential and exciting business messaging partners in the Asia Pacific region to drive business growth and innovation for clients and partners.\nHead of Business Messaging Partnerships, APAC Responsibilities\nLead and coach a high performing team of experienced partner managers\nOwn the overall revenue and operational goals\nDevelop the long-term vision and strategy for the team and business as well as manage day-to-day operation\nIdentify, initiate and lead strategic business opportunities with key partners, working with product, engineering, marketing, programs, and other cross-functional stakeholders as required\nRepresent Meta in external meetings with executives, both internally and externally\nWork in a global, fast-paced and highly collaborative environment\nMinimum Qualifications\n12+ years of professional experience\nBachelor's Degree\n5+ years of people manager experience with partnerships, channel sales or business development background\nExperience building and leading teams, coaching and developing individuals\nAbility to effectively influence and communicate to various audiences internally, globally and externally, especially at leadership levels\nQuantitative and qualitative analytical skills and proven track record in making data-driven decisions\nProven track record of collaborative approach to problem solving, experience building internal relationships and operating effectively with cross-functional partners\nWillingness to travel and work across multiple time zones\nPreferred Qualifications\nRelevant experience working in the messaging ecosystem\nFluency in a Southeast Asian or North Asian language is preferred, as this role manages relationships and stakeholders in various markets within the region, whose usual business language is in regional language\nExperience in and understanding of Asia Pacific markets\nEstablished success building C-Suite relationships and influencing product direction would be an asset\nAbout Meta\nMeta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.\n\n\n\nEqual Employment Opportunity\nMeta is proud to be an Equal Employment Opportunity employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, reproductive health decisions, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information, political views or activity, or other applicable legally protected characteristics. You may view our Equal Employment Opportunity notice here.\nMeta is committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or an accommodation due to a disability, fill out the Accommodations request form.",
    "job_link": "https://www.metacareers.com/jobs/1524224358747111",
    "posted_date": "Not specified",
    "company": "Meta",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-10T22:30:33.413700"
=======
    "scraped_at": "2025-09-11T02:24:15.955857"
>>>>>>> Stashed changes
  },
  {
    "title": "Global Workplace Services (GWS) Supplier Program Manager",
    "location": "Sunnyvale, CA •",
    "experience_required": "Not specified",
    "job_description": "Our Central Operations team collaborates with a variety of groups to enable seamless global operations. Our mission is to provide integrated services across Global Workplace Services (GWS), enhancing efficiency, optimizing resources, and delivering strategic solutions at scale. As a Supplier Program Manager, you will work closely with cross-functional internal stakeholders to identify business needs, streamline and optimize purchasing processes, and manage supplier deliverables across a range of indirect spend categories. These categories include, but are not limited to, goods procurement, software licensing, professional services, equipment, business operations outsourcing, general construction, and repair and maintenance.\nGlobal Workplace Services (GWS) Supplier Program Manager Responsibilities\nServe as the primary point of contact for suppliers and stakeholders, managing day-to-day communications, inquiries, and escalations to ensure collaborative relationships\nDrive accountability and maximize value from suppliers by classifying, rationalizing, and optimizing the supplier portfolio, with a focus on managing strategic suppliers and partnerships\nOrganize and facilitate regular meetings between suppliers and internal business stakeholders to align goals, expectations, and performance\nMonitor and evaluate supplier’s performance using robust reporting frameworks, tracking Key Performance Indicators (KPIs) and compliance with service level agreements (SLAs)\nDevelop, maintain, and present supplier scorecards and dashboards tailored to various audiences, providing actionable insights to leadership and stakeholders\nIdentify areas for improvement with stakeholders in supplier services, lead remediation activities when performance issues arise, and drive continuous improvement initiatives\nEnsure all supplier activities adhere to company policies and regulatory standards, proactively developing and implementing risk mitigation plans for critical and preferred suppliers\nCollaborate with internal teams, including finance, operations, and risk management—to identify, monitor, and mitigate supplier-related risks such as financial viability, information security, business continuity, and regulatory compliance\nManage the entire supplier’s lifecycle, from onboarding—including documentation collection, verification, training, and orientation to company policies and processes—through ongoing relationship management and performance oversight\nSupport business improvement initiatives and process optimization projects, working closely with cross-functional teams to implement best practices in supplier management\nCollaborate with internal stakeholders to analyze data to assess supplier performance, resolve conflicts, and drive results that support organizational objectives\nCultivate expertise in supplier management principles and best practices\nMinimum Qualifications\n5+ years in strategic relationship management, including hands-on experience managing third-party service delivery and supplier relationships\nHave commercial awareness and understanding of various business models and operational environments\nAdvanced project management skills, with a proven track record of managing multiple projects and stakeholders in deadline-focused, ambiguous settings\nAbility to analyze complex data, break down issues into actionable work streams, and resolve conflicts independently\nHighly organized, action-oriented, and accountable for driving outcomes and following up on feedback to ensure positive results\nInterpersonal and communication skills with the ability to build trust and influence stakeholders\nEffective facilitation skills, with experience leading group discussions, driving collaboration, and communicating clearly across teams\nExperience influencing operational changes and maximizing adoption of new ideas, tools, and practices across organizations\nProficient in Microsoft Office Suite and Google Suite applications\nThink both strategically and tactically, adapting to evolving business needs and priorities\nDemonstrate expert organizational, communication, and stakeholder management skills, with the ability to manage multiple priorities and lead projects effectively\nFor those who live in or expect to work from California if hired for this position, please click here for additional information.\nAbout Meta\nMeta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.\n\n$108,000/year to $155,000/year + bonus + equity + benefits\n\nIndividual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta. \n\nEqual Employment Opportunity\nMeta is proud to be an Equal Employment Opportunity employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, reproductive health decisions, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information, political views or activity, or other applicable legally protected characteristics. You may view our Equal Employment Opportunity notice here.\nMeta is committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or an accommodation due to a disability, fill out the Accommodations request form.",
    "job_link": "https://www.metacareers.com/jobs/2150347148777948",
    "posted_date": "Not specified",
    "company": "Meta",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-10T22:30:39.413933"
=======
    "scraped_at": "2025-09-11T02:24:36.536588"
>>>>>>> Stashed changes
  },
  {
    "title": "Optical Additive Manufacturing Materials Process Engineer",
    "location": "India",
    "experience_required": "Not specified",
    "job_description": "We are seeking an experienced product and manufacturing engineer with experience in lens industrial manufacturing processes (e.g., anti-reflective coating, lamination, wet coating processes etc.) to drive product validation, development from concept to mass production in Asia together with manufacturing vendors and suppliers. The candidate will have demonstrated knowledge of materials, manufacturing processes, process risks, and quality control, along with a proven track record in launching industrial products through collaboration with Chinese vendors and contract manufacturers (CMs).\n\nYou will serve as the technical bridge between global R&D and local manufacturing, ensuring process robustness, quality, and scalability throughout the end-to-end process flow.\nOptical Additive Manufacturing Materials Process Engineer Responsibilities\nLead product development/scaling up in China, ensuring seamless integration of materials, processes, and quality control while working closely with local vendors, contract manufacturers, and global teams\nDrive process optimization for lens manufacturing (e.g., anti-reflective coating, lamination, wet processes) to improve yield, efficiency, and quality at supplier/CM sites\nConduct on-site technical reviews with vendors to troubleshoot process issues, qualify materials, and validate production readiness\nIdentify and mitigate process risks in manufacturing, ensuring robust and scalable production through PFMEA and other methodologies\nCollaborate with global R&D, engineering, production teams, and Chinese suppliers to understand product requirements and translate them into manufacturable solutions\nDevelop and execute proof-of-concept (POC) projects, exploring materials and processes to enhance product performance\nWork closely with suppliers and equipment vendors to evaluate new technologies for lens manufacturing\nLead design for manufacturability (DFM) reviews to ensure smooth transition from prototype to mass production\nEstablish quality control standards and process validation protocols to meet industry and customer specifications together with vendors\nSupport new product introductions (NPI), troubleshooting process issues during ramp-up and ensuring on-time delivery\nTravel extensively (more than 60% within China) to CM/supplier sites for process validation, troubleshooting, and production support\nStay updated on emerging trends in lens materials, coatings, and advanced manufacturing technologies\nMinimum Qualifications\nBachelor in Materials Science and Engineering, Chemistry or related field\n5+ years in lens, optical products or consumer electronics manufacturing with expertise in coatings, lamination, wet processes, and curing technologies\nProven experience working with Chinese vendors/CMs - familiarity with local supply chain dynamics is a must\nDemonstrated experience of understanding of product requirements, material properties, and process-materials-property-performance relationships\nHands-on experience with process development, scale-up, and quality control in an industrial setting\nMindset and skills to think out-of-the-box for POC development while maintaining a detail-oriented approach\nBig-picture thinking - ability to align technical decisions with business and product launch goals\nDemonstrated experience of problem-solving, project management, and cross-functional collaboration skills\nDemonstrated experience in failure mode analysis, root cause investigation, and problem solving for product yield and quality issues\nExperience in design reviews, tolerance analysis, and FMEA and DFM reviews\nProfessional working proficiency in Mandarin and English (technical and business-level) is a must\nWillingness to travel frequently (up to 60%) across China\nPreferred Qualifications\nMaster/ Ph.D. in materials science and engineering or equivalent field\nExperience on hard coating and anti-reflective coating process is a big plus\nExperience with inkjet deposition, UV-curable 3D printing, or other advanced coating technologies\nExperience of high-precision equipment design and manufacturing based on process and materials requirement\nBroad network and experience in lens/optical component-related materials industry\nExperience of working with teams located in Europe\nExperience in traditional ophthalmic industry\nExperience in the consumer electronics industry, especially focus on materials engineering and process\nExperience launching products into mass production - NPI experience is a big plus\nAbout Meta\nMeta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.\n\n\n\nEqual Employment Opportunity\nMeta is proud to be an Equal Employment Opportunity employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, reproductive health decisions, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information, political views or activity, or other applicable legally protected characteristics. You may view our Equal Employment Opportunity notice here.\nMeta is committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or an accommodation due to a disability, fill out the Accommodations request form.",
    "job_link": "https://www.metacareers.com/jobs/1857711285156519",
    "posted_date": "Not specified",
    "company": "Meta",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-10T22:31:11.774347"
=======
    "scraped_at": "2025-09-11T02:24:52.198978"
>>>>>>> Stashed changes
  },
  {
    "title": "In-App Marketing Manager, Creators",
    "location": "Menlo Park, CA •",
    "experience_required": "Not specified",
    "job_description": "We're looking for an experienced In-App Marketing Manager to join our growing creator marketing team, and support our global creators. As an In-App Marketing Manager for Creators, you will play a key role in amplifying our vision to global creators - and collaborate with a passionate, creator-centric team dedicated to breaking traditional marketing molds. Together you'll build and execute digital marketing campaigns to reach creators on Instagram, Facebook and Threads with tailored guidance and best practices that inspire creator action and growth. This individual will leverage internal (i.e. on-platform notifications and Newsfeed ads) and external tools (Salesforce Marketing Cloud) to manage global campaigns that help thousands of partners meet their desired outcomes on Meta.\nIn-App Marketing Manager, Creators Responsibilities\nDefine and lead end-to-end development of in-app marketing strategy for creator programs - that meet our short and long-term business goals\nBuild, manage, and optimize multiple online channels (email, on-platform notifications, etc.)\nDevelop and share digital marketing best practices, plus bring continuous innovation to build effective campaigns\nDesign and implement test plans (eg. A/B and multivariate) to measure the effectiveness of marketing campaigns, providing data-driven insights to inform future campaign optimization\nDevelop measurable KPIs and track performance of campaigns to provide data-backed insights to optimize campaigns and find new opportunity areas\nCollaborate with cross-functional teams to define requirements, scope, deliverables, and goals, ensuring alignment and effective project execution\nMinimum Qualifications\n7+ years of experience in growth marketing, digital marketing, email marketing, influencer marketing, or equivalent\nExperience in building digital marketing campaigns (using Email, Facebook Ads, In-product nudges, etc.)\nExperience with A/B testing, measurement and channel optimization\nExperience working directly with Data Science and evaluating campaign performance\nProven project management skills, experience working effectively with cross-functional teams, and experience operating in matrixed teams and organizations\nAnalytical and performance marketing experience\nPreferred Qualifications\nWorking in a fast-paced and ambiguous environment\nExperience in Salesforce Data Cloud and Marketing Cloud\nUnderstanding the creator audience and their needs is a plus\nFor those who live in or expect to work from California if hired for this position, please click here for additional information.\nAbout Meta\nMeta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.\n\n$122,000/year to $176,000/year + bonus + equity + benefits\n\nIndividual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta. \n\nEqual Employment Opportunity\nMeta is proud to be an Equal Employment Opportunity employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, reproductive health decisions, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information, political views or activity, or other applicable legally protected characteristics. You may view our Equal Employment Opportunity notice here.\nMeta is committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or an accommodation due to a disability, fill out the Accommodations request form.",
    "job_link": "https://www.metacareers.com/jobs/1302356711262172",
    "posted_date": "Not specified",
    "company": "Meta",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-10T22:31:17.246023"
=======
    "scraped_at": "2025-09-11T02:24:58.016158"
>>>>>>> Stashed changes
  },
  {
    "title": "Operations Manager (Resource Management)",
    "location": "Los Angeles, CA •",
    "experience_required": "Not specified",
    "job_description": "Creative X is a global, integrated creative agency that drives the creative vision for our brands and how they are perceived in the world. We develop the vision for next-generation creative advertising, consumer brand content and experiences for Meta, Facebook, Instagram, WhatsApp and our hardware products.\n\nOur vision is fearless creativity that shapes the future of connection. With some of the industry’s best talent on our team, we create beautiful work that has a purpose. And with an audience of almost five billion across some of the world’s biggest brands, we create brave ideas that demonstrate the full creative potential of our platforms, including industry leading, envy-inducing creative experiences that push the boundaries of traditional advertising.\n\nWe believe in attracting and nurturing industry-leading talent with a focus on community and career development. We have developed best-in-class collaboration models with agencies and our cross-company creative network to ensure a consistent and effective creative narrative for work that reaches an audience across the globe due to the scale of our products. \n\nWe are looking for a resourcing manager to support resourcing and developing scalable teams from a broad range of experiences, perspectives and backgrounds. In this role, you will work with cross-functional partners to scope, scale, and resource  industry-leading creative and design teams across business priorities. We are looking for a detail-oriented tactical operator, who has experience with and an in-depth understanding for tracking, reporting and finding opportunities to help mobilize a growing, global creative team.\nOperations Manager (Resource Management) Responsibilities\nFacilitate resource allocation process across all Disciplines (Program Management, Production, Creative, Design and Business Affairs)\nPartner with Discipline leadership to determine strategic, creative resourcing solutions for current project needs and forecasting for future growth\nBuild meaningful relationships with team members and develop an understanding of their skillsets and experience to ensure they are assigned to projects that align with their strengths, career goals, and the needs of the business\nUnderstand and help maintain and optimize our central resourcing tooling to ensure it is accurate and meets the needs of our business\nAssess project requirements against comprehensive, cross-functional creative briefs, making talent decisions that serve the best interests of all stakeholders\nDevelop new team structures, ways of working and new approaches to tackle complex creative challenges\nTrack and report on resource capacity planning\nSupport long-lead planning with the Creative Leadership and Program Management Leads to build teams, frameworks and systems that best support key initiatives, campaigns and projects\nSupport the onboarding and immersion of new hires\nMinimum Qualifications\n5+ years of experience working in resource management at a creative agency, production studio or client side\nExperience working with and navigating marketing and creative organizations\nExperience in Resource Management tools such as Monday.com, JIRA, Asana and/or Workfront\nExperience managing and onboarding freelancers, vendors, agencies, or contractors\nExperience setting priorities, problem-solving, multitasking and working in a rapidly changing environment\nExperience understanding end-to-end creative & marketing process\nEvidenced success with clear communication, negotiations and stakeholder management skills\nOrganized, detail-oriented, and adept at both tactical execution and strategic planning\nPreferred Qualifications\nDemonstrated understanding of AI technologies and their applications in the creative and design industries\nExperience leveraging AI tools and platforms to enhance resource tracking, allocation, and management efficiencies\nFamiliarity with AI-powered analytics and automation tools to improve forecasting, capacity planning, and operational workflows\nProven experience embracing and integrating AI solutions to optimize decision-making processes in resourcing and team planning\n8+ years of experience working in resource management at a creative agency, production studio or client side\nExperience working in or with a large, global tech company\nExperience adopting emerging AI technologies to drive innovation and scalability in creative team resourcing\nFor those who live in or expect to work from California if hired for this position, please click here for additional information.\nAbout Meta\nMeta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.\n\n$116,000/year to $166,000/year + bonus + equity + benefits\n\nIndividual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta. \n\nEqual Employment Opportunity\nMeta is proud to be an Equal Employment Opportunity employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, reproductive health decisions, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information, political views or activity, or other applicable legally protected characteristics. You may view our Equal Employment Opportunity notice here.\nMeta is committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or an accommodation due to a disability, fill out the Accommodations request form.",
    "job_link": "https://www.metacareers.com/jobs/24336695472626363",
    "posted_date": "Not specified",
    "company": "Meta",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-10T22:31:23.060578"
=======
    "scraped_at": "2025-09-11T02:25:03.060397"
>>>>>>> Stashed changes
  },
  {
    "title": "Content Designer",
    "location": "Menlo Park, CA •",
    "experience_required": "Not specified",
    "job_description": "Content designers at Meta craft simple, straightforward and human experiences. Approaching design through the lens of language, we leverage our expertise in user experience design, design thinking and product strategy. Come join our team to create and shape great, intuitive products and services used by billions of people around the world every day.\nYou’ll be expected to design and deliver product flows, new features, in-product language, content frameworks, navigation, product naming and more, for platforms including mobile, desktop, AR/VR, hardware and voice. The Meta Content Design team is one of the largest and most established in the world, and includes people at various stages in their careers and from a range of backgrounds.\nContent Designer Responsibilities\nDesign, write, edit and test clear, compelling in-product language to help users and teams meet their goals. This includes product flows, interface language, education materials, product names, navigational nomenclature, terminology, taxonomies and other content across Meta products and experiences\nApply systems thinking to the product, whether it’s defining extensible design patterns or conducting audits of existing experiences\nGive and solicit feedback from your UX design peers in service of building the best products\nContribute to projects in ways that enhance the clarity and usability of product experiences, and guide teams towards solving the most important problems\nIdentify problems you can help solve and deliver on them\nEdit and contribute to designs and content using Figma\nCollaborate daily with peers across disciplines, including engineering, design, research, marketing and data science\nPartner with our internationalization team to ensure product experiences are of the highest quality in every language\nMinimum Qualifications\nBachelor's degree in Communications, English, Design or a related field\n3+ years’ experience in UX writing\nExperience to create wireframes and co-author design mocks using design tools\nExperience to simplify and communicate complex ideas to broad audiences\nSkill with technical systems, like creating logic to personalize product copy, or using tools for managing content at scale\nExperience with design systems and systems thinking\nFor those who live in or expect to work from California if hired for this position, please click here for additional information.\nAbout Meta\nMeta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.\n\n$90,000/year to $138,000/year + bonus + equity + benefits\n\nIndividual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta. \n\nEqual Employment Opportunity\nMeta is proud to be an Equal Employment Opportunity employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, reproductive health decisions, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information, political views or activity, or other applicable legally protected characteristics. You may view our Equal Employment Opportunity notice here.\nMeta is committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or an accommodation due to a disability, fill out the Accommodations request form.",
    "job_link": "https://www.metacareers.com/jobs/754845180753985",
    "posted_date": "Not specified",
    "company": "Meta",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-10T22:31:28.432532"
=======
    "scraped_at": "2025-09-11T02:25:07.672717"
>>>>>>> Stashed changes
  },
  {
    "title": "Enterprise Content Strategist",
    "location": "Menlo Park, CA •",
    "experience_required": "Not specified",
    "job_description": "As a B2B Content Strategist, you will be responsible for developing and executing content strategies that align with the company's objectives and drive user engagement. You will collaborate closely with cross-functional teams, including Marketing Communications, Product Marketing Managers, Designers, and Growth Marketers, to create content that meets the needs of our target audience and enhances our customers experience.\nEnterprise Content Strategist Responsibilities\nDevelop and implement a comprehensive enterprise content strategy that aligns with Business Messaging priorities for our Enterprise audience and campaigns\nLeverage research to understand our businesses and create content that resonates with them\nCollaborate closely with Marcomms, Research, Campaign Strategists, Channel Owners and Design teams to maintain an editorial calendar to ensure that content is produced and optimized on a consistent basis\nCollaborate with cross-functional teams to ensure that content is optimized for search engines, social media, and other digital channels\nCollaborate on content production and distribution across multiple channels, including website, social media, email, and other digital channels\nAnalyze and report on the performance of content using analytics tools while working with the team to test and optimize web copy consistently\nStay up-to-date with emerging trends and best practices in content marketing and web content strategy\nMinimum Qualifications\nBachelor's Degree in Business, Marketing or Creative discipline\n8+ years of experience in enterprise content strategy or a related field\nExperience with content management systems (CMS) and analytics tools\nExperience with developing content for demand generation\nProficient with SEO and social media best practices\nDemonstrated experience of resourcefulness and adaptability in problem-solving\nDemonstrated experience working collaboratively with cross-functional teams while being deadline driven\nFor those who live in or expect to work from California if hired for this position, please click here for additional information.\nAbout Meta\nMeta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.\n\n$122,000/year to $176,000/year + bonus + equity + benefits\n\nIndividual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta. \n\nEqual Employment Opportunity\nMeta is proud to be an Equal Employment Opportunity employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, reproductive health decisions, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information, political views or activity, or other applicable legally protected characteristics. You may view our Equal Employment Opportunity notice here.\nMeta is committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or an accommodation due to a disability, fill out the Accommodations request form.",
    "job_link": "https://www.metacareers.com/jobs/675603115564068",
    "posted_date": "Not specified",
    "company": "Meta",
<<<<<<< Updated upstream
    "scraped_at": "2025-09-10T22:31:34.227724"
  },
  {
    "title": "Horizon Creation Team - Technical Lead",
    "location": "Los Angeles, CA •",
    "experience_required": "Not specified",
    "job_description": "The Reality Labs and AI teams at Meta are helping more people around the world come together and connect through world-class Augmented, Mixed and Virtual Reality hardware and software. With global departments dedicated to AR/VR research, computer vision, haptics, social interaction, and more, we are committed to driving the state-of-the-art forward through relentless innovation. AR/VR's potential to change the world is immense -- and were just getting started.\n\nOur Core Tech teams explore, develop, and deliver new cutting-edge technologies that serve as the foundation of current and future Reality Labs products. From mixed reality and human interaction to natural input and beyond, these teams are focused on taking new technologies from early concept to the product level while iterating, prototyping, and realizing the human value and new experiences they open up.\nHorizon Creation Team - Technical Lead Responsibilities\nDrive the team's goals and technical direction to pursue opportunities that make your larger organization more efficient\nInvent, analyze, design, develop and optimize real time VR and AR computer vision algorithms in areas related to 3D reconstruction, SLAM, object detection and tracking, sensor fusion and camera calibration\nTechnically lead in a team environment across multiple scientific and engineering disciplines, making the architectural trade-offs required to rapidly deliver software solutions\nDevelop software for a variety of consumer devices, including novel sensing systems, tracking systems, imaging systems and haptic devices\nEffectively communicate complex features and systems in detail\nDevelop clean readable code, debug complex problems that span systems, prioritize ruthlessly and get things done with a high level of efficiency\nLearn constantly, dive into new areas with unfamiliar technologies, and embrace the ambiguity of AR and VR problem solving\nUnderstand industry & company-wide trends to help assess & develop new technologies\nPartner & collaborate with organization leaders to help improve the level of performance of the team & organization\nIdentify new opportunities for the larger organization & influence the appropriate people for staffing/prioritizing these new ideas\nMinimum Qualifications\nExperience leading projects with industry-wide impact\nVast experience communicating and working across functions to drive solutions\nProven track record of planning multi-year roadmap in which shorter-term projects ladder to the long term-vision\nExperience in driving large cross-functional/industry-wide engineering efforts\nSignificant experience in mentoring/influencing engineers across organizations\nSignificant experience in programming languages with a technical background\nSignificant experience in one or more of the following areas: artificial intelligence, machine learning, deep learning, computer vision, 3D graphics\nBachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience\nPreferred Qualifications\nExperience working in 3D game development highly beneficial\nFor those who live in or expect to work from California if hired for this position, please click here for additional information.\nAbout Meta\nMeta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.\n\n$213,000/year to $293,000/year + bonus + equity + benefits\n\nIndividual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta. \n\nEqual Employment Opportunity\nMeta is proud to be an Equal Employment Opportunity employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, reproductive health decisions, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information, political views or activity, or other applicable legally protected characteristics. You may view our Equal Employment Opportunity notice here.\nMeta is committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or an accommodation due to a disability, fill out the Accommodations request form.",
    "job_link": "https://www.metacareers.com/jobs/24732638832998085",
    "posted_date": "Not specified",
    "company": "Meta",
    "scraped_at": "2025-09-10T22:31:42.169366"
=======
    "scraped_at": "2025-09-11T02:25:12.982009"
>>>>>>> Stashed changes
  }
]