[
  {
    "title": "Data Engineer II",
    "location": "Hyderabad, Telangana, India",
    "experience_required": "",
    "job_description": "Overview\nDo you have a relentless passion for data engineering and building platforms that enable decision science at scale? Does processing petabytes of data every day excite you? Do you enjoy designing complex workflows and pipelines that power measurement, insights, and visualization from real-world user data—ultimately driving experiments and recommendations that impact business metrics? If so, we’d love to talk to you!\n We are the Windows India Data team, part of the Windows and Web Experiences (WWE) engineering organization. Our mission is to leverage advanced data engineering, analytics, and data science to inform decision-making, drive product performance, and maximize business impact through the power of ML/AI. In short, we thrive on data to solve high-impact business problems for Windows! We’re looking for a strong Data Engineer to help us foster and scale a data-driven culture across Windows.\n\nAs a Software & Data Engineer II, you’ll help build and deliver business intelligence for experiences running on 1.5 billion Windows devices. You’ll partner closely with Data Scientists and Analysts to understand their challenges and design next-generation platforms and solutions that make decision-making seamless and scalable.\nQualifications\nRequired Qualifications:\nBachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\n Proven coding and debugging skills in C#, C++, Java, or SQL.\nAbility to work and communicate effectively across disciplines and teams.\nFamiliarity with distributed data processing and analysis, such as Map-Reduce or Apache Spark.\n2+ years of experience in data engineering.\nUnderstanding and experience with data cloud computing technologies such as – Azure Synapse, Azure Data Factory, SQL, Azure Data Explorer, Power BI, PowerApps, Hadoop, YARN, Apache Spark.\nExcellent analytical skills with systematic and structured approach to software design.\n #W+DJOBS\nResponsibilities\nAuthoring and design of Big Data ETL platforms and pipelines in SCOPE, Scala, SQL, Python, or C#.\nData extraction across a wide variety of data sources.\nData cleaning, preprocessing, and transformation for further analysis by data analysts.\nData Validation framework from source to endpoints ensuring data quality and integrity.\nEnable the Data Scientists and Analysts to do more with data across all aspects of the development lifecycle.\nContribute to a data-driven culture as well as a culture of experimentation across the organization.\nProvide new and improve upon existing data platform offerings with a fundamental understanding of the end-to-end scenarios.\nEnable Data Scientists and other partners to do more with data across all aspects of the development lifecycle by helping democratize data.",
    "job_link": "https://jobs.careers.microsoft.com/global/en/job/1860256/Data-Engineer-II",
    "posted_date": "Aug 18, 2025",
    "company": "MICROSOFT",
    "scraped_at": "2025-09-10T15:25:53.777215"
  },
  {
    "title": "Software Engineer II",
    "location": "Bangalore, Karnataka, India",
    "experience_required": "",
    "job_description": "Overview\nWe are seeking a highly skilled and experienced Software Engineer II iOS Developer to join our mobile engineering team. You will lead the design and development of innovative applications for Apple devices, including iPhones and iPads. This role demands deep technical expertise, a passion for user-centric design, and the ability to collaborate across teams to deliver high-quality mobile experiences.\n Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n  Qualifications\nRequired Qualifications:\nBachelor’s or Master’s degree in Computer Science, Engineering,\nOR related field.\n5+ years of experience in iOS development.\nProficiency in Swift and Objective-C.\nExperience with version control tools like Git, Mercurial, or SVN.\nStrong understanding of iOS SDKs, UI frameworks, and Apple Human Interface Guidelines.\nFamiliarity with RESTful APIs and mobile architecture patterns (MVC, MVVM).\nExperience with CI/CD pipelines and automated testing frameworks\nPreferred Qualifications:\nExperience with iPhone and iPad-specific development.\nKnowledge of performance tuning and memory management.\nExposure to Agile development methodologies.\nContributions to open-source projects or published apps in the App Store.\n Responsibilities\nDesign, build, and maintain advanced applications for the iOS platform using Swift and/or Objective-C.\nCollaborate with cross-functional teams to define, design, and ship new features.\nLead code reviews and mentor junior developers.\nEnsure the performance, quality, and responsiveness of applications.\nIdentify and correct bottlenecks, fix bugs, and maintain code quality.\nIntegrate with backend services and APIs to support mobile functionality.\nContinuously discover, evaluate, and implement new technologies to maximise development efficiency.\nDocument technical specifications and maintain development best practices.",
    "job_link": "https://jobs.careers.microsoft.com/global/en/job/1849827/Software-Engineer-II",
    "posted_date": "Jul 31, 2025",
    "company": "MICROSOFT",
    "scraped_at": "2025-09-10T15:25:54.422688"
  },
  {
    "title": "Technical Support Engineer - Azure / Identity and Access Management",
    "location": "Sydney, New South Wales, Australia",
    "experience_required": "",
    "job_description": "Overview\nWith more than 45,000 employees and partners worldwide, the Customer Experience and Success (CE&S) organization is on a mission to empower customers to accelerate business value through differentiated customer experiences that leverage Microsoft’s products and services, ignited by our people and culture. We drive cross-company alignment and execution, ensuring that we consistently exceed customers’ expectations in every interaction, whether in-product, digital, or human-centered. CE&S is responsible for all up services across the company, including consulting, customer success, and support across Microsoft’s portfolio of solutions and products. Join CE&S and help us accelerate AI transformation for our customers and the world.\n\nWithin CE&S, the Customer Service & Support (CSS) organization builds trust and confidence for every person and organization through delivering a seamless support experience. In CSS, we are powered by Microsoft’s AI technology to help consumers, businesses, partners, and more, resolve their issues quickly and securely, helping prevent future problems from occurring and achieving more from their Microsoft investment.\n\nIn the Customer Service & Support (CSS) team we are looking for people with a passion for delivering customer success. As a Senior Technical Support Engineer, you will own, troubleshoot and solve complex customer technical issues. This opportunity will allow you to accelerate your career growth, hone your problem-solving, collaboration and research skills, and deepen your technical proficiency.\n\nThis role is flexible in that you can work up to 50% from home.\n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n Qualifications\nRequired Qualifications:  \n 5+ years in designing, implementing and supporting solutions in a complex enterprise environment.  \n5+ years technical background, enterprise experience, and knowledge in one or more of the technologies below:    \nIdentity Synchronization Technologies\nAuthentication and Authorization Management\nEnterprise level protocols (Kerberos, PKI, Oauth, SAML, WS-Fed, etc)\nIdentity Management\nFederation\nSecurity Management\nB2B, B2C\nRole based access control, Permissions management\nMFA\n English Language: fluent in reading, writing and speaking. If English is not native language, proficiency test results is a plus (e.g. TOEFL, TOEIC, Cambridge English Exams)  \n  Flexibility to adapt working hours according to business needs, including weekends and be part of on-call rotations. Though schedule changes are not frequent, you will need to have flexibility to accommodate changes as needed.   \n    Preferred Qualifications:   \n5+ years of experience in technology, support, training, consulting, architecting, development, network, data center operations, IT admin or operations or equivalent education in technologies below:  \nAzure Active Directory  \nIdentity Synchronization Technologies (Dirsync, AAD Connect, FIM…etc)  \nActive Directory Federation Services (ADFS) – or similar 3rd party experience (Shibboleth, CA SiteMinder, Okta, PING etc)  \nIdentity and Access Management  \nOffice 365 Identity Management  \nCloud Domain Management  \nCloud User Management and configuration  \n Citizenship & Citizenship Verification: This position requires verification of Australian citizenship due to citizenship-based legal restrictions. Specifically, this position supports United States federal, state, and/or local Australian government agency customers and is subject to certain citizenship-based restrictions where required or permitted by applicable law. To meet this legal requirement, citizenship will be verified via a valid passport.\n Ability to meet Microsoft, customer and / or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire / transfer and every two years thereafter.\n Responsibilities\nSupport Engineers (SE) serve as frontline technical resources for Microsoft’s customers and partners via phone, email or web.  They deliver unique value by collaboratively and reactively solving customer problems, providing proactive support advice, contributing to product quality and enhancements and creating self-help assets to broadly reach more customers.  \n You will be part of a team responsible for providing an outstanding technical support experience to our business customers. From problem identification to full resolution, you will own and manage the customer experience over the phone and Web. When needed, you will collaborate with others to engage subject matter experts, Engineering (Product Groups) or Management. Your day to day job will be about providing both technical expertise (either on your own or by involving your colleagues) and about being an excellent communicator and a service oriented professional. You will be given the opportunity to become a subject matter expert in one or more areas and receive guidance and mentorship from your colleagues.  \n Core Responsibilities:   \nScope a customer’s issue by collecting the relevant facts and investigate the problem by doing your own research and by involving other teams as needed.  \nConsult and collaborate with your immediate peers or colleagues around the world and with management and engineering to resolve service issues.  \nAct internally as a customer advocate.    \nEmpower customers to find information, self-solve when they decide to, and learn more about Microsoft products, services and support.   \nAdvise customers on how to gain additional value from their Microsoft products.  \nDocument your technical work and research to help your colleagues, improve the product, and improve the support experience.  \nMaintain a proactive approach to customer happiness, identifying customer satisfaction concerns and managing customer expectations.",
    "job_link": "https://jobs.careers.microsoft.com/global/en/job/1828927/Technical-Support-Engineer---Azure-%2F-Identity-and-Access-Management",
    "posted_date": "Sep 10, 2025",
    "company": "MICROSOFT",
    "scraped_at": "2025-09-10T15:25:55.075853"
  },
  {
    "title": "Digital Solution Specialist - AI Workforce (Modern Work)",
    "location": "Reading, Berkshire, United Kingdom",
    "experience_required": "",
    "job_description": "Overview\nAt Small Medium Enterprises and Channel (SME&C), we are leading a high-growth, AI-powered global sales team—one that is deeply connected to our partners and driven by customer success. By uniting our Small Medium Business, Corporate, Strategy, and Partner teams, we are unlocking the largest customer opportunity, backed by the industry’s most significant investments. Leveraging the power of AI and our extensive partner ecosystem, we are redefining how businesses of all sizes adopt technology to drive growth and innovation. \nSME&C is more than a sales organization—it’s a culture of innovation, opportunity, and inclusivity. Here, you’ll be part of a diverse, high-performing, and customer-obsessed team where collaboration, connection, and continuous learning fuel everything we do. \nIf you thrive in a fast-paced, digital-first environment and are eager to make a meaningful impact, explore how SME&C can be the next step in your career. Together, we are shaping the future of business.\n As a Digital Solution Specialist – AI Workforce (Modern Work), your focus is winning customers' technical decisions and driving digital transformation through Modern Work solutions. Collaborate in a virtual team to educate customers, demonstrate solutions, and exceed revenue goals. Deepen technical expertise across Microsoft and non-Microsoft cloud technologies. [This role is flexible in that you can work up to 50% from home.\n Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\nQualifications\nRequired Qualifications \nSignicant technology-related sales or account management experience\nOR Bachelor's Degree in Information Technology, Business Administration, or related field AND significant technology-related sales or account management experience\nOR equivalent experience\n Preferred Qualifications\nExtensive technology-related sales or account management experience\nOR Bachelor's Degree in Information Technology, or related field AND significant technology-related sales or account management experience\nOR Master's Degree in Business Administration (e.g., MBA), Information Technology, or related field AND significant technology-related sales or account management experience\nRelevant of solution sales or consulting services sales experience\nResponsibilities\nYou will proactively work with customers to introduce how other workloads could enable digital and AI transformation areas that are aligned with the customer's industry and turns opportunities into deals leveraging your deep understanding of customers' business and its priorities to drive conversations with customers on digital transformation across multiple solution areas, in collaboration with partners and services.\nYou will collaborate with Channel Solutions and with a network of partners to cross-sell, up-sell, and co-sell as well as identify and support on-boarding new partners by researching and discussing customer scenarios.\nYou will provide analysis of the competitive landscape in supported solution area as you collaborate with partners to analyze competitor products, products, solutions, and/or services and implements strategies to position Microsoft against competitors in customer communication.\nYou will help influence internal and external stakeholders on business planning, rhythm-of-business (ROB) meetings to review and plan for accounts in the assigned territory.\nYou will collaborate with extended sales teams, partners, and marketing to conduct business analysis (e.g., whitespace analysis, identify industry trends) to pursue high-potential customers and develop a target list of potential business.\nYou will be responsible for managing the end-to-end business of the assigned territory as you conduct forecasting for accounts and develop a portfolio and territory plan to drive intentional selling aligned with strategic priorities.\nYou will apply the orchestration model to proactively drive deal closure by identifying and align internal stakeholders, leverage and expand relationships with partners.",
    "job_link": "https://jobs.careers.microsoft.com/global/en/job/1839441/Digital-Solution-Specialist---AI-Workforce-(Modern-Work)",
    "posted_date": "Sep 10, 2025",
    "company": "MICROSOFT",
    "scraped_at": "2025-09-10T15:25:55.727596"
  },
  {
    "title": "Finance Manager",
    "location": "Dublin, Ireland",
    "experience_required": "",
    "job_description": "Overview\nWe’re looking for a dynamic and experienced Finance Manager to join our high-performing team. The successful candidate will be responsible for revenue reporting across both US GAAP and local statutory reporting, with a particular focus on ASC606 compliance. You’ll play a key part in ensuring financial integrity while driving improvements in accounting processes.\n This is a fantastic opportunity to work in a fast-paced, collaborative environment where complex challenges meet continuous learning. You’ll be part of a world-class organisation, surrounded by talented professionals who are passionate about delivering results.\n We are seeking someone who thrives in ambiguity, can prioritise effectively and communicates with clarity. Your ability to engage stakeholders and support Microsoft’s commercial strategy will be essential in delivering revenue outcomes aligned with technical accounting policies.\n Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\nQualifications\nRequired/Minimum Qualifications:\nBachelor's Degree in Business, Accounting/Finance, or related field AND several years of accounting or finance experience OR Master's Degree in Business, Accounting/Finance, or related field AND many years of accounting or finance experience\nAbility to deal with ambiguity and possess excellent problem-solving and collaboration skills.\nPreferred Qualifications:\nProfessional accounting certification such as Association of Chartered Certified Accountants (ACCA) or equivalent.\nSolid technical knowledge of ASC 606 and US GAAP accounting.\nExcellent organizational skills, ability to prioritize competing projects and adhere to deadlines.\nHighly adaptable and able to work in a fast-paced environment while maintaining an emphasis on quality.\nExceptional written and verbal communication skills with demonstrated ability to work effectively across multiple groups, responsive with a dedicated customer service orientation.\n This role requires a 3 days/week office presence.\n Responsibilities\nPreparation of day two revenue accounting for commercial deals ensuring accuracy and compliance with ASC606.\nLead process optimization and transformation initiatives to enhance efficiency and effectiveness.\nCollaborate with and support senior accounting team, fostering a culture of continuous learning and development.\nDevelop and maintain depth and breadth of knowledge over Microsoft products, services and assigned customer relationships.\nTrack and follow up on commitments to ensure customer awareness and compliance with contractual commitments.\nParticipate in cross-team initiatives towards process improvements and efficiencies by incorporating business partner and team feedback and industry best practices.\nIdentify and leverage technology to automate and innovate internal processes.",
    "job_link": "https://jobs.careers.microsoft.com/global/en/job/1873453/Finance-Manager",
    "posted_date": "Sep 10, 2025",
    "company": "MICROSOFT",
    "scraped_at": "2025-09-10T15:25:56.364664"
  },
  {
    "title": "Solution Engineer Cloud & AI for Innovation Hub",
    "location": "Zürich, Switzerland",
    "experience_required": "",
    "job_description": "Overview\nMicrosoft Innovation Hub empowers customers to overcome their business challenges through innovative engagements that integrate multiple areas of expertise. We drive AI transformation by leveraging evolving needs and emerging business opportunities. As the future of technologists and enterprise technical sellers, we guide customers from envisioning solutions to implementation. We deliver the Microsoft value story through immersive experiences, strengthening customer trust through deep engagements in exceptional environments.\n  As a Solution Engineer in the Microsoft Innovation Hub, you will merge business and technical requirements to craft comprehensive solutions, working seamlessly with various stakeholders. You will conduct discovery sessions to understand customer needs and provide strategic recommendations and best practices tailored to their specific needs. Implementing robust AI transformation solutions and optimizing the integration of various technologies and services will be key aspects of your role. Additionally, you will leverage consultancy skills to foster collaboration among technical resources and stakeholders, ensuring alignment and effective teamwork. This role is Microsoft onsite only. \n Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond. \nQualifications\nNumerous years of technical pre-sales or technical consulting experience \nEnterprise Architect Experience: Proven experience as an Enterprise Architect, designing and implementing large-scale, complex solutions that align with business goals and technical requirements. Ability to integrate various technologies and platforms to create cohesive and scalable architectures. \nConsultative Selling: Proven experience in a consultancy role, providing expert guidance and strategic recommendations to customers. Ability to navigate complex technical landscapes and deliver tailored solutions that meet specific customer needs. \nStrategic & Structured Facilitator: Validated customer experience in requirements capture; prioritization; capturing evidence and impact to quantify business value; issue, risk and constraint identification with a focus on strategic goals and outcomes. \nAI Solution Design Experience: Expertise in designing architectures, building, and deploying AI solutions. Experience with cloud and hybrid infrastructures, networking, adjacent technologies, architecture designs, migrations, and industry standards. Understanding of AI related Azure services. \nCertification in relevant technologies or disciplines, e.g.:\nAzure Certifications:  \nAI-102 Azure AI Engineer Associate or  \nAZ-305 Azure Solutions Architect Expert or  \nDP-600 Fabric Analytics Engineer Associate or \nDP-700 Fabric Data Engineer Associate or \nAZ-204 Azure Developer Associate or other domain-relevant certifications from different vendors \nDesign Thinking: Proven experience of delivering design thinking; ‘ideation’; or similar context analysis / problem framing.  \nFluent German highly desirable\n Responsibilities\nDelivering customer engagements: Prepare and deliver technical engagements including strategy sessions, envisioning workshops, architecture design sessions and rapid prototyping to demonstrate key capabilities, validate against identified risks and finalize technology choices. \nAI Transformation Leadership: Be the trusted voice within the business and for customers on the latest AI platform and technology trends, guiding their transformation journeys. By prioritizing AI use cases through design thinking workshops, you will lead these journeys effectively. You will be a valued contributor to Microsoft’s strategy in your area, ensuring the Hub is proactively aligned with the right customers to drive real impact. \nStrategic Vision and Planning: Own and execute a clear strategic vision for AI transformation initiatives on a set of targeted accounts, aligning with organizational goals and customer needs by collaborating and orchestrating cross-functional teams.  \nSolution Design and Architecture: Develop comprehensive solution architectures based on patterns and practices that are tied to customer requirements and ensure that solutions are scalable, secure and optimized for performance. By utilizing consultation skills, you will uncover and prioritize opportunities, ensuing solutions are addressing real customer needs. \nCross Platform Collaboration: Adopt a holistic approach to integrate capabilities across the entire cloud platform, identifying synergies and optimizing cross-platform integration. You will work with your peers and stakeholders to make the Innovation Hub the home of Cross Solution AI Transformation. \nTechnical Depth: Maintain and grow expertise in AI solutions that will include services like AI Foundry or Fabric Data platform. Develop skills in AI management and security, real-time intelligence, and application architecture to support AI transformation initiatives. Stay updated with the market trends and collaborate within technical communities.",
    "job_link": "https://jobs.careers.microsoft.com/global/en/job/1872322/Solution-Engineer-Cloud-%26-AI-for-Innovation-Hub",
    "posted_date": "Sep 10, 2025",
    "company": "MICROSOFT",
    "scraped_at": "2025-09-10T15:25:57.531726"
  },
  {
    "title": "Software Engineer II Backend",
    "location": "Hyderabad, Telangana, India",
    "experience_required": "",
    "job_description": "Overview\nViva Learning is on a mission to empower employees with personalized, integrated learning experiences. As part of our continued investment in secure and scalable learning solutions, we are seeking a Software Engineer II to join our team. This role will focus on strengthening our security posture across data pipelines, telemetry systems, and compliance workflows, especially in response to evolving SFI (Security Future Initiative) requirements and internal security reviews.  \n Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\nQualifications\nRequired Qualifications: \n5+ years of experience in identifying security vulnerabilities, software development lifecycle, large-scale computing, modeling, cyber security, and anomaly detection\n5+ years of experience with coding or scripting in languages such as C#, Python, C++, Go, PowerShell, .NET, Rust, or other comparable programming languages\nStrong understanding of identity and access management concepts, including OAuth, Entra applications, authentication and authorization flows, and service principal configurations\nGood understanding of secure software development practices, including threat modeling, secure coding, and vulnerability remediation. Knowledge of data governance, privacy regulations (e.g., GDPR), and secure data export practices\nExperience with cloud platforms (preferably Azure), data pipelines, and telemetry systems\nFamiliarity with Microsoft’s internal security and compliance frameworks (e.g., SDL, SFI) is a plus\nExcellent collaboration and communication skills, with a track record of working across cross-functional teams\nPreferred Qualifications: \nExperience working on enterprise SaaS products or learning platforms  \nProficiency in scripting or automation for security validation (e.g., PowerShell, Python)\n #DPG #EXP #Viva \nResponsibilities\nImplement and drive security improvements across Viva Learning’s data export and telemetry systems, ensuring compliance with Microsoft’s internal security standards and external regulatory requirements\nCollaborate with engineering and PM teams to address security consult feedback, including remediation of identified gaps and implementation of best practices\nOwn the security review lifecycle for new features and infrastructure changes, including threat modeling, secure design reviews, and privacy assessments\nDevelop and maintain secure data handling processes. Partner with stakeholders across engineering, compliance, and privacy to ensure timely delivery of SFI wave asks and audit readiness\nContribute to the development of automation and tooling to streamline security validation and reporting",
    "job_link": "https://jobs.careers.microsoft.com/global/en/job/1835462/Software-Engineer-II-Backend",
    "posted_date": "Sep 10, 2025",
    "company": "MICROSOFT",
    "scraped_at": "2025-09-10T15:25:58.194654"
  },
  {
    "title": "Research Science: Internship opportunities",
    "location": "Beijing, China + 1 more",
    "experience_required": "",
    "job_description": "Overview\nCome build community, explore your passions and do your best work at Microsoft with thousands of University interns from every corner of the world. This opportunity will allow you to bring your aspirations, talent, potential—and excitement for the journey ahead.  \n As a Research Science Intern, you will conduct research and leads research collaborations that yield new insights, theories, analyses, data, algorithms, and/or prototypes that advance the state-of-the-art of computer science and engineering, as well as general scientific knowledge. You will formulate research problems in an area of study and initiates the design, development, execution and implementation of a research agenda to further academic knowledge and close identified gaps and provide expertise to product or business groups and may create long-term business opportunities through research outcomes, but not responsible for addressing immediate product needs or demonstrating a clear path to product.\n We are seeking candidates excelling in deep thinking research aspects and fast-paced entrepreneurial execution. The ideal candidates should have the ability to work with researchers and product team colleagues at Microsoft to push forward research agendas, being a team player in a collaborative and supportive environment with outstanding programming skills. We are seeking candidates with research skills and technical backgrounds. Applicants should demonstrate depth of knowledge in Natural Language Understanding, Computer Vision, Machine Learning, Algorithmic Foundations of Optimization, Data Mining or Machine Intelligence (Artificial Intelligence) as well as strong academia experience in data processing, experimentation, and modeling.\n Microsoft works with the world’s best researchers, moving with the current of technology as it rapidly evolves. Together we share the motivation to seek innovative solutions to the world’s toughest challenges and improve the lives of people everywhere. Microsoft provides a nurturing environment to support passionate researchers and engineers in AI technology innovation.\n Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\nQualifications\nRequired Qualifications:\nCurrently pursuing a Bachelor/Master/PhD Degree in a relevant field\nMust have at least one additional quarter/semester of school remaining following the completion of the internship\nPreferred Qualifications:\nExperience with one or more general purpose programming languages including: C/C++, Java, MATLAB or Python, ideally languages such as pyTorch, Tensorflow and other deep learning toolkits.\nExperience (classroom or work related) in one or more areas of computer science, such as Natural Language Understanding, Neural Networks, Computer Vision, Machine Learning, Deep Learning, Algorithmic Foundations of Optimization, Data Science, Privacy, etc.\nExperience (classroom or work related) in one or more areas of computer science, such as Natural Language Understanding, Neural Networks, Computer Vision, Machine Learning, Deep Learning, Algorithmic Foundations of Optimization, Data Science, Privacy or other relevant research focuses.\nResponsibilities\nAnalyze and improve performance of advanced algorithms on large-scale datasets and cutting-edge research in machine intelligence and machine learning applications.\nImplement prototypes of scalable systems in AI applications.\nCollaborate closely with team members on developing systems from prototyping to production level.\nDevelop solutions for real world, large-scale problems.\nUnder instruction from others, research new tools, technologies, and methods being used in the research community and contribute your knowledge around a specialized tool/method to support planning for research projects.\nGain an understanding of their research as it relates to Microsoft products or business groups and assists in technology transfer attempts, participating on standards organizations, filing patents, authoring white papers, developing or maintaining tools/services for internal Microsoft use, or consulting for product or business groups.",
    "job_link": "https://jobs.careers.microsoft.com/global/en/job/1846506/Research-Science%3A-Internship-opportunities",
    "posted_date": "Sep 10, 2025",
    "company": "MICROSOFT",
    "scraped_at": "2025-09-10T15:25:58.843448"
  },
  {
    "title": "Software Engineer II",
    "location": "Hyderabad, Telangana, India",
    "experience_required": "",
    "job_description": "Overview\nMicrosoft is a company where passionate innovators come to collaborate, envision what can be and take their careers further. This is a world of more possibilities, more innovation, more openness, and the sky is the limit thinking in a cloud-enabled world.\n\nMicrosoft’s Azure Data engineering team is leading the transformation of analytics in the world of data with products like databases, data integration, big data analytics, messaging & real-time analytics, and business intelligence. The products our portfolio include Microsoft Fabric, Azure SQL DB, Azure Cosmos DB, Azure PostgreSQL, Azure Data Factory, Azure Synapse Analytics, Azure Service Bus, Azure Event Grid, and Power BI. Our mission is to build the data platform for the age of AI, powering a new class of data-first applications and driving a data culture.\n Within Azure Data, the data integration team builds data gravity on the Microsoft Cloud. Massive volumes of data are generated – not just from transactional systems of record, but also from the world around us.  Our data integration products – Azure Data Factory and Power Query make it easy for customers to bring in, clean, shape, and join data, to extract intelligence.\nMicrosoft’s Azure Data engineering team is leading the transformation of analytics in the world of data with products like databases, data integration, big data analytics, messaging & real-time analytics, and business intelligence. The products our portfolio include Microsoft Fabric, Azure SQL DB, Azure Cosmos DB, Azure PostgreSQL, Azure Data Factory, Azure Synapse Analytics, Azure Service Bus, Azure Event Grid, and Power BI. Our mission is to build the data platform for the age of AI, powering a new class of data-first applications and driving a data culture.\n\nWe do not just value differences or different perspectives. We seek them out and invite them in so we can tap into the collective power of everyone in the company. As a result, our customers are better served.\nQualifications\n Required/Minimum Qualifications:\nBachelor's Degree in Computer Science, or related technical discipline\n4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience.\nExperience in data integration or migrations or ELT or ETL tooling.\nPreferred/Additional Qualifications:\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check:\nThis position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\nOther Requirements:\n Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check:\nThis position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\n   #azdat\n#azuredata\n#azdat #azuredata #microsoftfabric #dataintegration\n #BRAVOFY26\nResponsibilities\n• Build cloud scale products with focus on efficiency, reliability and security.\n• Build and maintain end-to-end Build, Test and Deployment pipelines.\n• Deploy and manage massive Hadoop, Spark and other clusters.\n• Contribute to the architecture & design of the products.\n• Triaging issues and implementing solutions to restore service with minimal disruption to the customer and business. Perform root cause analysis, trend analysis and post-mortems.\n• Owning the components and driving them end to end, all the way from gathering requirements, development, testing, deployment to ensuring high quality and availability post deployment.\n Embody our culture and values",
    "job_link": "https://jobs.careers.microsoft.com/global/en/job/1829418/Software-Engineer-II",
    "posted_date": "Sep 10, 2025",
    "company": "MICROSOFT",
    "scraped_at": "2025-09-10T15:25:59.478198"
  },
  {
    "title": "Technical Support Engineer - Azure Identity (English Language Support)",
    "location": "Multiple Locations, Japan",
    "experience_required": "",
    "job_description": "Overview\n[Purpose / 概要] \n『お客様がより多くのことを達成できるようにする』私たちの企業ミッションを、Azure Identity サポート チームのエンジニアとして一緒に実現しませんか ? \n 安心してクラウド サービスをご利用いただくには、私たちが日々サポートしている “認証基盤技術” がライフラインとなります。Microsoft 365 / Office 365 をはじめとする Microsoft のクラウド サービスの認証基盤は、Microsoft Entra ID (Azure Active Directory)  が支えています。私たち Azure Identity サポート チームは、この Microsoft Entra ID (Azure Active Directory) はもちろん、オンプレミスの認証基盤である Active Directory を含め、クラウドと連携する認証システム全般に関わる技術サポートを提供しています。 \n また本ポジションでは、世界中のお客様をサポートする機会があり、語学力を活かしたグローバル タレントとしてご活躍いただけます。\n [Message from Manager / マネージャーより] \nお客様の喜びを自らの喜びと感じられるマインドの方なら非常に達成感の大きい仕事です。また、マイクロソフトの製品/サービス、クラウドの認証基盤に関するより深い知識を身につけたいと考えている技術的探究心の強い方にとっては最高の学びの場です。サポート サービスを通して、弊社製品/サービスを利用してくださってお問い合わせいただくお客様に、よりすばらしい経験をしていただき “喜んでもらう” ことを日々の目標として掲げています。そのため単に技術的に問題解決するに留まりません。お客様の問題をお客様以上に理解し、プロアクティブに提案する能力が要求されます。お客様に対するパッションと技術に対するパッションあふれる仲間 (エンジニア) と一緒に、日々刺激を受け自らの成長を実感しながら、素晴らしいサポート サービスをお客様に提供したいという想いに共感できる方のご応募、お待ちしております。 \n (( 参考 )) \nAzure カスタマー サービスが支持される理由 (ZDNet Japan, 2018 March) \nhttps://aka.ms/AzureEngineer\n 日本マイクロソフト サポート情報 = Azure Identity サポート チーム \nhttps://aka.ms/jsupport\n Japan Azure ID Support - Microsoft Azure AD code samples and examples in PowerShell / GitHub \nhttps://github.com/jpazureid\n 日本マイクロソフトの福利厚生や社員インタビューが掲載されたキャリア採用情報は、下記URLよりご確認下さい。\nhttps://www.microsoft.com/ja-jp/mscorp/mid-career/default.aspx\n Qualifications\n[Required Skills / 応募資格 必須] \nPassion for our technologies and passion for our customers/partners\nExcellent communication skills, collaboration skills, self-motivation and must have a strong team spirit\nDemonstrate logical and critical thinking, strong communication skills and ability to develop strategic on-going customer relationships\nPossess deep technical expertise in at least one technical specialty and can solve complex technical problems through tangible, creative troubleshooting\nMinimum of 3 years IT experience and demonstrate aptitude for providing superior customer service in politically charged environment\n [Preferred Skills / 応募資格 尚可] \nStrong knowledge of Microsoft Windows Servers and Client Operating Systems. \nUnderstanding of Microsoft Cloud (Azure/Office 365) and Windows Server products or other application server product family, especially Microsoft Azure AD, AD FS etc. \nKnowledge related to OAuth, OpenID Connect, WS-Federation and SAML. \nTroubleshooting skills in network and DNS. \nTroubleshooting skills in AD FS (Active Directory Federation Services). \nTroubleshooting skills on at least one of the Microsoft Synchronization Engines, FIM/MIM, DirSync, AADSync or AAD Connect. \n [Important Notices / 留意事項] \nSupport of critical cases may arise outside of standard working hours on an as-needed basis (1-2 times per month).\nMay require weekend coverage (1 - 2 times per year)\nIf required, occasional domestic and international travel\n [Language Skills Required / 語学力] \nBoth Japanese and English (See details below) \nJapanese: Business Level-Fluent / ビジネス文書 (報告書作成、メール)、電話対応、日本チーム内でのコミュニケーションが求められます。\nEnglish: Conversational-Business Level / ビジネス文書 (報告書作成、メール)、英語での電話対応、英語でのお客様コミュニケーションが求められます。\n By applying to this role, you will be considered for additional roles with similar qualifications.\n Ability to meet Microsoft, customer and / or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire / transfer and every two years thereafter.\n Responsibilities\nクラウドの認証基盤である Microsoft Entra ID (Azure Active Directory) 、 Microsoft Entra ID (Azure Active Directory)  と連携する Active Directory Federation Service を担当する、Azure Identity サポート チームのサポート エンジニアを募集しています。 \nBe available to take ownership of new cases and escalations via telephone and Web and provide support to Enterprise customers and partners - Scope a customer’s issue by collecting the relevant facts; investigate the problem by doing your own research and by involving other teams as needed. \nConsult and collaborate with your immediate peers or colleagues around the world. Escalate to management as necessary, acting internally as a customer advocate and keeping the customers informed. Collaborate with management and engineering to resolve service issues. \nEnsure that each support request owned by you is handled as per our Service Level Agreement (SLA) and to the highest possible customer satisfaction by setting the right expectations and fulfilling your commitments. \nDocument your technical work and research in detailed and comprehensive manner. - Prioritize your work to accomplish the most important and urgent requests first. Support of critical cases may arise outside of standard working hours on an as-needed basis (1-2 times per month).\nMaintain a proactive approach to customer happiness, identifying and correcting customer satisfaction concerns before they become problems.",
    "job_link": "https://jobs.careers.microsoft.com/global/en/job/1845944/Technical-Support-Engineer---Azure-Identity-(English-Language-Support)",
    "posted_date": "Sep 10, 2025",
    "company": "MICROSOFT",
    "scraped_at": "2025-09-10T15:26:00.628899"
  },
  {
    "title": "Solution Engineer - AI Business Solutions (Sales and Service)",
    "location": "Riyadh, Saudi Arabia",
    "experience_required": "",
    "job_description": "Overview\nAre you passionate about helping organizations transform how they sell and serve their customers using AI? At Microsoft, reimagining business processes is a key driver of cloud innovation. Our mission is to empower customers to digitally transform their operations—unlocking new revenue streams, enhancing customer engagement, and improving profitability. As a digital AI Business Solution Engineer, you’ll play a pivotal role in guiding customers through their transformation journey. You’ll lead technical engagements, design and demonstrate solutions that deliver business value, and collaborate across sales, partner, and customer success teams to drive impactful outcomes.\n As an AI Business Solution Engineer, you’ll be a trusted technical advisor to business and IT leaders. You’ll help them explore how Microsoft technologies—such as Dynamics 365 Sales, Customer Service, Contact Center, Field Service, and Copilot Studio—can improve efficiency, responsiveness, and customer satisfaction.\n You’ll lead the technical side of engagements, from initial conversations and demos to workshops and proof-of-concepts. Your goal is to help customers understand what’s possible, remove roadblocks, and guide them toward successful adoption of modern, AI-powered solutions.\nThis opportunity will allow you to:\nAccelerate your career in AI and business applications.\nDevelop deep technical and business acumen.\nHone your skills in customer engagement and solution design.\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. We come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\nQualifications\nProven impact in technical sales or solution engineering, with a track record of driving customer success through innovative solutions.\nDeep knowledge of Dynamics 365 Sales and Service, paired with hands-on familiarity with Copilot Studio to deliver intelligent, AI-powered experiences.\nExceptional communication skills, with the ability to build trust and influence decision-makers across both business and IT landscapes.\nConfident facilitator of demos, workshops, and technical conversations, capable of translating complex concepts into clear value.\nCollaborative mindset, thriving in cross-functional environments and working seamlessly with partners to achieve shared goals.\nEducational foundation in Computer Science, Information Technology, or a related field:\nMaster’s Degree + solid experience in technical pre-sales or consulting, OR\nBachelor’s Degree + extensive experience in technical pre-sales or consulting, OR\nEquivalent practical experience that demonstrates strong technical and customer-facing capabilities.\nResponsibilities\nOwn the technical strategy for sales and service opportunities.\nDeliver tailored demos and solution presentations that address real business challenges.\nLead workshops, whiteboarding sessions, and proof-of-concepts to help customers envision new ways of working.\nHelp customers understand how AI tools like Copilot and pre-built agents fit into their security, governance, and compliance frameworks.\nIdentify and remove technical blockers to accelerate solution adoption.\nConduct solution assessments and migration planning aligned with business goals.\nShowcase how Microsoft solutions outperform competitors \nCollaborate with partners early to scale technical engagement and ensure full coverage.\nDocument technical plans and ensure smooth handoffs to implementation and support teams.\nKeep engagements on track with clear technical close plans and partner involvement.\nEscalate unresolved technical issues through the right engineering channels.\nPromote support services to help customers adopt solutions faster and more effectively.",
    "job_link": "https://jobs.careers.microsoft.com/global/en/job/1862540/Solution-Engineer---AI-Business-Solutions-(Sales-and-Service)",
    "posted_date": "Sep 10, 2025",
    "company": "MICROSOFT",
    "scraped_at": "2025-09-10T15:26:01.272350"
  },
  {
    "title": "Solution Engineer AI Business Solutions (Finance & Supply Chain)",
    "location": "Riyadh, Saudi Arabia",
    "experience_required": "",
    "job_description": "Overview\nJoin a high-performing Area HQ team driving AI innovation across strategic growth markets in Middle East and Africa. As a Solution Engineer for Finance & Supply Chain, you'll lead remote pre-sales engagements, shaping outcomes for enterprise customers with deep ERP expertise and a strong focus on AI transformation.\n You’ll collaborate with specialists, partners, and engineering teams to deliver compelling demos, workshops, and technical strategies that showcase the value of D365 F&SC, Copilot Studio, and AI Agents. Your work will help accelerate deal velocity, secure competitive wins, and support enterprise-wide adoption.\n This role is ideal for someone passionate about guiding organizations through digital transformation—enhancing productivity, unlocking new opportunities, and delivering exceptional experiences through AI-powered solutions.\n Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\nQualifications\nRequired Qualifications\nProven experience in enterprise solution engineering or technical sales roles.\nTrack record of owning technical win strategies and leading complex customer engagements\nRecognized as a trusted advisor and thought leader; actively contributes to community learning and cross-team coaching of junior engineers.\nProven years technical pre-sales or technical consulting experience\nOR Bachelor's Degree in Computer Science, Information Technology, or related field AND a few years technical pre-sales or technical consulting experience OR Master's Degree in Computer Science, Information Technology, or related field AND a couple years technical pre-sales or technical consulting experience OR equivalent experience\nProfessional English proficiency;\nProficiency in Modern Standard Arabic (MSA) is preferred\n Preferred Qualifications\nSolutions pre-sales best practices including but not limited to; discovery, building and crafting solution strategies that differentiate from the competition, value-based selling, identifying, and expanding product opportunities\nProven years experience with cloud and hybrid, or on premises infrastructures, architecture designs, migrations, industry standards, and/or technology management.\nDeep Understanding of Sales and Service Dynamics 365 solutions like Finance, Supply Chain, Project Operations, and AI Agents offerings like Copilot Studio\nCertification in relevant technologies or disciplines (e.g., D365, Power Platform).\nResponsibilities\nOwns the technical win strategy for each opportunity. Engage with Business Decision Makers (BDMs) and Technical Decision Makers (TDMs) to translate their priorities and goals to solution vision by addressing business challenges, prioritized with business value and by leveraging deep Dynamics 365 F&SC expertise to secure technical decisions.\nOrchestrates customer envisioning workshops, whiteboard design sessions, and compelling technical demos across Dynamics 365 F&SC, Copilot Studio, AI Agents. \nLeads proof-of-Concept engagements for high-priority scenarios, documenting POC outcomes and mapping customer solution requirements. Translate these findings into detailed technical plans – including migration pathways to D365, recommended migration tools – with clear milestones and risk mitigation strategies, captured in a Technical Close Plan for seamless hand-off to SI partners.\nShowcases Microsoft’s unique value in AI-powered business process D365 solutions to win technical decisions against major competitors. Anticipate and address technical blockers – such as AI-related compliance, privacy, or security concerns – early in the sales process, developing mitigation plans that instill confidence in D365 solutions.\nLeverages the Microsoft partner ecosystem to enhance and scale solution delivery from early stages to assist with complex demos, POCs, and solution builds, ensuring their industry or domain expertise complements the sales strategy. Orchestrate co-selling and co-innovation with partners.\nWorks closely with the Customer Success Unit (CSU) and deployment teams to ensure customers realize value from their Dynamics 365 investments. Secure a clear deployment plan for every deal, including agreed success metrics and adoption milestones. Drive early adoption of high-value, consumption-based features like Copilot Studio and Dynamics 365 AI Agents by capturing usage intent during pre-sales and incorporating it into the Technical Close Plan.",
    "job_link": "https://jobs.careers.microsoft.com/global/en/job/1862534/Solution-Engineer-AI-Business-Solutions-(Finance-%26-Supply-Chain)",
    "posted_date": "Sep 10, 2025",
    "company": "MICROSOFT",
    "scraped_at": "2025-09-10T15:26:02.416367"
  },
  {
    "title": "Research Science: Internship opportunities",
    "location": "Singapore",
    "experience_required": "",
    "job_description": "Overview\nCome build community, explore your passions and do your best work at Microsoft with thousands of University interns from every corner of the world. This opportunity will allow you to bring your aspirations, talent, potential—and excitement for the journey ahead.   \n Microsoft Research Asia (MSRA) is now poised to extend roles into Singapore and looking for research interns in Foundation Model innovations (LLM, vision, multi-modality, etc.), Deep Learning and Reinforcement Learning Foundation, Industrial AI application (e.g., AI for Healthcare, Embodied AI and Robotics, etc.). \nAs a Research Science Intern, you will conduct research and leads research collaborations that yield new insights, theories, analyses, data, algorithms, and/or prototypes that advance the state-of-the-art of computer science and engineering, as well as general scientific knowledge. You will formulate research problems in an area of study and initiates the design, development, execution and implementation of a research agenda to further academic knowledge and close identified gaps and provide expertise to product or business groups and may create long-term business opportunities through research outcomes, but not responsible for addressing immediate product needs or demonstrating a clear path to product. \n  We are seeking candidates excelling in deep thinking research aspects and fast-paced entrepreneurial execution. The ideal candidates should have the ability to work with researchers and product team colleagues at Microsoft to push forward research agendas, being a team player in a collaborative and supportive environment with outstanding programming skills. We are seeking candidates with research skills and technical backgrounds. Applicants should demonstrate depth of knowledge in Natural Language Understanding, Computer Vision, Machine Learning, Algorithmic Foundations of Optimization, Data Mining or Machine Intelligence (Artificial Intelligence) as well as strong academia experience in data processing, experimentation, and modeling.  \nMicrosoft works with the world’s best researchers, moving with the current of technology as it rapidly evolves. Together we share the motivation to seek innovative solutions to the world’s toughest challenges and improve the lives of people everywhere. Microsoft provides a nurturing environment to support passionate researchers and engineers in AI technology innovation. \nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond. \nQualifications\nRequired Qualifications: \nCurrently pursuing a Bachelor’s, Master’s, or PhD degree in a relevant field (e.g., Computer Science, Electrical Engineering, Mathematics, or related disciplines). \nMust have at least one additional quarter/semester of school remaining following the completion of the internship. \nProficiency in one or more general-purpose programming languages, particularly Python. \nFamiliarity with deep learning frameworks such as PyTorch, TensorFlow, or similar toolkits. \nHands-on experience with training and/or inference of large-scale models, including Large Language Models (LLMs) and/or Vision-Language Models (VLMs) and/or diffusion models. \n Other Requirements： \nAvailable to work full-time (5 days/week) for a minimum of six months. \n Preferred Qualifications: \nCurrently enrolled in a PhD program in a relevant field. \nDemonstrated academic experience, including publications in top-tier conferences or journals, in one or more of the following areas: \nNatural Language Understanding \nComputer Vision \nMachine Learning and Deep Learning \nReinforcement Learning \nLarge Language Model or Generative AI \n  Responsibilities\nAnalyze and improve performance of advanced algorithms on large-scale datasets and cutting-edge research in machine intelligence and machine learning applications. \nImplement prototypes of scalable systems in AI applications. \nCollaborate closely with team members on developing systems from prototyping to production level. \nDevelop solutions for real world, large-scale problems. \nUnder instruction from others, research new tools, technologies, and methods being used in the research community and contribute your knowledge around a specialized tool/method to support planning for research projects. \nGain an understanding of their research as it relates to Microsoft products or business groups and assists in technology transfer attempts, participating on standards organizations, filing patents, authoring white papers, developing or maintaining tools/services for internal Microsoft use, or consulting for product or business groups.",
    "job_link": "https://jobs.careers.microsoft.com/global/en/job/1860658/Research-Science%3A-Internship-opportunities",
    "posted_date": "Sep 10, 2025",
    "company": "MICROSOFT",
    "scraped_at": "2025-09-10T15:26:03.077129"
  },
  {
    "title": "Cloud Solution Architecture",
    "location": "Berlin, Germany",
    "experience_required": "",
    "job_description": "Overview\nThere has never been a more exciting time to be working in healthcare at Microsoft. Our Health & Life Sciences Solutions organization is an interdisciplinary team of product managers, designers, engineers, and clinicians who are designing, developing and deploying next-generation healthcare solutions powered by the Microsoft Cloud for healthcare organizations around the world.  \n\nAs a Cloud Solution Architect, you will be an integral member of a team within HLS Solutions that is working to empower clinicians to achieve more with groundbreaking healthcare-oriented copilots. The ideal candidate will be excited about waking up every morning to apply their skills in project management, Instructional design and delivery, training, change management and user engagement to deploying new technologies and experiences centered around driving positive healthcare outcomes. \n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond. \nQualifications\nRequired/minimum qualifications\nBachelor's Degree in Computer Science, Information Technology, Engineering, or related field AND experience in cloud/infrastructure technologies, information technology (IT) consulting/support, systems administration, network operations, software development/support, technology solutions, practice development, architecture, and/or consulting OR equivalent experience.\nGerman and English speaking\nAdditional or preferred qualifications\nExperience working in a customer-facing role (e.g., internal and/or external).\nExperience working on technical projects.\nTechnical Certification in Cloud (e.g., Azure, Amazon Web Services, Google, security certifications).\nResponsibilities\nDelivers efficient, seamless customer and partner experiences with minimal supervision. Understands customer goals and helps define success criteria. Addresses dissatisfaction proactively and may assist in implementing strategies to enhance experience, value, and transformation.\nIdentifies, escalates, and mitigates blockers to speed up solution deployment and value realization with minimal oversight. Develops and applies business, technical, or industry knowledge to architecture or support projects, addressing IT requirements and constraints with little guidance.\nIdentifies and communicates delivery gaps to teams and stakeholders, links patterns across business and technology to drive product or process improvements, and helps scale solutions with minimal guidance. May also assist in developing or updating Microsoft's frameworks and methodologies.\nProactively identifies opportunities for Consumption, Usage, and Unified expansion by aligning Microsoft solutions with customer needs to support cloud success, security, resiliency, and AI innovation. Engages customers and partners through active listening and constructive feedback, advocating for alternative solutions that better meet their requirements. Monitors industry trends and gathers insights to align architectures with business objectives. Records and executes on opportunities collaboratively using Microsoft's Customer Engagement Model.",
    "job_link": "https://jobs.careers.microsoft.com/global/en/job/1871631/Cloud-Solution-Architecture",
    "posted_date": "Sep 10, 2025",
    "company": "MICROSOFT",
    "scraped_at": "2025-09-10T15:26:03.709542"
  },
  {
    "title": "Solution Engineer AI Business Solutions (Copilot)",
    "location": "Dubai (MEA-HQ), Dubai, United Arab Emirates",
    "experience_required": "",
    "job_description": "Overview\nOur purpose is to empower organizations to transform the way they work by harnessing the full potential of artificial intelligence. We guide customers through the evolving digital landscape, enabling them to unlock new opportunities, enhance productivity, and deliver exceptional employee and customer experiences. By integrating advanced AI capabilities across devices, cloud platforms, and everyday business applications, we help organizations realize seamless, innovative, and secure solutions that drive sustained growth and success in the AI era.\n  As a Copilot Solution Engineer, you will play a critical role in accelerating AI transformation in Majors Growth segment by leading technical engagements that drive customer adoption of Microsoft 365 Copilot, Copilot Studio & Agents, and related AI-powered productivity solutions. This role is deeply technical and is responsible for owning the technical win strategy, delivering compelling demonstrations, and guiding customers through envisioning sessions that align with their business goals and technical requirements. As a trusted advisor, the Copilot Solution Engineer ensures that governance, security, and compliance are embedded in every conversation to build confidence and drive decision-making. \n In addition to technical leadership, the Copilot Solution Engineer is accountable for driving core business momentum through competitive differentiation, technical blocker resolution, and seamless handoffs to deployment teams. You will work within a virtual team of technical, partner and consulting resources to help educate your customers at a technical level, demonstrate, and prove our solutions, and win the technical decision allowing the team to achieve/exceed quarterly targets in your accounts.  The role emphasizes operational excellence, partner collaboration, and continuous learning to ensure scalable impact and sustained customer success. This is a high-impact opportunity for individuals passionate about shaping the future of work through AI and delivering measurable business outcomes. \n Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\nQualifications\nRequired/minimum qualifications\nBachelor's/Masters Degree in Computer Science, Information Technology, or related field AND 4+ years of experience in technical pre-sales, solution architecture, or consulting roles.\nL200 consultative and L400 technical certifications (or equivalent experience).\nAdditional or preferred qualifications\n6+ years technical pre-sales, technical consulting, or technology delivery, or related experience\nOR equivalent experience\n4+ years experience with cloud and hybrid, or on premises infrastructures, architecture designs, migrations, industry standards, and/or technology management\nCertification in relevant technologies or disciplines (e.g., Office 365, Power BI, Azure Architect and Development exams, Cloud Platform Technologies, Information Security, Architecture)\nM365 Copilot and Copilot Studio hands-on experience\n Responsibilities\nMaintain expert-level knowledge in Microsoft 365 Copilot, Copilot Studio & Agents, and AI-powered productivity solutions, and apply it to lead technical engagements with customers.\nIndependently deliver discovery, demo, and whiteboarding sessions that align with customer business goals and technical readiness.\nBuild competitive strategy by identifying product differentiators and proactively addressing objections to win technical decisions.\nLead solution design and PoC efforts by reframing customer challenges, quantifying business impact, and demonstrating Microsoft’s value in complex selling environments.\nKnow when and how to escalate blockers, push back on misaligned objections, and guide customers through resolution paths.\nEngage in partner sell-with scenarios by co-owning technical execution and acting as a trusted source of partner knowledge.",
    "job_link": "https://jobs.careers.microsoft.com/global/en/job/1862528/Solution-Engineer-AI-Business-Solutions-(Copilot)",
    "posted_date": "Sep 10, 2025",
    "company": "MICROSOFT",
    "scraped_at": "2025-09-10T15:26:04.343780"
  },
  {
    "title": "Solution Engineer AI Business Solutions (Power Platform)",
    "location": "Dubai (MEA-HQ), Dubai, United Arab Emirates",
    "experience_required": "",
    "job_description": "Overview\nAs a Digital Solution Engineer, you will work closely with sales teams to understand the customer's needs, goals, and challenges, and showcase how Dynamics 365 / Power Platform can help them in their transformation. You will also provide reassurance throughout the sales cycle, ensuring that the proposed solution meets the customer's requirements and expectations. By combining your technical knowledge, communication skills, and customer focus, you will be able to inspire and influence customers to choose Microsoft AI Business Solutions.\n The mission of Microsoft AI Business Solutions is to help our customers digitally transform their businesses to drive new sources of revenue, create new and engaging ways to serve their customers, and to transform the way in which their business runs to drive new levels of profitability for their organization. With the power of AI, our solutions enable customers to leverage data insights, automate processes, personalize experiences, and innovate with agility.\n You will have the chance to develop your career in a dynamic and supportive environment. You will embrace a growth mindset and learn from feedback, coaching, and mentoring. You will be encouraged to share your authentic self and bring your unique perspectives and ideas to the table. You will be part of a diverse and inclusive team that values collaboration, innovation, and customer success, enabling you to accelerate your career growth, develop deep business acumen and develop your selling skills.\nIn this role you will be the Solution Engineer (pre-sales consultant) for your assigned workload (Finance & Supply Chain) and a member of the sales team that consists of Solution Specialist, Customer Success Unit, partners, and engineering.\n In this role you will advance pipeline by assisting the Digital Solution Specialist in qualifying the deal, developing the strategy and inspiring the CxO/Business Decision Maker/Technical Decision Maker.  You are responsible for designing the solution and delivering an industry-aligned demonstration to the customer. Highlighting how advancements in AI can provide benefit to an organization.\n You will engage partners for co-sell and implementation considerations, engineering to assist with emerging technologies and Customer Success Unit for deal support.  We focus on solving the technical proof requirements while highlighting our business value and competitive differentiators and should result in securing the customer’s solution design endorsement. Once the solution design is secured, you will support the Digital Solution Specialist in finalizing the customer proposal and assisting with licensing.\nYou will develop relationships with the decision makers with our customers and position yourself as a trusted advisor in your domain. As a recognized product expert, you are responsible for sharing your technical, industry knowledge and best practices with your peers.\n Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\nQualifications\nTechnical pre-sales or technical consulting, or related experience OR equivalent experience.\nExperience with cloud and hybrid, or on premises infrastructures, architecture designs, migrations, industry standards, and/or technology management.\nRelated experience:\nSolution pre-sales for business applications and/or SaaS-based company or similar technology with a focus on Contact Centre solutions and / or Conversational AI.\nSolutions pre-sales best practices including but not limited to; discovery, building and crafting solution strategies that differentiate from the competition, value-based selling, identifying, and expanding product opportunities.\nAbility to drive and influence stakeholders across organizational boundaries through organizational, presentation, envisioning, writing, and verbal communication skills.\nProven track record in prioritization and orchestration of resources for complex customer digital transformation engagements.\nDeep understanding of:\nBusiness application solutions\nCommercial cloud offerings, ideally Microsoft’s cloud platform as well as competitive knowledge of other business applications and related ecosystems.\nBusiness value selling methodologies and practices that successfully convey the value and business outcomes\nHow to uncover customer’s stated and unstated needs and how technology can be leveraged to solve business problems.\nHigh level of self-awareness, reflection, and empathy.\nAbility to skillfully communicate, demonstrate, and prove the value of Dynamics 365 Business Applications.\nProven collaborator capable of influencing internal and external teams.\nExcellent presentation and communications skills across various customer stakeholders, e.g., CIO, CFO, CMO, VP of Sales, etc.\nResponsibilities\nAdvance qualified pipeline revenue by demonstrating solution capabilities, addressing technical proof requirements, and securing the customer’s solution design endorsement.\nEngage with the account team to land solution envisioning sessions and business value assessments.\nProactively deliver compelling customer centric solution demonstrations based on technical workload expertise while building Business Decision Maker/CxO/Technical Decision Maker connections.\nAddress solution architecture considerations and competitive objection handling.\nAssist in formalizing the customer proposal.\nCollaborate with Partners and Customer Success to align on agreed upon deployment plan and Key Performance Indicators.\nLead discovery sessions in each opportunity, yielding output of customer-agreed business challenges and win themes prioritized with business value.",
    "job_link": "https://jobs.careers.microsoft.com/global/en/job/1862530/Solution-Engineer-AI-Business-Solutions-(Power-Platform)",
    "posted_date": "Sep 10, 2025",
    "company": "MICROSOFT",
    "scraped_at": "2025-09-10T15:26:04.982285"
  },
  {
    "title": "Solution Engineer - Security",
    "location": "Dubai, United Arab Emirates",
    "experience_required": "",
    "job_description": "Overview\nAre you passionate about cybersecurity?  Do you enjoy working on a high-performing, fast-paced sales team?  Are you insatiably curious and do you lean into uncertainty, take risks, and learn quickly from your mistakes? If so, we are looking for you!\n Microsoft is on a mission to empower every person and every organization on the planet to achieve more. Our culture is centered on embracing a growth mindset, a theme of inspiring excellence, and encouraging teams and leaders to bring their best each day. In doing so, we create life-changing innovations that impact billions of lives around the world. You can help us to achieve our mission.\nMicrosoft continues to invest by quadrupling its cybersecurity investment to $20 billion over the next five years, to provide its customers with solutions that integrate across the ecosystem by connecting all of your identities, endpoints, apps, emails, docs and clouds to help you close critical gaps in coverage, reduce risk, and save costs with a streamlined security portfolio.  With thousands of global security experts worldwide and the cutting edge AI- based Security innovations, Microsoft is ideally placed to think outside of the box and protecting customers, and partners around the world.\nWe are looking for a passionate, experienced, and credible security solution engineer to join our MEA HQ  team.  We are committed to diversity and inclusion and provide resources and support to everyone on our team.\nQualifications\nScale Customer Engagements: Remediates blockers; leads and ensures technical wins for Microsoft Security and adjacent technologies. Engages with and reaches out to customers proactively and independently; builds credibility with customers as a trusted advisor for Microsoft Security; and searches for and uses Microsoft Security customer references.\nScale Through Partners: Engages in partner sell-with scenarios and supports partner technical capacity.\nBuild Strategy: Contributes to Microsoft Security strategy development, shapes strategic win plan and tailors Microsoft messaging to audience for security opportunities. Enhances team capabilities for extended detection and response (XDR), zero trust and cloud security and develops compete strategies for Microsoft Security for assigned customers.\nSolution Design & Proof: Demonstrates and oversees demonstrations, presents and applies architecture patterns, proves capabilities and integration into customer environment, and drives cross-workload support for Microsoft solutions for security. Coaches team in addressing customer digital transformation and leveraging insights to align new or changing technology to customer security needs.\nEducation: Builds their own readiness plan and grows extended detection and response (XDR), zero trust and cloud security space domain knowledge and practices expertise. Acts as a mentor for Microsoft Security, its integration with other Microsoft products & services, and Microsoft Security solutions generally; and increases internal virtual teams' understanding of extended detection and response (XDR), zero trust and cloud security  space solutions and new opportunities.\nResponsibilities\nAs a Security Solution Engineer, your primary goal is to win the technical decision of customers to purchase and use our range of security-focused solutions including Microsoft M365 Defender, Defender for Cloud and Sentinel\nYou will work within a virtual team of technical, partner and consulting resources to educate your customers at a technical level, demonstrate and prove our solutions, and win the technical decision, allowing the team to achieve/exceed quarterly Microsoft Security sales/usage targets in your accounts in Majors Growth. Being part of this team will allow you to maintain and develop your deep technical expertise across Microsoft and non-Microsoft cloud-based security solutions, architectures, programs, and technologies.",
    "job_link": "https://jobs.careers.microsoft.com/global/en/job/1862543/Solution-Engineer---Security",
    "posted_date": "Sep 10, 2025",
    "company": "MICROSOFT",
    "scraped_at": "2025-09-10T15:26:05.596938"
  },
  {
    "title": "Cloud Solution Architecture IC4",
    "location": "Berlin, Germany",
    "experience_required": "",
    "job_description": "Overview\nThere has never been a more exciting time to be working in healthcare at Microsoft. Our Health & Life Sciences Solutions organization is an interdisciplinary team of product managers, designers, engineers, and clinicians who are designing, developing and deploying next-generation healthcare solutions powered by the Microsoft Cloud for healthcare organizations around the world.  \n\nAs a Cloud Solution Architect, you will be an integral member of a team within HLS Solutions that is working to empower clinicians to achieve more with groundbreaking healthcare-oriented copilots. The ideal candidate will be excited about waking up every morning to apply their skills in project management, Instructional design and delivery, training, change management and user engagement to deploying new technologies and experiences centered around driving positive healthcare outcomes. \n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond. \nQualifications\nRequired/minimum qualifications\nBachelor's Degree in Computer Science, Information Technology, Engineering, or related field AND experience in Health/Life Sciences industries: cloud/infrastructure technologies, information technology (IT) consulting/support, systems administration, network operations, software development/support, technology solutions, practice development, architecture, and/or consulting OR equivalent experience.\nGerman and English speaking\nAdditional or preferred qualifications\nExperience working in a customer-facing role (e.g, internal and/or external).\nExperience working on technical projects.\nTechnical Certification in Cloud (e.g., Azure, Amazon Web Services, Google, security certifications).\nResponsibilities\nIdentifies, escalates, and mitigates blockers to speed up solution deployment and value realization with minimal oversight. Develops and applies business, technical, or industry knowledge to architecture or support projects, addressing IT requirements and constraints with little guidance.\nDelivers efficient, seamless customer and partner experiences with minimal supervision. Understands customer goals and helps define success criteria. Addresses dissatisfaction proactively and may assist in implementing strategies to enhance experience, value, and transformation.\nIdentifies and communicates delivery gaps to teams and stakeholders, links patterns across business and technology to drive product or process improvements, and helps scale solutions with minimal guidance. May also assist in developing or updating Microsoft's frameworks and methodologies.\nEmbody our culture (https://careers.microsoft.com/v2/global/en/culture) and values (https://www.microsoft.com/en-us/about/corporate-values).",
    "job_link": "https://jobs.careers.microsoft.com/global/en/job/1871640/Cloud-Solution-Architecture-IC4",
    "posted_date": "Sep 10, 2025",
    "company": "MICROSOFT",
    "scraped_at": "2025-09-10T15:26:06.232448"
  },
  {
    "title": "Software Engineering",
    "location": "Hyderabad, Telangana, India",
    "experience_required": "",
    "job_description": "Overview\nAre you a customer-obsessed, AI-curious problem-solver who thrives in an inclusive, collaborative global team? The Azure CXP team’s mission is to transform Microsoft Cloud customers into fans. Through our deep engineering engagements with customers and teams across Microsoft, we analyze and amplify customer needs and drive the vision to improve Cloud quality, security, and reliability. Our culture of growth mindset and empowerment are central to who we are and how we work.  \nWe are customer-obsessed problem-solvers. We orchestrate deep engagements in areas like incident management, support, and enablement. We analyze and amplify those customer voices, both within our own team, and across the Cloud + AI team, bringing the customer connection to the Quality vision for Azure. We innovate ways to scale what we learn across our customer base.  Diversity and inclusion are central to who we are, how we work, and what we enable our customers to achieve. We know that empowering our customers starts with empowering our team to show up authentically, work in ways that are best for them, and achieve their career goals. Azure Reliability team is a multidisciplinary engineering organization part of CXP dedicated to making, “Azure the safest and most reliable Cloud”.  \nWe are the Azure Reliability team; a multidisciplinary engineering organization committed to making Azure the world’s safest and most reliable cloud. For Azure’s most critical services and products, we apply a Site Reliability Engineering (SRE) approach. Our software engineers work closely with product teams to enhance availability, reliability, observability, and operability across our planet-scale systems.  \nWe prioritize long-term platform improvements through engineering over repetitive manual tasks. Increasingly, we leverage AI to amplify our ability to scale reliability across Azure. Our teams contribute to product architecture, share knowledge and code, and focus on building reusable solutions that benefit multiple teams and services.   \nAs the SRE discipline evolves, we continuously learn from industry peers and contribute to its advancement by innovating within our group and sharing our insights publicly. Our team brings diverse professional backgrounds, both traditional and non-traditional, and we’re committed to growing diversity. We believe that an inclusive environment where everyone feels safe to contribute leads to better teams, better products, and a better workplace. We’re not looking for people who know it all; we’re looking for those eager to learn it all. If you thrive on collaboration, embrace challenges, and see mistakes as opportunities to grow, we’d love to meet you.  \nEvery day, our customers stake their business and reputation on our cloud. You can help #AzCXP provide our customers with the world-class cloud services they need to succeed.  \nCompany Culture Statement  \nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.  \nQualifications\nRequired Qualifications:\n Bachelor's Degree in Computer Science, or related technical discipline with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python  \nOR equivalent experience \n Preferred Qualifications :\nFamiliarity with modern distributed software design patterns and cloud systems architecture, including microservices, containers, load balancing, queuing, caching.  \nProven track record in building, shipping, and operating reliable solutions.  \nProficiency in programming languages like C#/Java/Python.  \nExperience with data technologies (SQL/NoSQL/etc.).  \nExperience with Azure is a plus.  \nExperience in AI adoption with tools like GitHub Copilot, Azure OpenAI and custom copilots to streamline development and reduce toil.  \n #EiP\n Responsibilities\nBillions of users across the world rely on our products, and to meet this demand we design and implement world-class distributed systems.    \nAs a Software Engineer in one of our Azure SRE teams, you will be responsible for improving the reliability of key Azure products.   \nThe Azure SRE key focus areas are:  \nDefining system reliability goals through Service Level Objectives (SLOs). Enhancing production posture with targeted improvements in observability and operability (telemetry, alerting, incident/change management, safe deployment practices).  \nBuilding reusable automation and processes that help multiple teams meet their reliability goals. Influencing product architecture and roadmaps to ensure customer-experienced reliability is a core design principle.  \nContributing directly to product code to achieve reliability outcomes. Leveraging AI to proactively detect anomalies, predict incidents, and automate operational workflows - scaling reliability efforts across complex systems.  \n We are looking for engineers passionate about the above areas who are also interested in:   \nDesigning and developing large-scale distributed software services and solutions. Delivering “best-in-class” engineering by ensuring services are modular, secure, reliable, testable, diagnosable, observable, and reusable.  \nCollaborating with internal and external partners to support team goals. Balancing pragmatism with vision - driving continuous improvements in process and codebase. Building automation to prevent or remediate service issues before they impact users.  \nDriving innovation in large-scale operations by applying cutting-edge AI tools and techniques to reduce operational toil and scale reliability engineering across complex systems.  \nGaining a working understanding of Microsoft businesses and contributing to cohesive, end-to-end user experiences.",
    "job_link": "https://jobs.careers.microsoft.com/global/en/job/1858366/Software-Engineering",
    "posted_date": "Sep 10, 2025",
    "company": "MICROSOFT",
    "scraped_at": "2025-09-10T15:26:06.899072"
  },
  {
    "title": "Global System Integrators Manager :  UK&I",
    "location": "London, United Kingdom",
    "experience_required": "",
    "job_description": "Overview\nEnterprise Partner Solutions (EPS) is accountable for building and co-selling innovative Microsoft Cloud & AI solutions and services with our global and local enterprise partners. Our partner portfolio includes global systems integrators, advisories, high-value management consultancies, independent software vendors (ISV), and software development companies (SDC) —working together to empower people and organisations to achieve more.\n\nAs the UK&I GSI Lead, you will be responsible for the UK&I performance growth of the Global Systems Integration and Advisory partner ecosystem leading a team of Partner Development Managers. These are our largest and most strategic services partners in the UK&I and globally, shaping our enterprise customers’ digital transformation journeys. You will also be responsible for ensuring technical and specialist resource support for UK&I by securing resources from EMEA and Global specialist technical teams.\n\nYou will leverage your challenger mindset, deep technology and industry expertise, market insights, and best-in-class interpersonal abilities to empower your team to further grow our robust ecosystem of partners, enabling them to bring market-defining cloud and AI solutions to our customers. This opportunity will accelerate your career growth as you work deeply with highly complex partner organisations, building strong relationships and influence with their C-suite, and shaping our strategic partnerships to deliver on our growth ambitions.\n Please note that this position requires 3 days per week in the office / client site 3 days per week. \n\nMicrosoft’s mission is to empower every person and every organisation on the planet to achieve more. As employees, we come together with a growth mindset, innovate to empower others, and collaborate to realise our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\nQualifications\nRequired /Minimum Qualifications \nStrong and proven experience in partner management, sales, business development, or partner channel development in the technology industry \nStrong and proven  partner management, sales, business development, or partner channel development in the technology industry. \nProven and prior people management experience. \nProven expertise in building high-performing teams, excelling in hiring, performance management, and sales strategy. \nExcellent written and oral communication skills, with the ability to convey complex business and technical information to all audiences. \n Responsibilities\nPartner Portfolio Leadership and Optimisation\nEstablish long-term partner strategies and expand current GSI partnerships to create a balanced, high-performance portfolio, grow business, and anticipate market growth opportunities.\nStrategic Vision and Value Partnering\nLead your team in the creation of a strategic vision, executing partner business plans that ensure alignment between Microsoft’s value proposition and the partner’s business goals.\nDevelop and strengthen partners’ performance across each of the Microsoft Cloud Solution Areas (CSAs) AI Business Solutions, Security, and Cloud and AI Platforms.\nSupport GSIs in driving “partner zero” initiatives and becoming frontier firms by way of example for their customers. Ensuring our GSIs have first hand experience of being a frontier firm leading with AI.\nPartner Sales Leadership\nAct as sales leader and coach the team through pipeline and opportunity management, following Microsoft internal sales methodology and tools.\nBuild and maintain a strong rhythm of business to ensure sales execution excellence with partners, collaborating with other sales teams at Microsoft. Coach teams through resolving blockers and act as escalation point for complex partner situations.\nMarket Insight and Business Opportunity\nLead and challenge your team to identify transformational customer opportunities to pursue with partners, incorporating industry expertise, market insights, and deep knowledge of the competitive landscape working closely alongside Microsoft specialist teams.\nExecutive Relationship Building\nGuide your team in developing deep, trusted-advisor relationships with our GSI partners. Provide training and coaching to ensure your teams maintain a thorough understanding of partner and Microsoft priorities, strategies, and goals.\nBe the executive sponsor for top partners and spend more than 50% of your time externally, with partners and customers.\nAccelerate AI Opportunity\nSupport partners’ development of AI-powered industry and horizontal solutions and services, enabling transformation for customers and industries leveraging the power of AI, aligned to our three Cloud Solution Areas.\nPerformance Management\nSet and manage performance expectations, partner ambition and KPIs.\nActively manage PDM performance and provide ongoing feedback. Performance management should include PDMs meeting or exceeding revenue-based quotas and partner KPIs. Identify and take corrective action where performance is below target.\nTeam Leadership and Career Development\nDevelop and lead a high-performing team, leveraging resources to help employees grow skillsets, encourage mentorship, and support their career interests. Be an expert at workforce development and succession planning, identifying growth opportunities, building development plans, and conducting development discussions.",
    "job_link": "https://jobs.careers.microsoft.com/global/en/job/1856388/Global-System-Integrators-Manager-%3A--UK%26I",
    "posted_date": "Sep 10, 2025",
    "company": "MICROSOFT",
    "scraped_at": "2025-09-10T15:26:07.530974"
  }
]