[
  {
    "title": "Senior HPC AI Cluster Engineer",
    "location": "UK, Remote, Poland, Remote, France, Remote, Spain, Remote, Germany, Remote",
    "experience_required": "",
    "job_description": "NVIDIA is looking for an experienced HPC Engineer to join the E2E software verification HPC/AI Infrastructure team. We are building supercomputers and HPC clusters based on groundbreaking technologies. We are looking for an outstanding architect for a senior HPC, be a key player to the most exciting computing hardware and software to contribute to the latest breakthroughs in artificial intelligence and GPU computing. Provide insights on at-scale system design and tuning mechanisms for large-scale compute runs.\nYou will work with the latest Accelerated computing and Deep Learning software and hardware platforms, and with many scientific researchers, developers, and customers to craft improved workflows and develop new, leading differentiated solutions. You will interact with HPC, OS, GPU compute, and systems specialist to architect, develop and bring up large scale performance platforms. Does this sound like you? If so, we would love to hear from you!\nWhat you will be doing:\nDesigning, implementing and maintaining large scale HPC/AI clusters with monitoring, logging and alerting\nManaging Linux job/workload schedules and orchestration tools\nDeveloping and maintaining continuous integration and delivery pipelines\nDeveloping tooling to automate deployment and management of large-scale infrastructure environments, to automate operational monitoring and alerting, and to enable self-service consumption of resources\nDeploying monitoring solutions for the servers, network and storage\nTroubleshooting and fixing, bottom up from bare metal, operating system, software stack and application level\nBeing a technical resource, developing, re-defining and documenting standard methodologies to share with internal teams\nSupporting Research & Development activities and engaging in POCs/POVs for future improvements\nWhat we need to see:\nBachelor's Degree in Computer Science, Engineering, or a related field; or equivalent experience\n5+ years of experience\nKnowledge of HPC and AI solution technologies from CPU’s and GPU’s to high speed interconnects and supporting software\nExperience with job scheduling workloads and orchestration tools such as Slurm, K8s\nExcellent knowledge of Windows and Linux (Redhat/CentOS and Ubuntu) networking (sockets, firewalls, iptables, wireshark, etc.) and internals, ACLs and OS level security protection and common protocols e.g. TCP, DHCP, DNS, etc.\nExperience with multiple storage solutions such as Lustre, GPFS, zfs and xfs. Familiarity with newer and emerging storage technologies.\nPython programming and bash scripting experience.\nComfortable with automation and configuration management tools such as Jenkins, Ansible, Puppet/chef\nDeep knowledge of Networking Protocols like InfiniBand, Ethernet\nDeep understanding and experience with virtual systems (for example VMware, Hyper-V, KVM, or Citrix)\nFamiliarity with cloud computing platforms (e.g. AWS, Azure, Google Cloud)\nWays to stand out from the crowd:\nKnowledge of CPU and/or GPU architecture\nKnowledge of Kubernetes, container related microservice technologies\nExperience with GPU-focused hardware/software (DGX, Cuda)\nBackground with RDMA (InfiniBand or RoCE) fabrics\nNVIDIA has been redefining computer graphics, PC gaming, and accelerated computing for more than 25 years. We have a unique legacy of innovation that’s fueled by great technology—and amazing people. Today, we’re tapping into the unlimited potential of AI to define the next era of computing. An era in which our GPU acts as the brains of computers, robots, and self-driving cars that can understand the world. Doing what’s never been done before takes vision, innovation, and the world’s best talent.  Our teams are composed of driven, innovative professionals dedicated to pushing the boundaries of technology. We offer highly competitive salaries, an extensive benefits package, and a work environment that promotes diversity, inclusion, and flexibility. As an equal opportunity employer, we are committed to fostering a supportive and empowering workplace for all",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/UK-Remote/Senior-HPC-AI-Cluster-Engineer_JR1997883",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T15:36:56.181798"
  },
  {
    "title": "Interconnect HW Design Engineer",
    "location": "Denmark, Roskilde",
    "experience_required": "",
    "job_description": "NVIDIA has been redefining computer graphics, PC gaming, and accelerated computing for more than 25 years. It’s a unique legacy of innovation that’s fuelled by great technology—and amazing people! Today, we’re tapping into the unlimited potential of AI to define the next era of computing. An era in which our GPU acts as the brains of computers, robots, and self-driving cars that can understand the world. Doing what’s never been done before takes vision, innovation, and the world’s best talent. As an NVIDIAN, you’ll be immersed in a diverse, supportive environment where everyone is inspired to do their best work. Come join the team and see how you can make a lasting impact on the world.\nNVIDIA is looking to hire a senior development engineer for the Interconnect Design team in Roskilde, Denmark for development of cutting-edge high-speed interconnects that will link-up the datacenters of tomorrow. The successful candidate will work on PCB design for interconnect products. In addition to PCB design the candidate will ultimately take ownership of transceiver designs, including system testing and manage projects with multiple stakeholders from across the organization.\nWhat you’ll be doing:\nDevelopment of PCB design for interconnect products.\nWorking towards taking ownership of transceiver designs, including bring-up and system testing.\nCharacterization and evaluation of transceivers and ICs.\nManage projects with multiple stakeholders from across the organization.\nWhat we need to see:\nB.Sc./M.Sc. Degree or equivalent experience in electrical engineering or equivalent area.\n2+ years of experience with electronic circuit design.\nExperience with µ-controller.\nStrong product attitude: Ability to own and drive transceiver development project.\nHands-on experience with test equipment.\nGood English skills, oral and writing.\nCommands at least one programming language.\nWays to stand out from the crowd:\nBackground with packaging.\nExperience with thermal management.\nBasic knowledge of optoelectronic components.\nExperience with high data rate system characterization and working knowledge of radio frequency testing.\nKnowledge of electromagnetic compatibility (EMC) and interference (EMI).\nWith competitive salaries and a comprehensive benefits package, NVIDIA is widely considered to be one of the technology world’s most desirable employers. If you're a creative and autonomous engineer with a passion for technology, and if you want to join our extraordinary engineering teams we want to hear from you. We are committed to providing equal opportunity to all applicants as stated in our Equal Employment Opportunity Policy and Code of Conduct.",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/Denmark-Roskilde/Interconnect-HW-Design-Engineer_JR2002165",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T15:36:59.333252"
  },
  {
    "title": "Senior Software Architect, Advanced Development",
    "location": "China, Remote",
    "experience_required": "",
    "job_description": "Join NVIDIA, a pioneer in transforming computer graphics, PC gaming, and accelerated computing for over 25 years. As our Senior Software Architect in Advanced Development, you'll be at the forefront of defining next-generation hardware requirements and solutions. This role is uniquely positioned to drive advancements in AI and advanced networking protocols, placing you close to our customers to deliver outstanding, world-class solutions. Be part of a team where your ambitious vision and flawless execution can make a lasting impact!\nWhat you'll be doing:\nLeading the design and development of advanced networking protocols for AI applications.\nCollaborating closely with cross-functional teams to define hardware requirements and solutions.\nEngaging with customers to understand their needs and successfully implement brand new technologies.\nDriving innovation and ensuring the flawless execution of projects.\nWhat we need to see:\nPHD or Master's degree in Computer Science, Electrical Engineering, or a related field.\nProven track record with 8+ years of experience in software architecture or a similar role.\nDeep understanding of networking protocols and AI applications.\nOutstanding problem-solving skills and the ability to work strictly within project timelines.\nStrong communication and collaboration skills to determine and meet customer needs effectively.\nExperience with leading teams and mentoring engineers is highly desirable.",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/China-Remote/Senior-Software-Architect--Advanced-Development_JR2001628-1",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T15:37:02.489499"
  },
  {
    "title": "Perf Analyst Intern",
    "location": "China, Shanghai",
    "experience_required": "",
    "job_description": "Have you ever wanted to join a groundbreaking company that is crafting the future of the tech industry? Are you a creative individual with an analytical attitude and a real passion for technology? If this sounds like you then we want to hear from you. We are looking for a dedicated team member to be part of our Performance Lab team to build and improve the work class lab.\nWhat you’ll be doing:\nCandidate will create, tune, run and analyze graphics and systems benchmarks on PCs, workstations and laptops. Tasks may include some scripting to automate current test processes and benchmarks for improved efficiency.\nCandidate may also need to configure computer systems with appropriate hardware and software to run benchmarks on various systems. They would run benchmarks on these systems.\nCandidate  would analyze results from benchmark runs and create reports to position NVIDIA products appropriately using their evaluation.\nWhat we need to see:\nBS in Computer Science or similar computer discipline\nWorking knowledge of all Windows operating systems\nLinux and Windows knowledge.\nGood knowledge of PC systems and components.\nGood organizational, time management and task prioritization skills.\nWays to stand out from the crowd: \nKnowledge of C, C++, Perl, OpenGL, Direct X and D3D.\nFamiliarity with Linux is a plus.\nGood knowledge of NVIDIA GeForce and RTX series.\nFamiliar with Android application is a plus.\nNVIDIA is widely considered to be one of the technology world’s most desirable employers. We have some of the most brilliant and talented people on the planet working for us. If you're creative and autonomous, we want to hear from you!",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/China-Shanghai/Perf-Analyst-Intern_JR2002518-1",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T15:37:05.641287"
  },
  {
    "title": "Account Sales Manager",
    "location": "Japan, Tokyo",
    "experience_required": "",
    "job_description": "NVIDIA has been transforming computer graphics, PC gaming, and accelerated computing for more than 25 years. It’s a unique legacy of innovation that’s fueled by great technology—and amazing people. Today, we’re tapping into the unlimited potential of AI to define the next era of computing. An era in which our GPU acts as the brains of computers, robots, and self-driving cars that can understand the world. Doing what’s never been done before takes vision, innovation, and the world’s best talent. As an NVIDIAN, you’ll be immersed in a diverse, supportive environment where everyone is inspired to do their best work. Come join the team and see how you can make a lasting impact on the world.\nAre you prepared for a fresh opportunity with a company shaping the tech future? NVIDIA seeks an Account Sales Manager to join our outstanding team in Japan. Join a premier sales team, using your skills in the fast-paced tech industry. You'll be crucial in crafting the future of AI, gaming, and accelerated computing, helping achieve our ambitious goals.\nWhat you'll be doing:\nDeveloping and achieving strategic sales plans to meet and exceed revenue targets.\nEstablishing and cultivating robust relationships with key clients in semiconductor industry, ensuring their needs are addressed and solutions are effectively put into action.\nCollaborating with cross-functional teams, including marketing, product development, and customer support, to deliver outstanding service and drive sales growth.\nAnalyzing market trends and customer feedback to determine opportunities for expansion and improvement.\nLeading and mentoring a team of sales professionals, encouraging an inclusive and collaborative environment that drives performance.\nWhat we need to see:\nBachelor’s degree or equivalent experience in Business, Marketing, or a related field.\nProven track record of at least 8 years in a sales role, with a focus on technology or related industries.\nOutstanding communication and negotiation skills, adept at cultivating positive relationships with clients and internal teams.\nProficient analytical abilities and the capacity to leverage data for informed decision-making and sales strategy development.\nProficiency in Japanese and English, both written and spoken, to effectively communicate in a global environment.\nWidely considered to be one of the technology world’s most desirable employers, NVIDIA offers highly competitive salaries and a comprehensive benefits package. As you plan your future, see what we can offer to you and your family www.nvidiabenefits.com/",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/Japan-Tokyo/Account-Sales-Manager_JR2003329",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T15:37:08.771228"
  },
  {
    "title": "Physical Design CAD Engineer",
    "location": "Israel, Yokneam, Israel, Tel Aviv",
    "experience_required": "",
    "job_description": "NVIDIA is looking for best-in-class Physical Design CAD Engineer to join our outstanding Networking Silicon engineering team, developing the industry's best high speed communication devices, delivering the highest throughput and lowest latency! Come and take a part in designing our groundbreaking and innovating chips, enjoy working in a meaningful, growing and highly professional environment where you make a significant impact in a technology-focused company.\nWhat you'll be doing:\nYou will be in charge of developing physical design, synthesis, STA and Logic eq methodologies for implementation of networking chips and SOCs.\nWork closely with block owners. full Chip STA engineers and project managers to assure high quality and timely convergence.\nCome up with unique and creative solutions to the state of the art physical design problems that are needed for Our chips.\nAdditional responsibilities include participating and developing flow and tool methodologies for chip floorplan, power and clock distribution, P&R, timing analysis and closure, power and noise analysis and back-end verification across multiple projects.\nWhat we need to see:\nB.SC./ M.SC. in Electrical Engineering/Computer Engineering (or equivalent experience).\nAt least 2 years of relevant experience\nProficiency using Python, Perl, Tcl, Make scripting.\nExpertise in analysing and converging crosstalk delay, noise glitch, and electrical/manufacturing rules in deep-sub micron processes.\nKnowledge in physical design and optimization e.g. placement, routing, cell sizing, buffering, logic restructuring, etc. to improve timing and power required and implementing them through ECOs is required.\nKnowledge in process variation effect modelling and experience in design convergence taking into account variations.\nSuccessful track record of delivering designs to production is necessary.\nSelf-motivation, attention to detail, and good written, verbal, and presentation skills are critical to success in this role.\nWays to stand out from the crowd:\nFamiliarity with  synthesis, place and route, STA EDA tools from Synopsys (DC/FC/PT), Cadence (Innovus/Tempus) \nExperience in methodology definition / flow owner of synthesis / Place and Route/ STA steps is an advantage.\nGreat teammate.\nOwnership, self-learning skills, and ability to work autonomously.\nNVIDIA is widely considered to be one of the technology world’s most desirable employers. We have some of the most forward-thinking people in the world working for us. Are you a creative and autonomous engineer who loves a challenge? Are you ready to become the engineer you always wanted to be? Come and be part of the best physical design team in the industry!\n#LI-Hybrid",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/Israel-Yokneam/Physical-Design-CAD-Engineer_JR1969066",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T15:37:11.955477"
  },
  {
    "title": "Chip Design Architect",
    "location": "Israel, Tel Aviv, 3 Locations, Israel, Tel Aviv",
    "experience_required": "",
    "job_description": "We are seeking a highly motivated Chip Design Architect to join our team of experts and help shape the future of high-performance computing. Our next-generation Infiniband and NVL switches will be at the forefront of connecting and powering the world's most advanced compute clusters, from supercomputers used in AI research to high-performance clusters used in industries such as finance and research labs. As a Chip Design Architect at NVIDIA, you will have the opportunity to work on some of the most cutting-edge technology and help to drive the innovation of our next generation of switches that will be used by top researchers and engineers around the world. The products you'll develop will be integrated in many leading-edge compute clusters, and supercomputers, and you'll be part of a team with a strong track record of success.\nWhat you will be doing:\nCollaborate with cross-functional teams, including other architecture teams, logic design, system software, firmware, and hardware teams, to ensure the successful execution of the project. \nDefine the HW boot, clock and Reset architecture for Switch ASIC\nDevelop slow-speed interface architecture specifications and design guidelines, conduct trade-off analysis for different architecture options, and oversee the implementation of the chosen architecture by the chip design / FW / SW teams\nWhat we need to see:\nBSc or MSc in Electrical Engineering / Computer Science or equivalent experience. \n4+ years of chip-design architect experience or chip design / design verification experience. \nDeep understanding of how to build and integrate systems with various technology components. \nCan-do attitude and high energy with leadership and excellent interpersonal skills and possess the ability to learn sophisticated concepts in a fast-paced environment. \nPossess strong managerial, problem solving and critical thinking skills.\nAttention to details on design and high focus on design quality. \nNVIDIA is widely considered to be one of the technology world’s most desirable employers. We have some of the most forward-thinking and hardworking people in the world working for us. If you're creative and autonomous, we want to hear from you!",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/Israel-Tel-Aviv/Chip-Design-Architect_JR1996141",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T15:37:15.132705"
  },
  {
    "title": "DevOps and Automation Engineer",
    "location": "India, Bengaluru, India, Remote, India, Hyderabad, India, Pune, India, Mumbai, India, Pune, India, Pune",
    "experience_required": "",
    "job_description": "NVIDIA is at the forefront of innovation in AI, high-performance computing, and visualization. Our invention—the GPU—has transformed modern computing and powers everything from scientific breakthroughs to autonomous vehicles. As we drive the next wave of artificial intelligence, we’re looking for outstanding engineers to join us.\nWe're seeking a DevOps and Automation Engineer to join our software infrastructure team. In this role, you'll build and enhance the systems that support large-scale GPU clusters—interconnected via NVLink and InfiniBand—that run today's most fast paced HPC and AI workloads.\nWhat you’ll be doing:\nBuild and maintain CI/CD pipelines that support fast, reliable integration and deployment across complex systems.\nDesign tools and automation workflows that simplify software releases, manage dependencies, and increase reliability.\nAccelerate development by modularizing systems and enabling independent release cycles.\nBuild infrastructure automation for provisioning, scaling, and maintaining GPU clusters.\nAutomate software updates and monitor system health to improve reliability and availability.\nTroubleshoot and resolve operational issues across distributed infrastructure.\nManage firmware and software rollouts to minimize downtime and ensure consistency.\nWork with global engineering teams to align infrastructure tools and support project achievements.\nWhat we need to see:\nBS or MS in Computer Science, Computer Engineering, or a related field—or equivalent hands-on experience.\n5+ years of experience managing infrastructure or systems in high-performance or distributed environments.\nExpertise in scripting and automation using Python, Ansible, and Shell.\nPractical experience with modern CI/CD tools and infrastructure-as-code frameworks.\nStrong understanding of Linux, networking, and distributed system design.\nAbility to break down monolithic systems into scalable, loosely coupled components.\nStrong cross-functional communication and collaboration skills.\nWays to stand out from the crowd:\nExperience with cluster management tools like Slurm.\nFamiliarity with NVIDIA DGX systems and GPU-based clusters.\nKnowledge of observability tools such as Prometheus and Grafana.\nProven ability to lead DevOps process improvements and drive team efficiency.\nNVIDIA is widely considered to be one of the technology world’s most desirable employers. We have some of the most forward-thinking and hardworking people on the planet working for us. If you're creative and autonomous, we want to hear from you!",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/India-Bengaluru/DevOps-and-Automation-Engineer_JR2000937",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T15:37:18.318104"
  },
  {
    "title": "Senior Software Engineer - Data Center System Bringup",
    "location": "US, CA, Santa Clara, 2 Locations, 6 Locations",
    "experience_required": "",
    "job_description": "NVIDIA has been transforming computer graphics, PC gaming, and accelerated computing for more than 25 years. It’s a unique legacy of innovation that’s fueled by great technology—and amazing people. Today, we’re tapping into the unlimited potential of AI to define the next era of computing. An era in which our GPU acts as the brains of computers, robots, and self-driving cars that can understand the world. Doing what’s never been done before takes vision, innovation, and the world’s best talent. As an NVIDIAN, you’ll be immersed in a diverse, supportive environment where everyone is inspired to do their best work. Come join the team and see how you can make a lasting impact on the world.\nWe are building innovative server systems for GPU accelerated applications, such as Deep Learning. As a Senior Software Engineer - Data Center System Bringup, you will play a crucial role in our innovative team, leading the software and firmware debug and bringup efforts of our powerful server systems like HGX, DGX and MGX. We are looking for Senior Firmware / System Software engineers who would closely work with our CSP partners to bringup and stabilize their new server systems. This is an outstanding chance to collaborate with exceptional professionals on groundbreaking technology that pushes the limits of what can be achieved.\nWhat you'll be doing:\nSpearhead the debug, bringup, and triage of bugs during the CSP's server system bringup.\nCollaborate closely with matrix teams to work on firmware and software across the entire stack.\nWork directly with major customers to solve complex technical issues.\nRefine and stabilize solutions that ensure flawless integration of server products in large scale data centers and improve performance and reliability of our data center systems.\nWork closely with product experience and documentation teams to ensure true customer delight.\nWhat we need to see:\nBachelor’s or Master’s degree in Computer Science, Electrical Engineering, or a related field, or equivalent experience.\nDemonstrated ability in system bringup, debugging, and handling complex hardware and software issues with 7+ years in the area of system software or firmware areas.\nOutstanding skills in firmware and software development with a deep understanding of end-to-end stack and server system architecture.\nExpertise in Out of Band and In-band management architectures.\nStrong ability to collaborate and communicate effectively within a diverse team of engineers.\nA track record of delivering high-quality, innovative solutions in a fast-paced, dynamic environment.\nWays to stand out from the crowd:\nStrong background in device management protocols such as Redfish, IPMI, PLDM.\nIn depth understanding of PCIE, memory management or networking stack.\nNVIDIA is leading the way in groundbreaking developments in Artificial Intelligence, High-Performance Computing, and Visualization. Our invention serves as the visual cortex of modern computers and is at the heart of our products and services. Our work opens up new universes to explore, enables amazing creativity and discovery, and powers what were once science fiction inventions from artificial intelligence to autonomous cars. NVIDIA is looking for great people like you to help us accelerate the next wave of artificial intelligence.\nYour base salary will be determined based on your location, experience, and the pay of employees in similar positions. The base salary range is 184,000 USD - 287,500 USD for Level 4, and 224,000 USD - 356,500 USD for Level 5.\nYou will also be eligible for equity and benefits.\nApplications for this job will be accepted at least until September 13, 2025.\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/US-CA-Santa-Clara/Senior-Software-Engineer---Data-Center-System-Bringup_JR1993516",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T15:37:21.494587"
  },
  {
    "title": "Senior NPI Program Manager - Datacenter Server Products",
    "location": "US, CA, Santa Clara, US, CA, Santa Clara, 2 Locations",
    "experience_required": "",
    "job_description": "Do you want to join a team of highly motivated and experienced program managers who drive the successful introduction of NVIDIA's next generation GPU/CPU based products? We work closely with internal leaders in Software, Hardware, Firmware, Marketing and Operations to ensure the SW team delivers outstanding products while operating across multiple functional units and all levels of management to achieve Time-To-Market. As part of the team, your knowledge of driver, firmware, diagnostics and the SW stack development processes and priorities will enable you to swiftly make the course adjustments needed to keep these complex projects on track!\nOur team drives the correction of any issues that impede program success via on the spot corrections, mid-program or post-mortem analysis. We closely collaborate to wring the maximum efficiency from our processes while seeking out process changes that improve both NPI and SW productivity. Do you wish you were a catalyst in a company that is defining new, globally impactful markets, while working with sharp, upbeat peers? If so, we have an opportunity for you!\nWhat You'll Be Doing:\nDriving system software releases to enable production of new systems.\nProvide up to date software readiness to cross functional team members.\n Learn the stakeholders in the program and what their needs. Plan ahead the HW, FW and SW needs for a successful outcome of the product.\nUnderstand the needs for the new product development. Plan ahead for HW, FW, and SW teams to ensure successful product outcomes.\nPrioritize resolution of issues for firmware and platform bring up.\nWhat We Need to See: \nHands on experience with the software development lifecycle, specifically for device drivers and applications\nYou have experience in product bring up\nEffective in a matrix-managed organization and work with datacenter, lab and engineering development teams\nDetail oriented and comfortable multitasking in a dynamic environment with shifting priorities and changing requirements. Excellent communication and technical presentation skills\nYou love thinking creatively to resolve novel technical issues and resource constraints\nAbility to think strategically and tactically and to build consensus to make programs successful. Thorough knowledge of software engineering and life cycle principles\nData analysis with Excel or Tableau or Smartsheets. Presenting information in more understandable and actionable formats to enhance the decision making\n 7+ years in a similar or related role with BS CE, EE or CS (or equivalent experience)\nWay to Stand Out From the Crowd: \nKnowledge of data center systems, standards and deployment a plus\nYou have shown the ability to independently deliver complex products\nKnowledge of GPUs and NICs is a plus. Having experience with Agile tools in support of this role\nNVIDIA is widely considered to be one of the technology world’s most desirable employers. We have some of the most forward-thinking and hardworking people on the planet working for us. If you're creative, passionate and self-motivated, we want to hear from you!\nYour base salary will be determined based on your location, experience, and the pay of employees in similar positions. The base salary range is 160,000 USD - 253,000 USD for Level 4, and 192,000 USD - 304,750 USD for Level 5.\nYou will also be eligible for equity and benefits.\nApplications for this job will be accepted at least until September 13, 2025.\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/US-CA-Santa-Clara/Senior-NPI-Program-Manager---Datacenter-Server-Products_JR1998353",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T15:37:24.665006"
  },
  {
    "title": "Senior System Software Bringup Engineer",
    "location": "US, CA, Santa Clara, US, Remote, 6 Locations, US, CA, Santa Clara",
    "experience_required": "",
    "job_description": "NVIDIA’s invention of the GPU in 1999 sparked the growth of the PC gaming market, redefined modern computer graphics, and revolutionized parallel computing. More recently, GPU deep learning ignited modern deep learning - the next era of computing - with the GPU acting as the brain of computers, robots, and self-driving cars that can perceive and understand the world. Today, we are increasingly known as “The AI Computing Company.” We're looking to grow our company and establish teams with the most thoughtful people in the world. \nNVIDIA HGX, MGX and DGX systems deliver the world's leading solutions for enterprise AI infrastructure at scale.  With their end-to-end performance and flexibility, these systems enable researchers and scientists to combine simulation, data analytics, and AI to drive scientific progress on the most powerful end-to-end AI supercomputing platforms. Are you ready to change the next generation of computing? Join us at the forefront of technological advancement.\nWhat you’ll be doing:\nLead and drive system bringup for GPU-centric server platforms in factory and data center environments.\nDesign and implement end-to-end factory workflows, including firmware flashing sequences, security provisioning, and deployment of software mitigations.\nCollaborate cross-functionally with data center architects, ODMs, and OEMs to define factory and data center requirements that ensure efficient and reliable production ramp.\nChampion reliability, debuggability and optimization in firmware, diagnostic and deployment tool design.\nUse AI tools to automate functionality and improve automation.\nTroubleshoot at speed of light, working closely with system bring-up teams on next generation AI systems to debug and resolve issues during bringup and deployment.\nWhat we need to see:\n10+ years of experience in data center firmware/platform software development.\nBS, MS, or PhD in EE, CS, or related technical field (or equivalent experience).\nDeep, hands-on expertise of working with ODMs/CSPs, firmware update design and out-of-band management.\nProven track record of architecting and developing server firmware and diagnostic solutions for large-scale data center deployments.\nSolid knowledge of hardware interfaces (USB, SMBus/I2C, PCIe) and protocols such as Redfish, MCTP, and PLDM.\nSolid knowledge of debugging servers for early bring up.\nAdvanced skills in C/C++ and Python, with a hands-on approach to coding and debugging during hardware bring-up.\nStrong communicator, excellent collaborator, and committed team player.\nSelf-starter with a problem-solving mindset who thrives in a fast-paced, complex technical environment.\nWays to stand out from the crowd:\nHands-on experience with ODMs/CSPs during system bring-up and volume deployment.\nDeep familiarity with x86 or ARM system architecture.\nStrong networking expertise with high-speed NICs, including bring-up and configuration in factory environment.\nNVIDIA is widely considered to be one of the technology world’s most desirable employers. We have some of the most forward-thinking and hardworking people on the planet working for us. If you're creative and autonomous, we want to hear from you!\nYour base salary will be determined based on your location, experience, and the pay of employees in similar positions. The base salary range is 184,000 USD - 287,500 USD for Level 4, and 224,000 USD - 356,500 USD for Level 5.\nYou will also be eligible for equity and benefits.\nApplications for this job will be accepted at least until September 13, 2025.\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/US-CA-Santa-Clara/Senior-System-Software-Bringup-Engineer_JR1999911",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T15:37:27.832220"
  },
  {
    "title": "Senior Software Architect - Data Center Systems",
    "location": "US, CA, Santa Clara, US, TX, Austin, US, TX, Remote, US, OR, Hillsboro, US, CA, Remote, 2 Locations, 4 Locations",
    "experience_required": "",
    "job_description": "We are building innovative server systems for GPU accelerated applications, such as Deep Learning. Data Center SW team architects and develops the end to end software and firmware stack for these systems. We are looking for a Senior Software Architect who has deep expertise in designing server platforms and has added understanding of application use cases in Deep Learning workloads. You will work with world class engineering teams, product management, Operations and Customer support to build systems that will truly delight our customers.\nWhat you’ll be doing:\nYou will lead software activities for NVIDIA's deep learning server platforms, from design through production; collaborating with teams across company to deliver software solutions\nDrive the system architecture for a complex server platform in a multi-functional environment.\nPartner across application software, libraries, system software and firmware teams to design complete software solutions for new server platforms\nWork directly with major customers to understand their requirements and work to align their roadmap with NVIDIA’s roadmap.\nWork with business partners and vendors to shape their products to meet NVIDIA’s needs.\nDevelop a roadmap of new technologies and protocols and drive their design and adoption.\nMentor architects and engineering teams to grow them into future leaders.\nMake key technical decisions for designs involving complex inter-component dependencies.\nWhat we need to see:\nDeep experience in designing architecture for scalable and performant server systems, particularly at the SW/HW interface.\nUnderstanding of HPC or Deep learning workloads and use of accelerated computing platforms.\nExpertise in Out of Band and In-band management architectures.\nKnowledge of server system architecture and implications of architecture decisions on overall performance of end applications.\nDemonstrable experience in implementing left shift strategy to de-risk program execution.\nExcellent written and verbal communication skills.\nBS or MS degree in Computer Engineering, Computer Science, or related degree or equivalent experience.\n10+ years in the area of System architecture and design.\nWays to stand out from the crowd:\nKnowledge of cloud and cluster level deployment and management systems.\nStrong background of device management protocols such as Redfish, IPMI, MCTP, PLDM and RDE.\nKnowledge in storage and networking technologies.\nNVIDIA is leading the way in groundbreaking developments in Artificial Intelligence, High-Performance Computing and Visualization. The GPU, our invention, serves as the visual cortex of modern computers and is at the heart of our products and services. Our work opens up new universes to explore, enables amazing creativity and discovery, and powers what were once science fiction inventions from artificial intelligence to autonomous cars. NVIDIA is looking for great people like you to help us accelerate the next wave of artificial intelligence.\nNVIDIA is widely considered to be one of the technology world’s most desirable employers. We have some of the most forward-thinking and hardworking people in the world working for us. Are you creative and autonomous? Do you love a challenge? If so, we want to hear from you. Come, join our Data center server systems team and help build the real-time, cost-effective computing platform driving our success in this exciting and quickly growing field.\nYour base salary will be determined based on your location, experience, and the pay of employees in similar positions. The base salary range is 224,000 USD - 356,500 USD for Level 5, and 272,000 USD - 425,500 USD for Level 6.\nYou will also be eligible for equity and benefits.\nApplications for this job will be accepted at least until September 13, 2025.\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/US-CA-Santa-Clara/Senior-Software-Architect---Data-Center-Systems_JR1973150",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T15:37:31.035701"
  },
  {
    "title": "Senior Firmware Engineer – CSP Engagements",
    "location": "US, CA, Santa Clara, US, CA, Santa Clara, US, CA, Santa Clara",
    "experience_required": "",
    "job_description": "NVIDIA is seeking a Senior Firmware Engineer to join our CSP Engagements team, focusing on system software for Datacenter products such as GB200. This role combines deep technical expertise in embedded firmware development with customer-facing responsibilities to enable cloud service providers with next-generation computing platforms. You will work at the intersection of hardware and software, driving technical solutions from concept through deployment.\nWhat you will be doing:\nDesign and develop firmware solutions for manageability and observability of data center servers.\nActively participate in hardware bring-up activities, OOB firmware development, protocol stacks (Redfish, PLDM, MCTP, NSM) and hardware-software co-design for Cloud Service Provider deployments.\nDebug and troubleshoot NVIDIA GPU firmware issues, power management, performance, and thermal control problems for data center deployments, providing active support to CSPs.\nPartner directly with CSPs to deliver technical solutions, co-develop & co-debug features and optimizations, and provide support during new product introductions.\nPerform advanced system debugging, root cause analysis, and performance optimization for large-scale data center environments.\nCollaborate with AE, FAE, and Solution Architect teams to deliver integrated customer solutions and technical documentation.\nWhat we need to see:\nDeep expertise in data center server architectures, HPC systems, and hardware-software co-design.\nDeep expertise in embedded firmware, server management controllers, and hardware bring-up with proven track record of shipping production BMC solutions\nStrong knowledge of DMTF protocols (Redfish, IPMI, PLDM, MCTP, SPDM), telemetry frameworks, and out-of-band management architectures\nExpert-level skills in C/C++ in resource-constrained embedded environments, RTOS, device drivers, and low-level protocols (I2C, SPI, UART, PCIe, MCTP).\nExperience with RAS including error handling, error injection, fault isolatio, and system health monitoring.\nBS or MS in Computer Engineering, Computer Science, or related field (or equivalent experience).\n8-12 years of system software development experience.\nWays to stand out from the crowd:\nKnowledge of cloud and cluster level deployment and management systems.\nExperience with GPU computing (CUDA), deep learning workloads.\nKnowledge of Memory fabric and CXL architectures.\nNVIDIA is leading the way in groundbreaking developments in Artificial Intelligence, High-Performance Computing and Visualization. The GPU, our invention, serves as the visual cortex of modern computers and is at the heart of our products and services. We have some of the most forward-thinking and hardworking people on the planet working for us. If you're creative, hardworking and self-motivated, we want to hear from you!\nDo you want to join a team of highly motivated and experienced program managers who drive the successful introduction of NVIDIA's next generation GPU/CPU based products? We work closely with internal leaders in Software, Hardware, Firmware, Marketing and Operations to ensure the SW team delivers outstanding products while operating across multiple functional units and all levels of management to achieve Time-To-Market. As part of the team, your knowledge of driver, firmware, diagnostics and the SW stack development processes and priorities will enable you to swiftly make the course adjustments needed to keep these complex projects on track!\nYour base salary will be determined based on your location, experience, and the pay of employees in similar positions. The base salary range is 184,000 USD - 287,500 USD for Level 4, and 224,000 USD - 356,500 USD for Level 5.\nYou will also be eligible for equity and benefits.\nApplications for this job will be accepted at least until September 13, 2025.\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/US-CA-Santa-Clara/Senior-Firmware-Engineer---CSP-Engagements_JR1999599",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T15:37:34.276174"
  },
  {
    "title": "Senior System Software Engineering Lead for Release - Base OS",
    "location": "US, CA, Santa Clara, US, TX, Remote, US, CO, Remote, US, CA, Remote, US, CA, Santa Clara, US, CA, Santa Clara",
    "experience_required": "",
    "job_description": "NVIDIA’s invention of the GPU in 1999 fueled the growth of the PC gaming market, redefined modern computer graphics, and revolutionized parallel computing. More recently, GPU deep learning ignited modern AI — the next era of computing — with the GPU acting as the brain of computers, robots, and self-driving cars that can perceive and understand the world. Today, we are increasingly known as “the AI computing company”. We're looking to grow our company, and build our teams with the most resourceful people in the world. Join us at the forefront of technological advancement.\nWhat you'll be doing:\nBase OS is the Linux platform used to enable both x86 and arm64 NVIDIA platforms. Your role as the Base OS Engineering Release Lead is to help drive Base OS across multiple programs and products.\nWork closely with external partners and customers to capture their requests!\nPartner with Hardware, Software, and Firmware development teams to align on deliverables and priorities.\nWhat we need to see:\nBS or Masters in computer science, or related field or equivalent experience.\n7+ years of experience.\nExcellent communication and planning skills.\nFamiliarity with at least one major Linux distro (Ubuntu, RedHat, SLES) is required.\nExperience with complex system-level debugging is invaluable.\nSolid understanding of GPU server architecture.\nWays to stand out from the crowd:\nUnderstanding kernel development methodologies is recommended.\nExperience writing software in GitHub with exposure to opensource development life cycle is desired.\nKnowledge of NVIDIA technologies used within NVIDIA server products is another way to be highlighted.\nNVIDIA is widely considered to be one of the technology world’s most desirable employers. We have some of the most forward-thinking and hardworking people on the planet working for us. If you're creative and autonomous, we want to hear from you!\nYour base salary will be determined based on your location, experience, and the pay of employees in similar positions. The base salary range is 184,000 USD - 287,500 USD.\nYou will also be eligible for equity and benefits.\nApplications for this job will be accepted at least until September 13, 2025.\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/US-CA-Santa-Clara/Senior-System-Software-Engineer--Base-OS-Engineering-Lead-for-Release_JR2000481",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T15:37:37.470594"
  },
  {
    "title": "Senior Network Automation Architect - DGX Cloud",
    "location": "US, CA, Santa Clara, US, WA, Remote, US, CA, Remote, 2 Locations, 3 Locations",
    "experience_required": "",
    "job_description": "We are seeking a highly skilled Senior Network Automation Architect to design, implement, and oversee end-to-end automation frameworks for provisioning Baremetal and Kubernetes clusters across hybrid and multi-cloud environments. This role blends deep networking expertise with infrastructure-as-code principles, enabling rapid, reliable, and secure deployment of Kubernetes clusters at scale.\nThe successful candidate will work closely with SREs, platform engineers, network engineers, and Tooling teams to automate cluster lifecycle management, integrate provisioning workflows with CI/CD pipelines, and ensure observability, resilience, and compliance across all automation systems.\nWhat you’ll be doing:\nDesign scalable, secure, and repeatable automation for Kubernetes cluster provisioning and network configuration across multi-cloud, on-prem, and hybrid environments.\nBuild Infrastructure-as-Code templates, automation pipelines, and CI/CD integrations to streamline provisioning and connectivity.\nAutomate networking integrations including CNI plugins, service meshes, load balancers, and ingress controllers.\nImplement policies, firewalling, routing, and self-service provisioning through API-driven workflows.\nDeliver observability with monitoring, logging, alerting, and self-healing workflows to improve resilience and performance.\nAct as the technical authority for network automation, mentoring teams and driving cross-functional automation maturity.\nWhat we need to see:\nDeep knowledge of Kubernetes networking (CNI, services, ingress, eBPF) and service meshes (Istio, Linkerd, Consul).\nStrong background in network security, firewalling, routing, and containerized environments.\nHands-on experience with IaC and automation tools (Terraform, Ansible, Pulumi), GitOps tooling (ArgoCD, Flux), and CI/CD systems.\nProficiency in Python, Go, or Bash, with experience building API-driven integrations (REST, gRPC).\nFamiliarity with Kubernetes lifecycle management and provisioning tools (CAPI, kubeadm, kops, Rancher, OpenShift, bare metal).\nExperience with observability and tracing stacks (Prometheus, Grafana, ELK/EFK, Jaeger, OpenTelemetry).\n8+ years in network engineering and automation development. 3+ years of experience with Kubernetes platform engineering.\nBachelor's degree or equivalent experience.\nWays to stand out from the crowd:\nProven track record of crafting and delivering automated provisioning solutions at scale.\nExperience with multi-cloud networking (AWS VPC, Azure VNet, GCP VPC)m\nExcellent architecture documentation and interpersonal skills. Ability to lead cross-functional technical initiatives.\nNVIDIA’s deep learning platforms have made major impact to various fields is broadly used across leading academic institutions, start-ups, and industry, including the world’s largest Internet companies. We need passionate, hard-working and creative people to help us take on more of these unique opportunities in deep learning cloud solutions. NVIDIA is widely considered to be one of the technology world’s most desirable employers. We have some of the most forward-thinking and hard-working people in the world working for us. Are you creative and autonomous? Do you love a challenge? If so, we want to hear from you.\nYour base salary will be determined based on your location, experience, and the pay of employees in similar positions. The base salary range is 168,000 USD - 264,500 USD for Level 4, and 200,000 USD - 322,000 USD for Level 5.\nYou will also be eligible for equity and benefits.\nApplications for this job will be accepted at least until September 13, 2025.\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/US-CA-Santa-Clara/Senior-Network-Automation-Architect---DGX-Cloud_JR2002388",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T15:37:40.669147"
  },
  {
    "title": "Senior Software Engineer, Deep Learning Inference Workflows",
    "location": "US, CA, Santa Clara",
    "experience_required": "",
    "job_description": "We are now looking for a Senior Software Engineer for Deep Learning Inference Workflows! Would you like to make a big impact in Deep Learning by helping build a state-of-the-art inference framework for accelerating Deep Learning models, especially Large Language Models, on NVIDIA GPUs? We are now welcoming exceptional software engineers to apply to Senior Engineering positions in the Deep Learning software team.\nWhat you’ll be doing:\nDevelop components of TensorRT, NVIDIA’s SDK for high-performance deep learning inference.\nUse C++ and Python to build graph parsers, optimizers, and tools for effective deployment of trained deep learning models.\nCollaborate with teams of deep learning experts, GPU architects and DevOps engineers across diverse teams.\nWhat we need to see:\nA Bachelor's, Master's, PhD or equivalent experience in Computer Science, Computer Engineering, Electrical Engineering or related field.\n6+ years of software development experience.\nStrong experience with C++11/C++14/C++17.\nStrong grasp of Machine Learning concepts, especially Natural Language Processing.\nExcellent communication skills, and an aptitude for collaboration and teamwork.\nWays to stand out from the crowd:\nProficiency in Python\nExperience in software performance benchmarking, profiling, and optimizations.\nBackground in compiler development\nExperience in working with TensorRT, PyTorch, ONNX Runtime, JAX, TRT-LLM, vLLM, SGLang, or other ML frameworks.\nExperience developing custom GPU kernels in OpenAI Triton or CUDA for deep learning inference.\nNVIDIA is widely considered to be one of the technology world’s most desirable employers. We have some of the most forward-thinking and hardworking people in the world working for us. If you're creative, autonomous and love a challenge, we want to hear from you. Come, join our TensorRT Workflows team and help build the real-time, cost-effective computing platform driving our success in this exciting and quickly growing field.\n#LI-Hybrid\nYour base salary will be determined based on your location, experience, and the pay of employees in similar positions. The base salary range is 184,000 USD - 287,500 USD.\nYou will also be eligible for equity and benefits.\nApplications for this job will be accepted at least until September 13, 2025.\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/US-CA-Santa-Clara/Senior-Software-Engineer--Deep-Learning-Inference-Workflows_JR1999917",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T15:37:43.809683"
  },
  {
    "title": "Solutions Architect - NVIDIA Cloud Partners",
    "location": "US, CA, Santa Clara",
    "experience_required": "",
    "job_description": "We are looking for an experienced Solutions Architect to help bridge the gap between design and deployment of large-scale AI and HPC GPU infrastructure. Do you want to be part of the team that brings GenAI, AI, ML, etc. hardware and software technologies to production in the field? We are looking for a Solutions Architect to join the NVIDIA team focused on supporting customers as they build the next-generation GPU infrastructure for their customers. As a part of the NVIDIA solutions architecture team, you will be driving end-to-end technology solution integration with some of NVIDIA's most strategic customers as well as offering recommendations for business and engineering teams based on customer feedback on product strategy.\nWhat you'll be doing:\nWorking with NVIDIA Cloud Partners to develop, deploy, and operationalize NVIDIA's groundbreaking hardware and software solutions.\nPartner with Sales Account Managers and other business leads to identify and secure business opportunities for NVIDIA products and solutions.\nBe the go-to technical resource for the customers as they develop and build large-scale GPU cloud infrastructure.\nConduct regular technical customer meetings for project/product details, feature discussions, intro to new technologies, and debugging sessions.\nWork with customers to build PoCs for solutions to address critical business needs by building out networking and compute infrastructure.\nPrepare and deliver technical content to customers including presentations, workshops, etc.\nAnalyze and develop joint solutions for customer performance and scaling issues.\nWhat we need to see:\nBS/MS/PhD in Electrical/Computer Engineering, Computer Science, Physics, or other Engineering fields or equivalent experience.\nMotivation and skills to help drive technical pre-sales activities.\n5+ years of Solution Engineering (or similar Sales Engineering, Cloud Engineering) experience\nExperience designing and deploying large-scale cluster environments\nPractical knowledge in data center design for AI and HPC\nEfficient time management and capable of balancing multiple tasks\nAbility to communicate ideas clearly through documents, presentations, etc.\nWays to stand out from the crowd:\nHands-on experience with NVIDIA hardware (including GPUs, networking, etc.) in large-scale AI and HPC cluster environments\nHands-on experience with NVIDIA systems software including (but not limited to) NCCL, DCGM, etc.\nExperience with GPU systems in general including, but not limited to, performance testing, AI benchmarking, etc.\nHands-on experience with cluster management and orchestration (SLURM, K8s, etc.).\nAble to think creatively to debug and solve problems.\nNVIDIA is widely considered to be one of the technology world’s most desirable employers. We have some of the most forward-thinking and hardworking people in the world working for us. If you're creative and autonomous, we want to hear from you!\nYour base salary will be determined based on your location, experience, and the pay of employees in similar positions. The base salary range is 148,000 USD - 235,750 USD for Level 3, and 184,000 USD - 287,500 USD for Level 4.\nYou will also be eligible for equity and benefits.\nApplications for this job will be accepted at least until September 13, 2025.\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/US-CA-Santa-Clara/Solutions-Architect---NVIDIA-Cloud-Partners_JR2003872",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T15:37:46.978220"
  },
  {
    "title": "Senior Manager, Accelerated Compute Systems",
    "location": "US, CA, Santa Clara",
    "experience_required": "",
    "job_description": "We are now looking for a Senior Manager for Accelerated Compute Systems!\nNVIDIA is currently hiring for a Sr Technical Management position focused on Accelerated Compute Systems. We are pioneering software and system architectures that power high-performance computing, scientific computing, machine learning, AI, datacenter, and automotive platforms. This role offers a unique opportunity to make a meaningful impact in a fast-paced, innovation-driven environment. Join NVIDIA and lead the future of Accelerated Computing\nWhat you’ll be doing:\nLeading a team of accelerated compute architects.\nCollaborating closely with hardware design, software engineering, product, and research teams to shape the direction of NVIDIA’s computing platforms.\nConducting in-depth performance analysis and optimization for current and next-generation NVIDIA GPUs.\nDesigning and refining core parallel algorithms, data structures, and reference implementations for GPU acceleration.\nExploring the interaction between hardware and software architectures to improve programming models and application performance.\nEngaging in software-hardware co-design through deep dives into accelerated computing applications.\nWhat we need to see:\nA Bachelors Degree (or equivalent experience) in Computer Science, Electrical Engineering, or related field.\n10+ overall years of industry experience, with at least 4 of those years in a management role\nStrong foundation in mathematics, especially linear algebra and numerical methods.\nPassion for performance optimization and system-level thinking.\nExperience with GPU programming models such as CUDA or OpenCL.\nFamiliarity with multi-node communication APIs like MPI or OpenSHMEM/NVSHMEM\nProficiency in C/C++, with a solid grasp of software design, algorithms, and programming techniques.\nExperience with threading APIs for multicore CPUs and Unix-style IPC\nWorking knowledge of Python.\nExcellent communication, organization, and problem-solving skills.\nNVIDIA is widely recognized as one of the most desirable employers in the tech industry, and is increasingly known as “the AI computing company.\" We’re home to some of the brightest minds in the world, working together to push the boundaries of what’s possible.\nAre you creative, collaborative, and excited by the challenge of pushing architectures to their limits? If so, we want to hear from you!\nYour base salary will be determined based on your location, experience, and the pay of employees in similar positions. The base salary range is 272,000 USD - 425,500 USD.\nYou will also be eligible for equity and benefits.\nApplications for this job will be accepted at least until September 13, 2025.\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/US-CA-Santa-Clara/Senior-Manager--Accelerated-Compute-Systems_JR2003723",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T15:37:50.142357"
  },
  {
    "title": "Senior System Software Engineer, Cloud Services",
    "location": "US, CA, Santa Clara, US, CA, Remote, 2 Locations, 2 Locations",
    "experience_required": "",
    "job_description": "GeForce NOW is Nvidia’s Cloud Gaming service, streaming games at the highest quality to any and every user, regardless of their device type and capabilities – low-end PCs, Macs, or mobile devices. Using the most advanced GPUs and Nvidia proprietary software, GeForce NOW transforms the gaming experience with always up-to-date games on always the latest hardware, a streaming experience rivaling that of a local PC, and near-instant launch – just click and play! For more details, see http://www.geforce.com/geforce-now. \nThe team within the group builds, operates, and maintains cloud-hosted services that provide user and service authentication/authorization across NVIDIA. Ensuring continuity of operations is critical to our mission. We are in search of a highly proficient software engineer with extensive experience in AWS service development, deployment, and observability practices. In this capacity, you will have the responsibility of ensuring the reliability, performance, and scalability of our services, while providing the team with actionable insights for continuous improvement. You will build, implement, and coordinate observability infrastructure to proactively identify, fix, and address operational issues across our services.\nWhat you’ll be doing:\nArchitect, implement, and maintain observability systems at scale to enable monitoring, alerting, logging, and tracing for our cloud-based services.\nDefine and refine service-level indicators (SLIs), service-level objectives (SLOs), and error budgets in partnership with service owners and product teams.\nInvent, construct, and uphold actionable dashboards that display important measurements, SLI/SLOs, and system health for distributed services.\nCollaborate with software, platform, and networking teams to integrate observability at all stages of the application lifecycle, from development to incident response.\nDrive automation efforts to reduce manual toil in monitoring, telemetry, and incident response workflows; build and maintain self-service observability tooling.\nAddress performance and reliability issues by bringing to bear root cause analysis, distributed tracing, and log correlation.\nParticipate in Pager Duty rotations, contribute to post-incident reviews, detailing findings and driving solutions that improve long-term system resilience and visibility.\nDevelop expertise in the functions and capabilities of our offerings, and assist in managing our support channels for other NVIDIA teams.\nWhat we need to see:\nBachelor’s or master’s degree in computer science, engineering, or equivalent experience in the field.\n8+ years in large-scale systems engineering roles with exposure to dealing with live service development, working end-to-end from service development, deployment, and observability, as well as being on-call.\nHands-on experience with modern monitoring systems (Prometheus, Grafana, Loki, Tempo, Datadog, New Relic, OpenTelemetry, etc.) within a production environment.\nAdvanced coding skills in Python, Go, or similar languages for building automation and integrating observability solutions. Comfort with JavaScript frameworks such as React and Next.js.\nProficiency in cloud platforms (AWS, GCP, Azure) and containerized environments (Kubernetes, Docker); experience with configuration-as-code tools (Terraform, Helm, Ansible).\nStrong communication and collaboration skills, with experience working in global, cross-disciplinary teams.\nDetailed, analytical problem-solving approach and high standards for operational excellence and customer happiness.\nExperience with incident management, postmortem processes.\nWays to stand out from the crowd:\nFamiliarity with the Java Spring Boot framework, hands-on experience with Apache Cassandra and HashiCorp Vault would be very advantageous.\nBesides our core duties, our team also manages multiple custom front-end services based on React for admin functions. Having relevant coding experience and being open to supporting development would be a huge plus.\nYour base salary will be determined based on your location, experience, and the pay of employees in similar positions. The base salary range is 184,000 USD - 287,500 USD.\nYou will also be eligible for equity and benefits.\nApplications for this job will be accepted at least until September 13, 2025.\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.",
    "job_link": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/US-CA-Santa-Clara/Senior-System-Software-Engineer--Cloud-Services_JR2003051",
    "posted_date": "",
    "company": "NVIDIA",
    "scraped_at": "2025-09-10T15:37:53.312817"
  }
]