[
  {
    "title": "Account Content Strategist, Executive Marketing",
    "location": "London",
    "experience_required": null,
    "job_description": "Who we are\nAbout Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies—from the world’s largest enterprises to the most ambitious startups—use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone’s reach while doing the most important work of your career.\nAbout the team\nThe Global Executive Marketing team creates experiences for the executive audience that build advocacy and trust, strengthen relationships, and generate revenue. We understand the executive audience and create content and experiences to programmatically reach them, ultimately helping Stripe attract, grow, and retain our most strategic users. \n What you’ll do\nAs a member of the Executive Briefing team, you will work in partnership with Executive Briefing Managers and several cross-functional teams (Product Marketing, Product, Sales, Customer Success, Stripe executive leadership, and more) to develop executive-facing briefing materials that educate and inspire existing and prospective customers and position Stripe as the leading partner for financial infrastructure. \nResponsibilities\nCurate account-specific insights and research and translate that into tailored presentation content for a range of industries, business models, and geographies\nProactively partner with Stripe leaders and cross functional teams to create and repurpose narratives and visual content for executive briefings that ultimately help accelerate account momentum and build trust in Stripe as a partner\nDevelop bespoke content—in tight alignment with Stripe’s brand—that communicates Stripe’s solutions and tells compelling narratives to executive buyers across Stripe’s global briefing centers\nRegularly gather feedback from the EBC team to refine and adapt the content strategy, ensuring the EBC's offerings remain compelling and effective in conveying Stripe’s value proposition\nPresent regularly on content resonance and learnings to key stakeholders\nContinually measure, monitor and drive improvement in program approaches; employ industry best practices and look for opportunities to increase effectiveness and efficiency\nIdentify opportunities to leverage and scale initiatives across executive engagement programs\n Who you are\nWe’re looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. The preferred qualifications are a bonus, not a requirement.\nMinimum requirements\n7 years+ of account planning or account strategy experience\nStrong storytelling or pitch deck creation skills and ability to translate business objectives into solution-oriented recommendations\nExperience synthesizing multiple sources of information into thoughtful narratives and content for specific products, solutions, industries, and/or audiences\nExperience with complex technical products\nAbility to write effective copy is a necessity; graphic design capabilities are a plus\nStrong cross-functional collaboration skills with Sales, Product, and Marketing teams to produce user-centric content\nBachelor’s degree with an emphasis on communications, marketing, journalism, business, or related field (in lieu of degree, 5+ years of experience in customer-facing B2B sales or marketing roles)\nExcellent problem-solving, critical thinking, written and verbal communication, and analytical skills\nStrong project- and stakeholder-management skills  and ability to deliver in tight deadlines\nPreferred qualifications\nPrevious background in executive briefing or sales enablement roles\nExperience in visual storytelling for assets such as presentations, videos, blogs, and/or webpages\nExperience managing a creative agency",
    "job_link": "https://stripe.com/jobs/listing/account-content-strategist-executive-marketing/7089230",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:50:41.534685"
  },
  {
    "title": "Account Executive, BaaS Product Sales (German Speaking)",
    "location": "Berlin",
    "experience_required": null,
    "job_description": "Who we are\nAbout Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies - from the world’s largest enterprises to the most ambitious startups - use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone's reach while doing the most important work of your career.\nAbout the team\nStripe is investing in building out its Banking-as-a-Service (BaaS) Product Sales team to actively engage prospects and customers to help them transform their business through building on Stripe’s platform. \nStripe's global Product Sales team is at the forefront of driving revenue and growth. As trusted business partners, our goal is to help users understand Stripe products and integrate them with ease so they can concentrate on what's most important to them: their business. We're known for our product expertise, rigorous thinking, and user-first approach to problem solving. Within Stripe, Product Sales proudly serves as a critical source of user feedback and market intelligence, with direct influence on Stripe’s product roadmap and growth strategy. \nWhat you’ll do\nAs an Account Executive, BaaS, you will use your sales and product expertise to help drive growth of Stripe’s BaaS (Issuing, Capital and Treasury) products across a range of customers. You will collaborate with product, engineering, marketing, and other GTM teams to develop deep product and industry knowledge and drive complex deals. You will be instrumental in leading in depth product discussions with existing and prospective customers – and building and executing against our go to market strategy.\nYou are an adept sales professional, capable of engaging in business-level and technical conversations at multiple levels of the organization. You are used to building value in competitive situations and enjoy working on products that require deep product understanding, combined with technical knowledge. You’re as comfortable working with clients as with internal stakeholders. You’re excited to become an expert and to share your knowledge. You’re an organized self-starter, an excellent communicator who is analytical and has a track record for improving the processes and organizations around you.\nResponsibilities\nAccountable for driving revenue, increasing attach rates, and new client acquisition for a wide range of customers including SMBs, Startups, and Digital Natives\nDevelop relationships with executive stakeholders and lead discussions with existing and prospective BaaS customers\nDeeply understand the sales process and competitors for Stripe Issuing & Treasury and serve as both an internal and customer-facing expert in these product areas\nEngage with Product and Engineering teams to synthesize and relay customer feedback and our findings to inform Stripe’s product roadmap\nContribute to the development of go-to-market playbooks alongside product, marketing, sales, and technical services stakeholders\nWork collaboratively and cross-functionally across the organization to help shape Stripe’s products and solutions to meet customer needs\nWho you are\nWe’re looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. The preferred qualifications are a bonus, not a requirement.\nMinimum requirements\n6+ years of customer facing experience at a leading technology or payments company and a track record of top performance\nExperience building trusted advisor relationships with senior business leaders\nProven ability to build strong collaborative working relationships with cross-functional business partners\nSelf-starter capable of operating independently to drive meaningful business results\nEnthusiastic “roll up your sleeves” mentality\nExcellent verbal and written communication skills\nAbility to understand complex technical requirements and craft solutions across multiple stakeholders\nProven experience to lead complex negotiations involving bespoke commercial agreements\nThrives in a fast-paced environment and changing requirements\nTrue team player - always\nHumor is very welcomed\nFluent in German and English\nPreferred qualifications\n3+ years of experience specifically selling online and offline payments / issuing solutions",
    "job_link": "https://stripe.com/jobs/listing/account-executive-baas-product-sales-german-speaking/6931807",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:50:43.065814"
  },
  {
    "title": "Account Executive, Billing",
    "location": "Remote in United States",
    "experience_required": null,
    "job_description": "Who we are\nAbout Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies - from the world’s largest enterprises to the most ambitious startups - use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone's reach while doing the most important work of your career.\nAbout the team\nWhat you’ll do\nAs a Billing Account Executive at Stripe, you will use your sales and product expertise to help drive growth through both existing and new to Stripe customers. You will collaborate with the core sales, marketing, product marketing, and product teams to develop deep product and industry knowledge and drive strategic deals. You will be instrumental in leading in depth product discussions with existing and prospective customers – and building and executing against our go to market strategy.\nResponsibilities\nDrive revenue to achieve and over perform on target and KPIs\nLead new sales and upsell conversations of Stripe for existing and prospective customers.\nDrive strategic thought leadership within assigned territory to ensure user success and revenue growth \nDeeply understand the sales process and competitors for Stripe, including software, hardware and payments.\nServe as both an internal and customer-facing expert on Stripe, especially for your specialized products.\nSynthesize and relay customer feedback and our findings to inform Stripe’s product roadmap.\nEngage with Product, Marketing and User Operations teams to help amplify our growth trajectory.\nWho you are\nYou are an adept salesperson, capable of engaging in business-level and technical conversations at multiple levels of the organization, including CEO, CFO, and CTO. You are used to building value in competitive situations and enjoy working on products that require deep product understanding, combined with technical knowledge. You’re as comfortable working with clients as with internal stakeholders (including executives). You’re excited to become an expert and to share your knowledge. You’re an organized self-starter, an excellent communicator who is highly analytical and has a track record for improving the processes and organizations around you.\nMinimum requirements\n10+ years of sales or prospecting experience at a technology company and a track record of top performance.\nOwning a direct sales quota, with direct sales experience closing new business and/or expansion of existing users.\nA proven ability to build strong collaborative working relationships with business partners. \nThe ability to deal effectively with ambiguity and thrive in an unstructured, fast-moving environment.\nA proven ability to be a self-starter capable of driving business results without significant supervision.\nAn enthusiastic “roll up your sleeves” mentality.\nExcellent verbal and written communication skills.\nStrong presentation skills, particularly for in-person meetings with multiple stakeholders. \nProven ability to lead complex negotiations involving bespoke commercial agreements. \nAbility to understand complex technical requirements and craft solutions across multiple stakeholders.\nExcellent verbal and written communication skills.\nPreferred qualifications \n3+ years of experience specifically selling financial services or similar software.  \nExperience in selling billing solutions. \nProven ability to sell in a fast paced environment.",
    "job_link": "https://stripe.com/jobs/listing/account-executive-billing/7141701",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:50:44.461160"
  },
  {
    "title": "Account Executive, Commercial (New Business)",
    "location": "Chicago",
    "experience_required": null,
    "job_description": "Who we are\nAbout Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies—from the world’s largest enterprises to the most ambitious startups—use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone’s reach while doing the most important work of your career.\nAbout the team\nThe Commercial team is a high-velocity sales team focused on acquiring new, under-penetrated mid-market customers. As an Account Executive on the Commercial Business sales team, you’ll be responsible for sourcing and closing new business, executing outbound sales strategies, and running end-to-end sales cycles to bring new customers onto Stripe. You’ll play a critical role in expanding Stripe’s reach by identifying high-potential prospects and converting them into long-term users of our platform.\nWhat you’ll do\nAs a Commercial New Business Account Executive, you will play an instrumental role in fueling Stripe’s growth by acquiring new mid-market customers. In this role, you will also help build out a new team and go-to-market (GTM) motion at Stripe.\nResponsibilities\nIdentify high-potential prospective users and use effective prospecting strategies to generate leads that drive net-new revenue growth in your territory\nDevelop and implement scaled sales strategies for acquiring new customers and driving adoption of Stripe’s products across new accounts\nIdentify and understand users’ pain points to propose Stripe solutions and own the full sales cycle, from business case development to close\nWork cross-functionally to solve user pain points and improve our product to better serve new customer needs\nWho you are\nWe’re looking for a high performing, well-rounded seller who can manage high velocity deal cycles, enjoys building and has demonstrated success dealing with ambiguity and operating in a high-growth environment. If you're hungry, persistent and willing to roll up your sleeves to build the plane while we’re flying it, we want to hear from you!\nMinimum requirements\nMinimum of 5+ years full sales cycle/closing experience with new business accounts\nAbility to understand technical requirements and craft solutions across multiple technology products\nAbility to perform quantitative analysis and independently manage pricing negotiations \nStrong operational acumen and ability to manage and prioritize a book of 100 accounts \nAbility and motivation to operate in a highly ambiguous and fast-paced environment\nSuperior verbal and written communication skills\nYou will be required to work from the Chicago office three (3) days per week\nPreferred qualifications\nPrior experience in a sales and/or customer-facing role at a high growth payments company",
    "job_link": "https://stripe.com/jobs/listing/account-executive-commercial-new-business/7015293",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:50:45.829934"
  },
  {
    "title": "Account Executive, Enterprise",
    "location": "Toronto",
    "experience_required": null,
    "job_description": "Who we are\n  About Stripe   Stripe is a financial infrastructure platform for businesses. Millions of companies—from the world’s largest enterprises to the most ambitious startups—use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone’s reach while doing the most important work of your career. ###  \nWhat you’ll do\nHelp Stripe grow its enterprise business. As an Account Executive, Enterprise, you will drive Stripe’s future growth engine by building relationships with prospective users and turning them into happy Stripe users.   Responsibilities * Own a named account list and develop account plans for winning and expanding business with enterprise companies\n* Develop outbound strategies to create and nurture opportunities\n* Own the full sales cycle from prospecting to close, to go live for enterprise companies\n* Develop relationships with executive stakeholders at new and existing users\n* Work with company leaders from multiple functions (e.g., Engineering, Product, and Finance) to lead complex product workshops and develop financial analyses\n* Lead and contribute to team projects to develop and refine our sales process\n* Engage with cross functional teams (Partners, Post Sales, Product and Engineering) to help drive and iterate Stripe’s strategy\nWho you are\nYou are an adept salesperson, capable of engaging in business-level and technical conversations at multiple levels of the organization, including the CTO, COO, and CFO. You have experience working with upper middle market and enterprise companies. You have an in-depth understanding of the buyer journey and can lead a complex, multi-party sale in a highly consultative manner. You are used to building value in competitive situations and enjoy working on products that require deep product understanding, combined with technical knowledge. You are naturally analytical and enjoy digging into business models and helping businesses quantify their investment decisions. You get excited about prospecting, and are capable of independently leading a sales cycle from start to finish. Finally, you enjoy building – you like to actively participate in the development of our sales process, the articulation of our value proposition, and the creation of key tools and assets.   If you’re motivated, smart, persistent, and a great teammate, we want to hear from you! We're looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. Minimum requirements * 10+ years of sales experience, preferably at a technology company, with a track record of top performance\n* Ability to understand complex business problems companies face today, and craft solutions across multiple products\n* Ability to develop and execute account plans spanning multiple business units across complex organizations\n* Strong presentation skills, particularly for in-person meetings with multiple stakeholders\n* Proven ability to lead complex negotiations involving bespoke commercial agreements\n* Superior verbal and written communication skills\n* Ability to operate in a highly ambiguous and fast-paced environment\n* Strong interest in technology",
    "job_link": "https://stripe.com/jobs/listing/account-executive-enterprise/7099651",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:50:47.237374"
  },
  {
    "title": "Account Executive, Enterprise - FinTech",
    "location": "London",
    "experience_required": null,
    "job_description": "Who we are\nAbout Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies - from the world’s largest enterprises to the most ambitious startups—use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone’s reach while doing the most important work of your career.\nAbout the team\nThe UK FinTech sales team works with our largest users in the industry. We help users improve their customer buying experiences, move money globally, expand to new territories and unlock new revenue streams. Market leaders in their respective industries already using Stripe include Monzo, Revolut, Zepz Group, Starling Bank and more. \nAs a key member of the UK Enterprise team, you will manage and elevate relationships with a named account list while identifying new growth opportunities and ways Stripe can exceed expectations. If you’re motivated, smart, persistent, and a great teammate, we want to hear from you!\nWhat you’ll do\nAs an Account Executive (Existing Business), you will create partnerships between Stripe and the most innovative and fastest-growing companies in the world by helping them to understand how Stripe’s online commerce infrastructure can make payments a competitive advantage for their businesses.\nResponsibilities\nDirectly manage and nurture a named account list and develop account plans for winning and expanding business with upper middle market and enterprise companies\nBuild and maintain key relationships with C-level executives, while orchestrating the right executive touch points as well\nContribute to shaping our FinTech strategy, building repeatable processes and scaled engagement models\nDevelop outbound strategies to create and nurture opportunities\nOwn the full sales cycle from lead to close for upper middle market and enterprise companies\nDevelop relationships with executive stakeholders at new and existing clients\nWork with company leaders from multiple functions (e.g., Engineering, Product, and Finance) to lead complex product workshops and financial analyses\nLead and contribute to team projects to develop and refine our sales process\nEngage with Product and Engineering teams to help drive product strategy\nWho you are\nYou are an adept salesperson and relationship manager capable of engaging in business-level and technical conversations at multiple levels of the organisation, including the CTO, COO, and CFO. You have experience working with upper middle market and enterprise companies. You have an in-depth understanding of the buyer journey and can lead a complex, multi-party sale in a highly consultative manner. You are used to building value in competitive situations and enjoy working on products that require deep product understanding, combined with technical knowledge. You are naturally analytical and enjoy digging into business models and helping customers quantify their investment decisions. You get excited about prospecting, and are capable of independently leading a sales cycle from start to finish. Finally, you enjoy building – you like to actively participate in the development of our sales process, the articulation of our value proposition, and the creation of key tools and assets.\nIf you’re motivated, smart, persistent, and a great teammate, we want to hear from you!\nMinimum requirements\n8+ years of sales experience, preferably selling a technical product, with a track record of top performance. \nExtensive experience directly selling a technology product or service, preferably at an API-first company, with a record of top performance. \nA proven track record of moving sales processes forward from inception to close by leading complex, multi-party sales in a highly consultative manner, understanding strategies and applying value proposition\nGreat listening skills and ability to quickly become a trusted resource for decision-makers across technology and finance orgs within software companies\nAn ability to understand complex technical problems and understand how Stripe’s solutions can address them\nA positive attitude and tireless work ethic when encountering blockers to success, whether external or internal\nStrong presentation skills\nProven ability to lead complex negotiations involving bespoke commercial agreements\nSuperior verbal and written communication skills\nAbility to operate in a highly ambiguous and fast-paced environment\nStrong interest in technology and a deep understanding of the space\nFastidious approach to CRM hygiene and experience utilizing thorough sales forecasting metrics on a weekly/quarterly basis and communicating them in a succinct manner\nPreferred requirements\nPrior experience at a growth stage Internet/Software company\nExperience in FinTech or selling to FinTechs is a plus, but not a prerequisite",
    "job_link": "https://stripe.com/jobs/listing/account-executive-enterprise-fintech/7144314",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:50:48.711230"
  },
  {
    "title": "Account Executive, Enterprise (New Business)",
    "location": "New York",
    "experience_required": null,
    "job_description": "Who we are\nAbout Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies—from the world’s largest enterprises to the most ambitious startups—use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone’s reach while doing the most important work of your career.\nWhat you’ll do\nAs an Enterprise Account Executive covering new business, you’ll identify new opportunities to expand Stripe’s footprint. Specifically, we’re looking for someone who can execute on long-term sales strategies, engage with internal and external stakeholders, align on technical and business requirements with product teams, build value in competitive situations, lead commercial negotiations, and close deals.\nResponsibilities\nExpand business with high growth technology companies\nDevelop outbound strategies to create and nurture opportunities\nDrive deal strategy and commercial negotiations for large, complex renewals\nDevelop relationships with executive stakeholders within your book of business\nBe responsible for account mapping and coordinating effective meetings with the appropriate external stakeholders expanding the customer relationship\nLead and contribute to team projects to develop and refine our sales process and help shape the Stripe sales culture\nWho you are\nWe’re looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. The preferred qualifications are a bonus, not a requirement.\nMinimum requirements\n10+ years of sales experience, preferably selling a highly technical product to enterprise customers, with a track record of top performance\nAbility to understand technical requirements and craft solutions across multiple products\nAbility to develop and execute account plans spanning multiple business units across complex organizations\nA knack for working well with a wide range of people, both internally and externally\nStrong presentation skills, particularly for in-person meetings with multiple stakeholders\nProven ability to lead complex negotiations involving bespoke commercial agreement\nAbility to operate in a highly ambiguous and fast-paced environment\nStrong interest in technology and a deep understanding of the space",
    "job_link": "https://stripe.com/jobs/listing/account-executive-enterprise-new-business/6755526",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:50:50.096895"
  },
  {
    "title": "Account Executive, Enterprise (Sao Paulo, Brazil)",
    "location": "Remote in Brazil",
    "experience_required": null,
    "job_description": "Account Executive, Enterprise (San Paulo - Brazil)\nWho we are\nAbout Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies—from the world’s largest enterprises to the most ambitious startups—use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone’s reach while doing the most important work of your career.\n About the team\nThe LatAm Enterprise team is a highly consultative sales team that is responsible for the growth of Stripe’s largest customers within the region. We work with the most ambitious and fastest growing companies - Stripe’s payments and financial infrastructure unlocks new revenue streams and growth opportunities for their businesses.\n What you’ll do\nAs a key member of the Enterprise Sales team, you will manage and elevate relationships with a named account list while identifying new growth opportunities and ways Stripe can exceed expectations. This role will be dedicated to accounts located in San Paulo - Brazil.\nResponsibilities\nIdentify high-potential prospective users and use effective prospecting strategies to generate leads that drive net-new revenue growth in your territory\nBuild and maintain key relationships with C-level executives, while orchestrating the right executive touch points as well\nContribute to shaping our platform partnership strategy and building repeatable processes and scaled engagement models\nDevelop outbound strategies to create and nurture opportunities\nOwn the full sales cycle from lead to close for upper middle market and enterprise companies\nDevelop relationships with executive stakeholders at new and existing clients\nWork with company leaders from multiple functions (e.g., Engineering, Product, and Finance) to lead complex product workshops and financial analyses\nLead and contribute to team projects to develop and refine our sales process\nEngage with Product and Engineering teams to help drive product strategy\n Who you are\nYou are an adept salesperson and relationship manager capable of engaging in business-level and technical conversations at multiple levels of the organization, including the CTO, COO, and CFO. You have experience working with upper middle market and enterprise companies. You have an in-depth understanding of the buyer journey and can lead a complex, multi-party sale in a highly consultative manner. You are used to building value in competitive situations and enjoy working on products that require deep product understanding, combined with technical knowledge. You are naturally analytical and enjoy digging into business models and helping customers quantify their investment decisions. You get excited about prospecting, and are capable of independently leading a sales cycle from start to finish. Finally, you enjoy building – you like to actively participate in the development of our sales process, the articulation of our value proposition, and the creation of key tools and assets.\nIf you’re motivated, smart, persistent, and a great teammate, we want to hear from you!\n Minimum requirements\n5+ years of sales experience, preferably selling payments and/or consumption-based technology, with a track record of top performance\nExtensive experience directly selling a payments technology product or service, preferably at an API-first company, with a record of top performance\nA proven track record of moving sales processes forward from inception to close by leading complex, multi-party sales in a highly consultative manner, understanding strategies and applying value proposition\nGreat listening skills and ability to quickly become a trusted resource for decision-makers across technology and finance orgs within software companies\nAn ability to understand complex technical problems and understand how Stripe’s solutions can address them\nA positive attitude and tireless work ethic when encountering blockers to success, whether external or internal\nStrong presentation skills\nProven ability to lead complex negotiations involving bespoke commercial agreements\nSuperior verbal and written communication skills in both English and Portuguese\nAbility to operate in a highly ambiguous and fast-paced environment\nStrong interest in technology and a deep understanding of the space\nExperience in or excitement in learning about financial technology infrastructure\nFastidious approach to CRM hygiene and experience utilizing thorough sales forecasting metrics on a weekly/quarterly basis and communicating them in a succinct manner",
    "job_link": "https://stripe.com/jobs/listing/account-executive-enterprise-sao-paulo-brazil/7108249",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:50:51.472624"
  },
  {
    "title": "Account Executive, Enterprise Japan",
    "location": "Tokyo",
    "experience_required": null,
    "job_description": "Who we are\nAbout Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies—from the world’s largest enterprises to the most ambitious startups—use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone’s reach while doing the most important work of your career.\nWhat you’ll do\nAs an Account Executive at Stripe, you will drive Stripe’s future growth engine by building relationships with prospective users and turning them into happy Stripe users.\nResponsibilities\nOwn a named account list and develop account plans for winning and expanding business with middle market and enterprise companies\nDevelop outbound strategies to create and nurture opportunities\nOwn the full sales cycle from prospecting to close, to go live for middle market and enterprise companies\nDevelop relationships with executive stakeholders at new and existing users\nWork with company leaders from multiple functions (e.g., Engineering, Product, and Finance) to lead complex product workshops and develop financial analyses\nLead and contribute to team projects to develop and refine our sales process\nOperate with high agency in a high-growth startup environment\nContribute to a results-oriented culture while demonstrating humility, resilience and receptiveness to constructive feedback to find the globally optimal outcome\nEngage with cross functional teams (Partners, Post Sales, Product and Engineering) to help drive and iterate Stripe’s strategy\nWho you are\nYou are an adept salesperson, capable of engaging in business-level and technical conversations at multiple levels of the organization, including the CTO, COO, and CFO. You have experience working with upper middle market and enterprise companies. You have an in-depth understanding of the buyer journey and can lead a complex, multi-party sale in a highly consultative manner. You are used to building value in competitive situations and enjoy working on products that require deep product understanding, combined with technical knowledge. You are naturally analytical and enjoy digging into business models and helping businesses quantify their investment decisions. You get excited about prospecting, and are capable of independently leading a sales cycle from start to finish. Finally, you enjoy building – you like to actively participate in the development of our sales process, the articulation of our value proposition, and the creation of key tools and assets.\nIf you’re motivated, smart, persistent, and a great teammate, we want to hear from you!\nWe’re looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. The preferred qualifications are a bonus, not a requirement.\nMinimum requirements\n10+ years of sales experience, preferably at a technology company, with a track record of consistent top performance\nProven ability to operate within a high performing culture with strong humility and resilience and respect\nAbility to own executive relationships with top customers, prospects and industry thought leaders, resulting in better sales outcomes.\nAbility to understand complex business problems companies face today,  and craft solutions across multiple products\nAbility to develop and execute account plans spanning multiple business units across complex organizations\nStrong presentation skills, particularly for in-person meetings with multiple stakeholders\nProven ability to lead complex negotiations involving bespoke commercial agreements\nSuperior verbal and written communication skills in English and Japanese\nAbility to operate in a highly ambiguous and fast-paced environment\nStrong interest in technology\nPreferred requirements\nPrior experience at a growth stage Internet / Software company",
    "job_link": "https://stripe.com/jobs/listing/account-executive-enterprise-japan/6433160",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:50:52.744957"
  },
  {
    "title": "Account Executive, Existing Business (Japan)",
    "location": "Tokyo",
    "experience_required": null,
    "job_description": "Who We Are\nAbout Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies—from the world’s largest enterprises to the most ambitious startups—use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone’s reach while doing the most important work of your career.\nAbout The Team\nThe Existing Business team is a highly consultative group that manages relationships with and is responsible for the growth and retention of Stripe’s fastest growing users.\nWhat You’ll Do\nAs an Account Executive (Existing Business), you’ll identify opportunities for our users to get the most out of Stripe by quickly understanding our users’ needs in order for them to grow with us. We’re looking for a well-rounded strategic operator who is capable of engaging in business-level and technical conversations at multiple levels of the organisation, including CTO, COO, and CFO in order to drive commercial outcomes. You are used to building value in competitive situations and enjoy working on products that require deep product understanding, combined with technical knowledge.\nThis is a dynamic role, evolving rapidly. If you’re hungry, smart, persistent, adaptable and a great teammate, we want to hear from you!\nResponsibilities\nBe responsible for managing a portfolio of Stripe’s startup, SMB and Commercial users.\nProactively identify growth opportunities with existing accounts, manage outreach strategies and drive upsell.\nStrategically identify, engage, grow and retain Stripe’s fastest growing SSMB & Commercial users\nManage incoming and proactive contract renewals and close business with existing accounts.\nBalance reactive client requests along with proactive engagements to maximise impact and client value.\nSolve complex client needs and work across product, marketing, risk and operations teams to improve our product.\nWho You Are\nWe’re looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. The preferred qualifications are a bonus, not a requirement.\nMinimum Requirements\nBe responsible for managing a portfolio of Stripe’s startup and SMB users.\nProactively identify growth opportunities with existing accounts, manage outreach strategies and drive upsell.\nSuperior verbal and written communication skills in both English and Japanese\nStrategically identify, engage, grow and retain Stripe’s fastest growing startup users.\nManage incoming and proactive contract renewals and close business with existing accounts.\nBalance reactive client requests along with proactive engagements to maximise impact and client value.\nSolve complex client needs and work across product, marketing, risk and operations teams to improve our product.\nPreferred Qualifications\nAbility to understand the Stripe API\nExperience with Excel and SQL, or a willingness to learn.",
    "job_link": "https://stripe.com/jobs/listing/account-executive-existing-business-japan/7013117",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:50:54.102269"
  },
  {
    "title": "Account Executive, Fintech - Privy",
    "location": "New York Privy HQ",
    "experience_required": null,
    "job_description": "About Privy\nOur mission is to make privacy and user ownership the default online. We build simple, flexible developer tooling that make it easy to build products that put users first. By leveraging modern cryptography, we shift the status quo around digital ownership and protect the accounts and assets of millions of users.\nLearn more about Privy:\nPrivy and Stripe: Bringing crypto to everyone\nWhat you’ll do\nLead Generation & Pipeline Management: Partner with the Head of Fintech Go-to-Market (GTM) to generate, close, and deliver a robust pipeline of enterprise prospects. You will build and iterate outbound campaigns based on feedback and manage a pipeline across multiple ICP's\nProduct Expertise & Discovery: Become an expert on Privy's products, confidently leading initial discovery calls with fintech prospects to understand their needs and demonstrate our value.\nDeal Cycle Management: Own a pipeline of customer relationships, acting as the main Privy stakeholder for high priority customers until they implement Privy in production.\nStrategic GTM Support: Contribute to the overall Fintech GTM team strategy for both North America and global markets.\nMarket Analysis: Conduct in-depth market analysis to identify emerging trends, new opportunities, and shape our counter-positioning\nGrowth Initiatives: Assist on projects and initiatives aimed at refining our strategy and playbook, both regionally and globally. This includes collaborating on our product roadmap, pricing strategies, and other partnership efforts.\nIndustry Representation: Represent Privy at key industry events and conferences, serving as a knowledgeable and engaging spokesperson for our fintech vertical.\nWho you are\nWe're seeking a proactive and results-oriented individual with a strong background in sales or business development within the fintech sector. You should possess excellent communication, negotiation, and sales skills, with a proven ability to build and maintain strong client relationships.\nMinimum requirements\n5+ years of direct fintech sales experience\nProven track record of achieving sales quotas.\nStrong analytical and problem-solving skills to identify client needs and propose effective solutions.\nExcellent communication, negotiation, and interpersonal skills.\nAbility to work in a fast-paced and dynamic environment.\nExperience with CRM software and sales management tools.",
    "job_link": "https://stripe.com/jobs/listing/account-executive-fintech-privy/7194946",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:50:55.388868"
  },
  {
    "title": "Account Executive, Funded Startups (New Business)",
    "location": "Chicago",
    "experience_required": null,
    "job_description": "Who we are\nAbout Stripe Stripe is a financial infrastructure platform for businesses. Millions of companies—from the world’s largest enterprises to the most ambitious startups—use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone’s reach while doing the most important work of your career.\nAbout the team Stripe’s Funded AE team sits within our New Business Sales function and is responsible for closing net-new accounts for Stripe. You have the opportunity to sell the entire suite of Stripe products and run the full sales cycle through onboarding.\nWhat you’ll do\nAs a Startup Account Executive at Stripe, you will drive Stripe’s future growth engine by building relationships with founders of the fastest growing venture-backed companies. You’ll manage inbound leads and the full sales cycle through onboarding, turning them into happy Stripe users.\nResponsibilities * Own the full sales cycle from lead to close for startups \n* Identify high-potential prospective users from inbound leads\n* Lead and contribute to team projects to develop and refine our sales process, including engaging with Accelerators and VC firms\n* Engage with Product, Marketing and User Operations teams to help amplify our growth trajectory  \nWho you are You’re a motivated, users-first driven individual, capable of engaging in business-level and technical conversations at multiple levels of the organization. You have experience working with startups or small/medium businesses, or are currently in a client facing role. You have an understanding of the buyer journey and can lead short, single stakeholder deals as well as complex multi-party sales in a highly consultative manner. You are used to building value in competitive situations and enjoy working on products that require deep understanding, combined with technical knowledge. As a member of the Funded Startup team, you’ll incubate and launch new sales channels for prospective users. Finally, you’ll develop scalable strategies and repeatable processes that enable us to amplify the number of new businesses joining Stripe. If you’re smart, persistent, and a great teammate, we want to hear from you!\nMinimum requirements * 2+ years of sales or client facing experience, preferably at a high-growth Saas company, bank, consultancy or venture capital firm, with a track record of top performance\n* Ability to understand the Stripe API and build great relationships with highly technical founders\n* Ability to understand complex requirements and craft custom solutions\n* Strong analytical and quantitative capabilities including comfort with basic modeling\n* Superior verbal and written communication skills\n* Ability to operate in a highly ambiguous and fast-paced environment\n* Strong interest in technology",
    "job_link": "https://stripe.com/jobs/listing/account-executive-funded-startups-new-business/7210530",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:50:56.890366"
  },
  {
    "title": "Account Executive, Platforms - Hunter",
    "location": "London",
    "experience_required": null,
    "job_description": "Who we are\nAbout Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies—from the world’s largest enterprises to the most ambitious startups—use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone’s reach while doing the most important work of your career.\nAbout the team\nThe Platform Sales team works with B2B Software Platforms to help them facilitate payments for their customers using our Stripe Connect product. Software Platforms, also known as B2B Indirect, are software platform businesses who serve other businesses. Platforms already using Stripe include Shopify, Lightspeed and Mindbody.\nAs a key member to the Stripe Platforms team, you will manage and elevate relationships with a named account list while identifying new growth opportunities and ways Stripe can exceed expectations. This role will be dedicated to accounts located in the UK. \nIf you’re motivated, smart, persistent, and a great teammate, we want to hear from you!\nWhat you’ll do\nAs an Account Executive (New Business), you will create partnerships between Stripe and the most innovative and fastest-growing software platforms in the world by helping them to understand how Stripe’s online commerce infrastructure can make payments a competitive advantage for their businesses.\nResponsibilities\nDirectly manage and nurture a named account list and develop account plans for winning and expanding business with upper middle market and enterprise companies\nBuild and maintain key relationships with C-level executives, while orchestrating the right executive touch points as well\nContribute to shaping our platform partnership strategy and building repeatable processes and scaled engagement models\nDevelop outbound strategies to create and nurture opportunities\nOwn the full sales cycle from lead to close for upper middle market and enterprise companies\nDevelop relationships with executive stakeholders at new and existing clients\nWork with company leaders from multiple functions (e.g., Engineering, Product, and Finance) to lead complex product workshops and financial analyses\nLead and contribute to team projects to develop and refine our sales process\nEngage with Product and Engineering teams to help drive product strategy\nWho you are\nYou are an adept salesperson and relationship manager capable of engaging in business-level and technical conversations at multiple levels of the organization, including the CTO, COO, and CFO. You have experience working with upper middle market and enterprise companies. You have an in-depth understanding of the buyer journey and can lead a complex, multi-party sale in a highly consultative manner. You are used to building value in competitive situations and enjoy working on products that require deep product understanding, combined with technical knowledge. You are naturally analytical and enjoy digging into business models and helping customers quantify their investment decisions. You get excited about prospecting, and are capable of independently leading a sales cycle from start to finish. Finally, you enjoy building – you like to actively participate in the development of our sales process, the articulation of our value proposition, and the creation of key tools and assets.\nIf you’re motivated, smart, persistent, and a great teammate, we want to hear from you!\nMinimum requirements\n8+ years of sales experience, preferably selling a technical product, with a track record of top performance\nExtensive experience directly selling a technology product or service, preferably at an API-first company, with a record of top performance\nA proven track record of moving sales processes forward from inception to close by leading complex, multi-party sales in a highly consultative manner, understanding strategies and applying value proposition\nGreat listening skills and ability to quickly become a trusted resource for decision-makers across technology and finance orgs within software companies\nAn ability to understand complex technical problems and understand how Stripe’s solutions can address them\nA positive attitude and tireless work ethic when encountering blockers to success, whether external or internal\nStrong presentation skills\nProven ability to lead complex negotiations involving bespoke commercial agreements\nSuperior verbal and written communication skills\nAbility to operate in a highly ambiguous and fast-paced environment\nStrong interest in technology and a deep understanding of the space\nExperience in or excitement in learning about financial technology infrastructure\nFastidious approach to CRM hygiene and experience utilizing thorough sales forecasting metrics on a weekly/quarterly basis and communicating them in a succinct manner\nPreferred requirements\nPrior experience at a growth stage Internet/Software company\nExperience in fintech/payments is a plus, but not prerequisite",
    "job_link": "https://stripe.com/jobs/listing/account-executive-platforms-hunter/7100847",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:50:58.505797"
  },
  {
    "title": "Account Executive, Platforms (Existing Business)",
    "location": "New York",
    "experience_required": null,
    "job_description": "Who we are\nAbout Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies—from the world’s largest enterprises to the most ambitious startups—use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone’s reach while doing the most important work of your career.\nAbout the team\nThe Platform Sales team works with B2B Software Platforms to help them facilitate payments for their customers using our Stripe Connect product. Software Platforms, also known as B2B Indirect, are software platform businesses who serve other businesses. Platforms already using Stripe include Shopify, Lightspeed and Mindbody.\nAs a key member to the Stripe Platforms team, you will manage and elevate relationships with a named account list while identifying new growth opportunities and ways Stripe can exceed expectations. \nIf you’re motivated, smart, persistent, and a great teammate, we want to hear from you!\nWhat you’ll do\nAs an Account Executive (Existing Business), you will create partnerships between Stripe and the most innovative and fastest-growing software platforms in the world by helping them to understand how Stripe’s online commerce infrastructure can make payments a competitive advantage for their businesses.\nResponsibilities\nDirectly manage and nurture a named account list and develop account plans for winning and expanding business with enterprise companies\nBuild and maintain key relationships with C-level executives, while orchestrating the right executive touch points as well\nContribute to shaping our platform partnership strategy and building repeatable processes and scaled engagement models\nDevelop outbound strategies to create and nurture opportunities\nOwn the full sales cycle from lead to close for enterprise companies\nDevelop relationships with executive stakeholders at new and existing clients\nWork with company leaders from multiple functions (e.g., Engineering, Product, and Finance) to lead complex product workshops and financial analyses\nLead and contribute to team projects to develop and refine our sales process\nEngage with Product and Engineering teams to help drive product strategy\nWho you are\nYou are an adept salesperson and relationship manager capable of engaging in business-level and technical conversations at multiple levels of the organization, including the CTO, COO, and CFO. You have experience working with enterprise companies. You have an in-depth understanding of the buyer journey and can lead a complex, multi-party sale in a highly consultative manner. You are used to building value in competitive situations and enjoy working on products that require deep product understanding, combined with technical knowledge. You are naturally analytical and enjoy digging into business models and helping customers quantify their investment decisions. You get excited about prospecting, and are capable of independently leading a sales cycle from start to finish. Finally, you enjoy building – you like to actively participate in the development of our sales process, the articulation of our value proposition, and the creation of key tools and assets.\nIf you’re motivated, smart, persistent, and a great teammate, we want to hear from you!\nMinimum requirements\n10+ years of sales experience, preferably selling a technical product, with a track record of top performance\nExtensive experience directly selling a technology product or service, preferably at an API-first company, with a record of top performance\nA proven track record of moving sales processes forward from inception to close by leading complex, multi-party sales in a highly consultative manner, understanding strategies and applying value proposition\nGreat listening skills and ability to quickly become a trusted resource for decision-makers across technology and finance orgs within software companies\nAn ability to understand complex technical problems and understand how Stripe’s solutions can address them\nA positive attitude and tireless work ethic when encountering blockers to success, whether external or internal\nStrong presentation skills\nProven ability to lead complex negotiations involving bespoke commercial agreements\nSuperior verbal and written communication skills\nAbility to operate in a highly ambiguous and fast-paced environment\nStrong interest in technology and a deep understanding of the space\nExperience in or excitement in learning about financial technology infrastructure\nFastidious approach to CRM hygiene and experience utilizing thorough sales forecasting metrics on a weekly/quarterly basis and communicating them in a succinct manner",
    "job_link": "https://stripe.com/jobs/listing/account-executive-platforms-existing-business/6395069",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:50:59.489111"
  },
  {
    "title": "Account Executive, Platforms, Hunter | New York, NY; Bay Area, CA",
    "location": "New York",
    "experience_required": null,
    "job_description": "Who we are\nAbout Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies—from the world’s largest enterprises to the most ambitious startups—use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone’s reach while doing the most important work of your career.\nAbout the team\nThe Platform Sales team works with B2B Software Platforms to help them facilitate payments for their customers using our Stripe Connect product. Software Platforms, also known as B2B Indirect, are software platform businesses who serve other businesses. Platforms already using Stripe include Shopify, Lightspeed and Mindbody.\nAs a key member to the Stripe Platforms team, you will manage and elevate relationships with a named account list while identifying new growth opportunities and ways Stripe can exceed expectations. This role will be dedicated to accounts tied to the East territory. Location requirements are listed below. \nIf you’re motivated, smart, persistent, and a great teammate, we want to hear from you!\nWhat you’ll do\nAs an Account Executive (New Business), you will create partnerships between Stripe and the most innovative and fastest-growing software platforms in the world by helping them to understand how Stripe’s online commerce infrastructure can make payments a competitive advantage for their businesses.\nResponsibilities\nDirectly manage and nurture a named account list and develop account plans for winning and expanding business with upper middle market and enterprise companies\nBuild and maintain key relationships with C-level executives, while orchestrating the right executive touch points as well\nContribute to shaping our platform partnership strategy and building repeatable processes and scaled engagement models\nDevelop outbound strategies to create and nurture opportunities\nOwn the full sales cycle from lead to close for upper middle market and enterprise companies\nDevelop relationships with executive stakeholders at new and existing clients\nWork with company leaders from multiple functions (e.g., Engineering, Product, and Finance) to lead complex product workshops and financial analyses\nLead and contribute to team projects to develop and refine our sales process\nEngage with Product and Engineering teams to help drive product strategy\nWho you are\nYou are an adept salesperson and relationship manager capable of engaging in business-level and technical conversations at multiple levels of the organization, including the CTO, COO, and CFO. You have experience working with upper middle market and enterprise companies. You have an in-depth understanding of the buyer journey and can lead a complex, multi-party sale in a highly consultative manner. You are used to building value in competitive situations and enjoy working on products that require deep product understanding, combined with technical knowledge. You are naturally analytical and enjoy digging into business models and helping customers quantify their investment decisions. You get excited about prospecting, and are capable of independently leading a sales cycle from start to finish. Finally, you enjoy building – you like to actively participate in the development of our sales process, the articulation of our value proposition, and the creation of key tools and assets.\nIf you’re motivated, smart, persistent, and a great teammate, we want to hear from you!\nMinimum requirements\nLocations that will be considered: New York, New York; South San Francisco; Bay Area\n10+ years of sales experience, preferably selling a technical product, with a track record of top performance\nExtensive experience directly selling a technology product or service, preferably at an API-first company, with a record of top performance\nA proven track record of moving sales processes forward from inception to close by leading complex, multi-party sales in a highly consultative manner, understanding strategies and applying value proposition\nGreat listening skills and ability to quickly become a trusted resource for decision-makers across technology and finance orgs within software companies\nAn ability to understand complex technical problems and understand how Stripe’s solutions can address them\nA positive attitude and tireless work ethic when encountering blockers to success, whether external or internal\nStrong presentation skills\nProven ability to lead complex negotiations involving bespoke commercial agreements\nSuperior verbal and written communication skills\nAbility to operate in a highly ambiguous and fast-paced environment\nStrong interest in technology and a deep understanding of the space\nExperience in or excitement in learning about financial technology infrastructure\nFastidious approach to CRM hygiene and experience utilizing thorough sales forecasting metrics on a weekly/quarterly basis and communicating them in a succinct manner\nPayments experience is preferred",
    "job_link": "https://stripe.com/jobs/listing/account-executive-platforms-hunter-new-york-ny-bay-area-ca/6989261",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:51:01.166549"
  },
  {
    "title": "Account Executive, Product Sales (Billing)",
    "location": "New York",
    "experience_required": null,
    "job_description": "Who we are\nAbout Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies - from the world’s largest enterprises to the most ambitious startups - use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone's reach while doing the most important work of your career.\nAbout the team\nProduct Sales is a team of deep functional and technical specialists who both lead and advise on deals for the most strategically important products in Stripe’s portfolio. Revenue and Finance Automation (RFA) Product Sales is tasked with attacking a $100B market opportunity for back office finance automation across billing, tax, revenue reporting, and data. \nWhat you’ll do\nAs a Billing Account Executive at Stripe, you will use your sales and product expertise to help drive growth through both existing and new to Stripe customers. You will collaborate with the core sales, marketing, product marketing, and product teams to develop deep product and industry knowledge and drive strategic deals. You will be instrumental in leading in depth product discussions with existing and prospective customers – and building and executing against our go to market strategy.\nResponsibilities\nDrive revenue to achieve and over perform on target and KPIs\nLead new sales and upsell conversations of Stripe for existing and prospective customers.\nDrive strategic thought leadership within assigned territory to ensure user success and revenue growth \nDeeply understand the sales process and competitors for Stripe, including software, hardware and payments.\nServe as both an internal and customer-facing expert on Stripe, especially for your specialized products.\nSynthesize and relay customer feedback and our findings to inform Stripe’s product roadmap.\nEngage with Product, Marketing and User Operations teams to help amplify our growth trajectory.\nWho you are\nYou are an adept salesperson, capable of engaging in business-level and technical conversations at multiple levels of the organization, including CEO, CFO, and CTO. You are used to building value in competitive situations and enjoy working on products that require deep product understanding, combined with technical knowledge. You’re as comfortable working with clients as with internal stakeholders (including executives). You’re excited to become an expert and to share your knowledge. You’re an organized self-starter, an excellent communicator who is highly analytical and has a track record for improving the processes and organizations around you.\nMinimum requirements\n10+ years of sales or prospecting experience at a technology company and a track record of top performance.\nOwning a direct sales quota, with direct sales experience closing new business and/or expansion of existing users.\nA proven ability to build strong collaborative working relationships with business partners. \nThe ability to deal effectively with ambiguity and thrive in an unstructured, fast-moving environment.\nA proven ability to be a self-starter capable of driving business results without significant supervision.\nAn enthusiastic “roll up your sleeves” mentality.\nExcellent verbal and written communication skills.\nStrong presentation skills, particularly for in-person meetings with multiple stakeholders. \nProven ability to lead complex negotiations involving bespoke commercial agreements. \nAbility to understand complex technical requirements and craft solutions across multiple stakeholders.\nExcellent verbal and written communication skills.\nPreferred qualifications\n3+ years of experience specifically selling financial services or similar software.  \nExperience in selling billing solutions. \nProven ability to sell in a fast paced environment.",
    "job_link": "https://stripe.com/jobs/listing/account-executive-product-sales-billing/6709022",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:51:02.649187"
  },
  {
    "title": "Account Executive, Product Sales, Adaptive Pricing (NYC)",
    "location": "New York",
    "experience_required": null,
    "job_description": "Who we are\nAbout Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies - from the world's largest enterprises to the most ambitious startups - use Stripe to accept payments, grow their revenue and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone's reach while doing the most important work of your career.\nAbout the team\nStripe is investing in building out its Global Product Sales team to actively engage and drive prospects and customers to help them optimize their local currency presentment and pricing through Stripe’s Adaptive Pricing product across the Americas.\nStripe's Global Product Sales team is at the forefront of driving revenue and growth. As trusted business partners and strategic salespeople, our goal is to help users understand Stripe products and integrate them with ease so they can concentrate on what's most important to them: their business. We are known for our product knowledge, sales expertise, rigorous thinking and user-first approach to problem solving. Within Stripe, Product Sales proudly serve as a critical source of user feedback and market intelligence, with direct influence on Stripe's product roadmap and growth strategy.\nWhat you'll do\nAdaptive Pricing empowers businesses to dynamically optimize their pricing and presentment online, leveraging data-driven insights to maximize revenue while maintaining competitive positioning in rapidly evolving global markets. As part of Stripe’s Optimised Checkout Suite, Adaptive Pricing is a key strategic driver within Stripe Payments to support our users with global selling. As an Account Executive for Adaptive Pricing, you will use your sales and deep product expertise to help drive growth in this space to users across North America. You will collaborate with product, engineering, legal, marketing and other GTM teams to develop deep product and industry knowledge and drive complex deals. You will be instrumental in leading in-depth product discussions with existing and prospective customers and building and executing against our go to market strategy.\nYou are an adept sales professional, capable of engaging in business-level and technical conversations at multiple levels of the organization. You are used to building value in competitive situations and enjoy working on products that require deep product understanding, combined with technical knowledge. You're as comfortable working with clients as with internal stakeholders. You're excited to become an expert and to share your knowledge. You're an organized self-starter, an excellent communicator who is analytical and has a track record for improving the processes and organizations around you.\nResponsibilities\nAccountable for driving revenue, increasing attach rates and new client acquisition of key users in the Americas, utilizing the MEDDIIC deal qualification and opportunity management\nDevelop relationships with executive stakeholders and lead discussions with existing and prospective customers\nDeep product and payments expertise to act as a subject matter expert for Adaptive Pricing, Payments and checkout optimization.\nDeeply understand the sales process and competitors for Stripe in this space and serve as both an internal and customer-facing expert in these product areas\nEngage with Product and Engineering teams to synthesize and relay customer feedback and our findings to inform Stripe's product roadmap\nContribute to the development of go-to-market playbooks alongside product, marketing, sales and technical services stakeholders\nWork collaboratively and cross-functionally across the organization to help shape Stripe's products and solutions to meet customer needs\nWho you are\nWe're looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. The preferred qualifications are a bonus, not a requirement.\nMinimum requirements\n* 6+ years of customer facing experience at a leading technology or payments company and a track record of top performance\nExperience building trusted advisor relationships with senior business leaders\nProven ability to build strong collaborative working relationships with cross-functional business partners\nSelf-starter capable of operating independently to drive meaningful business results\nEnthusiastic \"roll up your sleeves\" mentality\nExcellent verbal and written communication skills\nAbility to understand complex technical and product-led requirements and craft solutions across multiple stakeholders\nProven experience to lead complex negotiations involving bespoke commercial agreements\nThrives in a fast-paced environment and changing requirements\nTrue team player - always\nHumor is very welcomed!",
    "job_link": "https://stripe.com/jobs/listing/account-executive-product-sales-adaptive-pricing-nyc/7225447",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:51:04.214442"
  },
  {
    "title": "Account Executive, Product Sales, Link",
    "location": "New York",
    "experience_required": null,
    "job_description": "Who we are\nAbout Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies - from the world’s largest enterprises to the most ambitious startups - use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone's reach while doing the most important work of your career.\nAbout the team\nProduct Sales is a team of deep functional and technical specialists who both lead and advise on deals for the most strategically important products in Stripe’s portfolio. Stripe is investing in building out its Link Product Sales team and as an Account Executive  you will be a critical part of the team driving the growth of the Link network. Few roles provide such a direct impact on the growth of a top company priority.\nWhat you’ll do\nAs an Account Executive, Link, you will use your sales and product expertise to help drive growth of Link’s consumer network across a range of customers. You will collaborate with product, engineering, marketing, and other GTM teams to develop deep product and industry knowledge and drive complex deals. You will be instrumental in leading in depth product discussions with existing and prospective customers – and building and executing against our go to market strategy.\nYou are an adept sales professional, capable of engaging in business-level and technical conversations at multiple levels of the organization. You are used to building value in competitive situations and enjoy working on products that require deep product understanding, combined with technical knowledge. You’re as comfortable working with clients as with internal stakeholders. You’re excited to become an expert and to share your knowledge. You are an organized self-starter and an exceptional communicator with strong analytical abilities and a proven history of top performance and improving the teams you join. \nResponsibilities\nAccountable for driving revenue, increasing attach rates, and new client acquisition for a wide range of customers including Enterprises and Platforms\nCreate your strategic territory plan and lead outreach efforts to develop a robust, qualified pipeline\nDevelop relationships with executive stakeholders and lead discussions with existing and prospective customers\nDeeply understand Link and competitors, serving as both an internal and customer-facing expert on our product and the market \nEngage with Product and Engineering teams to synthesize and relay customer feedback to inform Stripe’s product roadmap\nContribute to the development of go-to-market playbooks alongside product, marketing, sales, and technical services stakeholders\nWork collaboratively and cross-functionally across the organization to help shape Stripe’s products and solutions to meet customer needs\nWho you are\nWe’re looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. The preferred qualifications are a bonus, not a requirement.\nRequirements\n10+ years of customer facing experience at a leading technology or payments company and a track record of top performance\nExperience building trusted advisor relationships with senior business leaders\nProven ability to build strong collaborative working relationships with cross-functional business partners\nSelf-starter capable of operating independently to drive meaningful business results\nEnthusiastic “roll up your sleeves” mentality\nExcellent verbal and written communication skills\nAbility to understand complex technical requirements and craft solutions across multiple stakeholders\nProven experience to lead complex negotiations involving bespoke commercial agreements\nThrives in a fast-paced environment and changing requirements\nTrue team player - always\nHumor is very welcomed\nPreferred Qualifications\n5+ years of experience specifically selling payments or technology solutions to enterprise customers",
    "job_link": "https://stripe.com/jobs/listing/account-executive-product-sales-link/7155893",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:51:05.278642"
  },
  {
    "title": "Account Executive, Product Sales, Radar (NYC)",
    "location": "Chicago",
    "experience_required": null,
    "job_description": "Who we are\nAbout Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies - from the world’s largest enterprises to the most ambitious startups - use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone's reach while doing the most important work of your career.\nAbout the team\nProduct Sales is a team of deep functional and technical specialists who both lead and advise on deals for the most strategically important products in Stripe’s portfolio. Stripe is investing in building out its Radar Product Sales team and as an Account Executive you will be a critical part of the team driving the growth of this product.\nWhat you’ll do\nAs an Account Executive, Product focusing on Stripe Radar, you will use your sales and product expertise to help drive product market fit & growth of Stripe’s fraud fighting products and solutions. You will collaborate with product, engineering and marketing teams to develop deep product and industry knowledge and drive strategic deals. You will be instrumental in leading in depth product discussions with existing and prospect users globally – and building and executing against our go to market strategy.\nYou are an adept salesperson, capable of engaging in business-level and technical conversations at multiple levels of the organization, including CEOs, CTOs, and Chief Risk Officers. You are used to building value in competitive situations and enjoy working on products that require deep product understanding. You’re as comfortable working with clients as with internal stakeholders (including executives). You’re excited to become an expert and to share your knowledge. You’re an organized self-starter, an excellent communicator who is highly analytical and has a track record for improving the processes and organizations around you.\nResponsibilities\nDrive new business and revenue growth by selling Radar to a variety of businesses \nLead complex new and expansion deals related to Stripe’s Radar product offerings, capabilities, and tailored solutions\nDeeply understand the sales process and what competitors offer in terms of fraud fighting capabilities, with a strong emphasis to overcoming competition to win all deals\nSynthesize and relay customer feedback and findings to inform Stripe’s product roadmap\nEngage with Product, Marketing and Account teams to help amplify our growth trajectory globally\nWho you are\nWe’re looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. The preferred qualifications are a bonus, not a requirement.\nRequirements\n10+ years of customer facing experience at a leading technology or payments company and a track record of top performance, working specifically on enterprise or strategic accounts\nDisplay a deep passion for fraud prevention and develop deep expertise \nA proven ability to build strong collaborative working relationships with business partners internally and externally\nThe ability to deal effectively with ambiguity and thrive in an unstructured, fast-moving environment\nExperience building trusted advisor relationships with senior business leaders\nSelf-starter capable of operating independently to drive meaningful business results\nAbility to understand complex technical requirements and craft solutions across multiple stakeholders\nProven experience to lead complex negotiations involving bespoke commercial agreements\nPreferred Qualifications\n5+ years of experience specifically selling fraud solutions for payments to enterprise customers",
    "job_link": "https://stripe.com/jobs/listing/account-executive-product-sales-radar-nyc/7215691",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:51:06.719176"
  },
  {
    "title": "Account Executive, Product Sales, Terminal",
    "location": "New York",
    "experience_required": null,
    "job_description": "Who we are\nStripe is a financial infrastructure platform for businesses. Millions of companies—from the world’s largest enterprises to the most ambitious startups—use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone’s reach while doing the most important work of your career.\nAbout the team\nProduct Sales is a team of deep functional and technical specialists who both lead and advise on deals for the most strategically important products in Stripe’s portfolio.  The Terminal Product Sales is tasked with attacking a $15T market opportunity for Unified online and offline commerce. The team is lean, high visibility and highly cross-functional!\nWhat you’ll do\nAs an Account Executive, Product (Terminal) at Stripe, you will use your sales and product expertise to help drive growth of Stripe’s Unified Commerce suite of hardware, software and payments solutions. You will collaborate with product, engineering and marketing teams to develop deep product and industry knowledge and drive strategic deals. You will be instrumental in leading in depth product discussions with existing and prospective customers – and building and executing against our go to market strategy.\nYou are an adept salesperson, capable of engaging in business-level and technical conversations at multiple levels of the organization, including CEO and CTO. You are used to building value in competitive situations and enjoy working on products that require deep product understanding, combined with technical knowledge. You’re as comfortable working with clients as with internal stakeholders (including executives). You’re excited to become an expert and to share your knowledge. You’re an organized self-starter, an excellent communicator who is highly analytical and has a track record for improving the processes and organizations around you.\nResponsibilities\nDrive new business growth by identifying, prospecting, and closing new Stripe Terminal customers.\nOwn the full sales cycle from lead generation to close, with a strong focus on expanding Stripe Terminal’s footprint.\nLead strategic sales conversations with prospective customers, positioning Stripe Terminal’s software, hardware, and payments as the best solution.\nDevelop and execute go-to-market strategies to outperform competitors and accelerate adoption.\nManage and expand relationships with existing customers, driving upsells and incremental revenue growth.\nAct as a trusted advisor and Terminal expert, both internally and externally, to drive customer success and influence product direction.\nCollaborate with Product, Marketing, and User Operations teams to refine our approach and fuel Terminal’s growth.\nWho you are\nWe’re looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. The preferred qualifications are a bonus, not a requirement.\nMinimum requirements\n7+ years of sales or prospecting experience at a technology company and a track record of top performance\nA proven ability to build strong collaborative working relationships with business partners. \nThe ability to deal effectively with ambiguity and thrive in an unstructured, fast-moving environment.\nA proven ability to be a self-starter capable of driving business results without significant supervision.\nAn enthusiastic “roll up your sleeves” mentality.\nExcellent verbal and written communication skills.\nStrong presentation skills, particularly for in-person meetings with multiple stakeholders\nProven ability to lead complex negotiations involving bespoke commercial agreements\nAbility to understand complex technical requirements and craft solutions across multiple stakeholders\nPreferred qualifications\n* 3+ years of experience specifically selling online and offline payments to large merchants or software platforms who embed it into their product suite\nProven ability to sell complex solutions involving both hardware and software",
    "job_link": "https://stripe.com/jobs/listing/account-executive-product-sales-terminal/7230030",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:51:08.149887"
  },
  {
    "title": "Account Executive, SMB (Existing Business)",
    "location": "Chicago",
    "experience_required": null,
    "job_description": "Who we are\nAbout Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies—from the world’s largest enterprises to the most ambitious startups—use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone’s reach while doing the most important work of your career.\nAbout the Team\nThe Account Executive, Existing Business team is a highly consultative sales team that is responsible for the growth and retention of Stripe’s largest and fastest growing Startups SMB customers. As an Account Executive, Existing Business team member, you’ll identify new opportunities for our clients to get the most out of Stripe by quickly understanding our clients’ needs, execute scaled sales strategies to close upsell and renewals with existing Stripe customers, and drive end-to-end campaigns to increase adoption of Stripe’s offerings.\nWhat you’ll do\nResponsibilities\nOwn contract renewals and lead commercial negotiations to increase and retain existing customer revenue and Stripe market share\nDevelop and implement full sales cycle strategies for driving product adoption, net new product sales, and client retention at scale among existing Stripe customers\nSolve complex client needs and work across product, sales, risk, and operations teams to improve our product\nOwn the full sales cycle from lead to close for startups and small/medium businesses\nGenerate your own leads through cold calling, blitzing, research, networking, and driving your territory\nMake every potential Stripe user happy with every interaction, regardless of deal size\nIdentify and understand users’ pain points to propose Stripe solutions\nEnsure internal teams are set up for users’ success by coordinating with other Stripe teams\nWho you are\nWe’re looking for a well-rounded strategic seller who can build strong relationships with Stripe’s clients and manage high-velocity deal cycles. If you’re hungry, smart, persistent, and a great teammate, we want to hear from you!\nMinimum requirements\n2+ years of experience in a client-facing or sales role\nAbility to understand complex technical ecosystems and build great relationships with technical customers\nAbility to drive and close upsell opportunities for additional Stripe products in long-term, consultative engagements\nAnalytical ability to manage complex pricing and cost considerations\nExperience managing projects with input from cross-functional teams\nA knack for working well with a wide range of stakeholders, both internally and externally\nAbility and motivation to operate in a highly ambiguous and fast-paced environment\nSuperior verbal and written communication skills\nPreferred qualifications\nPrior experience in a sales or customer-facing role at a high-growth technology company\nExperience with Excel and SQL, or a willingness to learn",
    "job_link": "https://stripe.com/jobs/listing/account-executive-smb-existing-business/7140921",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:51:09.490085"
  },
  {
    "title": "Account Executive, SMB (New Business)",
    "location": "Chicago",
    "experience_required": null,
    "job_description": "Who we are\nAbout Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies—from the world’s largest enterprises to the most ambitious startups—use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone’s reach while doing the most important work of your career.\nAbout the team\nThe Startup and SMB Account Executive team is a highly consultative sales team that is responsible for the acquisition and growth of Stripe’s largest and most promising Startup and SMB customers. As an Account Executive, you’ll identify new opportunities for prospects to get the most out of Stripe by quickly understanding our clients’ needs, execute scaled sales strategies to acquire new customers and drive product adoption.\nWhat you’ll do\nResponsibilities\nIdentify high-potential prospective users from inbound leads and outbound prospecting\nOwn the full sales cycle from lead to close for SMBs and Platforms\nDevelop and implement full sales cycle strategies for driving new logo and product adoption\nSolve complex client needs and work across product, sales, risk, and operations teams to improve our platform\nGenerate your own leads through cold calling, blitzing, research, networking, and driving your territory\nMake every potential Stripe user happy with every interaction, regardless of deal size\nIdentify and understand users’ pain points to propose Stripe solutions\nSet up users for success by coordinating internally with other Stripe teams\nWho you are\nWe’re looking for a well-rounded strategic seller who can build strong relationships with Stripe’s clients and manage high-velocity deal cycles. If you’re smart, persistent, and a great teammate, we want to hear from you!\nMinimum requirements\n2+ years of sales or prospecting experience, preferably at a technology company, with a track record of top performance\nAbility to understand complex technical ecosystems and build great relationships with technical customers\nAnalytical ability to manage complex sales cycles\nExperience managing projects with input from cross-functional teams\nA knack for working well with a wide range of stakeholders, both internally and externally\nAbility and motivation to operate in a highly ambiguous and fast-paced environment\nSuperior verbal and written communication skills\nProven ability to meet or exceed sales targets",
    "job_link": "https://stripe.com/jobs/listing/account-executive-smb-new-business/6735940",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:51:11.051602"
  },
  {
    "title": "Account Executive, SSMB",
    "location": "Dublin HQ",
    "experience_required": null,
    "job_description": "Who we are\nAbout Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies—from the world’s largest enterprises to the most ambitious startups—use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone’s reach while doing the most important work of your career.\nAbout the team\nThe Startup and SMB team is a highly consultative sales team that is responsible for the growth of Stripe’s startup and SMB customers within the region. We work with the most ambitious and fastest growing companies - Stripe’s payments and financial infrastructure unlocks new revenue streams and growth opportunities for their businesses.\nWhat you’ll do\nAs an Account Executive, you’ll own the full sales cycle, from prospecting and closing to managing existing relationships and identifying new opportunities to expand Stripe’s footprint within existing accounts. Specifically, we’re looking for someone who can execute on sales strategies, engage with internal and external stakeholders, align on technical and business requirements with product teams, build value in competitive situations, lead commercial negotiations, and close deals.\nResponsibilities\nWork with existing Startup and SMB Stripe customers to develop and execute long-term sales strategies to expand Stripe’s revenue\nOwn the full sales cycle, from business case development, deal structuring and negotiating, to close and activation\nOwn a named account list and develop account plans for winning and expanding business with high growth technology companies\nDevelop outbound strategies to create and nurture opportunities\nDrive deal strategy and commercial negotiations for large, complex renewals\nDevelop relationships with executive stakeholders within your book of business\nBe responsible for account mapping and coordinating effective meetings with the appropriate external stakeholders expanding the customer relationship\nLead and contribute to team projects to develop and refine our sales process and help shape the Stripe sales culture\nWho you are\nWe’re looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. The preferred qualifications are a bonus, not a requirement.\nMinimum requirements\n4+ years of sales experience, preferably selling a highly technical product, with a track record of top performance\nAbility to understand technical requirements and craft solutions across multiple products\nAbility to develop and execute account plans spanning multiple business units across complex organizations\nA knack for working well with a wide range of people, both internally and externally\nStrong presentation skills, particularly for in-person meetings with multiple stakeholders\nProven ability to lead complex negotiations involving bespoke commercial agreements\nSuperior verbal and written communication skills in English \nAbility to operate in a highly ambiguous and fast-paced environment\nStrong interest in technology and a deep understanding of the space",
    "job_link": "https://stripe.com/jobs/listing/account-executive-ssmb/7140002",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:51:12.688588"
  },
  {
    "title": "Accounting Analyst",
    "location": "Bengaluru",
    "experience_required": null,
    "job_description": "Stripe’s mission is to increase the GDP of the internet. We build the most powerful and flexible tools for running an internet business. We handle billions of dollars each year and enable millions of users around the world to scale faster and more efficiently by building their businesses on Stripe.\nTo further this important mission, we are building our International Accounting Stripe Delivery Center team and are looking for someone to help us scale for the future in a fast paced environment.\nYou Will\nPerform month end accounting processes to support rapid global growth\nWork in three main pillars financial close and analysis, audit and regulatory compliance and reporting\nOwn the Statutory Financial Statement preparation, Audit, review and sign off and adoption of financial statements with the board of directors. \nWork with Local service providers to ensure compliance and filing requirements are met timely and accurately. \nWork with cross functional partners like Tax, Treasury, Accounting and other groups to ensure that financial results of the legal entities remain compliant with US Gaap and Local Gaaps. \nPerform monthly and quarterly close activities, including manual journal entries, balance sheet reconciliations, variance analyses and analytical reviews, producing internal management reporting and external audit support\nPotential to perform month end activities and grow into other task and process to take on further responsibilities\nBe responsible for end to end preparation of journal entries and balance sheet reconciliations\nPrepare flux analysis and potential commentary and explanation on movements and trends\nBe responsible for performing transactional based work and streamlining processes\nBe a self starter and seek to standardize and centralize tasks \nOwn problems not just processes or projects - we want our specialists to own the full problem space and do what it takes to solve them\nPartner with multiple cross-functional stakeholders and subject matter experts to develop and improve controllership processes and to anticipate changing business requirements\nScale our financial processes through automation and standardization \nWe Are Looking For Someone Who Has\nAn accountancy qualification (e.g CA, ACA, ACCA, CIMA) with 8+ years of relevant accounting experience\nDegree in Accounting or Finance background\nProven experience in the monthly close process, journal preparation and posting, audit, and exposure to accounting systems.\nExperience in month end reporting and analytics\nWorking knowledge of US GAAP \nThe ability to bring structure to ambiguous areas of opportunity and thrive in an unstructured, fast-moving environment\nStrong analytical skills and strong knowledge of Excel.\nKnowledge of data modeling or experience in any analytics tool will be an added advantage.\nAn enthusiastic “roll up your sleeves” mentality\nA passion for creating new systems and solving problems via infrastructure and automation\nDemonstrated ability to work cross-functionally and with different cultures\nDemonstrated experience with internal controls\nAbility to be flexible and comfortable with changing requirements\nNice to haves\nKnowledge of (or experience in) the technology or payments industry\nOracle suite\nHubble/SQL",
    "job_link": "https://stripe.com/jobs/listing/accounting-analyst/6209187",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:51:14.214106"
  },
  {
    "title": "Accounting Analyst - Product Accounting - Processing Cost",
    "location": "Bengaluru",
    "experience_required": null,
    "job_description": "Accounting Analyst - Product Accounting - Processing Cost\nWho we are\nAbout Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies—from the world’s largest enterprises to the most ambitious startups—use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone’s reach while doing the most important work of your career.\nAbout the team\nThe Stripe Product Accounting Team is responsible for supporting all products at Stripe, consulting on accounting implications and supporting teams' ability to make informed strategic decisions. We are responsible for the accurate and timely recording of all business-generated transactions on our balance sheet and income statement. We operate in a fast-paced environment and collaborate significantly with cross-functional and international teams. \nWhat you’ll do\nStripe is seeking an experienced accountant to join its world class Accounting team and help us scale for the future, in a fast-paced environment that is growing rapidly. In this role you will support our Payments and Payment Products revenue accounting, leveraging your technical expertise with US GAAP, specifically ASC 606, to quickly identify accounting implications and impacts to customers while advising and collaborating with team members cross-functionally to develop operational processes that help us scale.\n Responsibilities\nBuild scalable accounting processes to support global growth in payment processing accounting\nPartner closely with our product, go-to-market, and finance partners to thoroughly understand new products, features, and contracts.\nPartner with internal systems and engineering teams to support internal financial systems and automation of accounting processes\nAssess the effectiveness of internal controls, and design new processes and controls for emerging and growing business activities\nDevelop and maintain up-to-date accounting procedural documentation\nPlan and perform monthly and quarterly close activities, including journal entries, balance sheet reconciliations, variance analyses, financial reporting deliverables, and analytical reviews\nProduce internal management analyses and reporting\nSupport external audit processes\nWho you are\nWe're looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. The preferred qualifications are a bonus, not a requirement.\nMinimum requirements\nAn accountancy qualification (e.g CA, CPA, ACA, ACCA, CIMA) with 3 -6 years of relevant accounting experience\nDegree in Accounting or Finance background\nProven experience in the monthly close process, journal preparation and posting, audit, regulatory reporting and exposure to accounting systems.\nExperience in month end reporting and financial statement preparation\nWorking knowledge of US GAAP - ASC 606 \nThe ability to bring structure to ambiguous areas of opportunity and thrive in an unstructured, fast-moving environment\nStrong analytical skills and strong knowledge of Excel\nAn enthusiastic “roll up your sleeves” mentality\nA passion for creating new systems and solving problems via infrastructure and automation\nDemonstrated ability to work cross-functionally and with different cultures\nDemonstrated experience with internal controls\nAbility to be flexible and comfortable with changing requirements\nPreferred qualifications\nCPA/ CA or similar qualification\n4 + years of experience in accounting background\nKnowledge of (or experience in) the technology or payments industry.\nExperience working with Oracle Suite\nExperience with Hubble and SQL\n^\nExperience with Analytical Tools like- Power BI, Tableau, KNIME, Python, Alteryx",
    "job_link": "https://stripe.com/jobs/listing/accounting-analyst-product-accounting-processing-cost/7135264",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:51:15.519207"
  },
  {
    "title": "Accounting Analyst - Revenue",
    "location": "Bengaluru",
    "experience_required": null,
    "job_description": "Who we are\nAbout Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies—from the world’s largest enterprises to the most ambitious startups—use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone’s reach while doing the most important work of your career.\nAbout the team\nThe Stripe Product Accounting Team is responsible for supporting all products at Stripe, consulting on accounting implications and supporting teams' ability to make informed strategic decisions. We are responsible for the accurate and timely recording of all business-generated transactions on our balance sheet and income statement. We operate in a fast-paced environment and collaborate significantly with cross-functional and international teams. \nWhat you’ll do\nStripe is seeking an experienced accountant to join its world class Accounting team and help us scale for the future, in a fast-paced environment that is growing rapidly. In this role you will support our Payments and Payment Products revenue accounting, leveraging your technical expertise with US GAAP, specifically ASC 606, to quickly identify accounting implications and impacts to customers while advising and collaborating with team members cross-functionally to develop operational processes that help us scale.\n Responsibilities\nBuild scalable accounting processes to support global growth in payment processing accounting\nPartner closely with our product, go-to-market, and finance partners to thoroughly understand new products, features, and contracts.\nPartner with internal systems and engineering teams to support internal financial systems and automation of accounting processes\nAssess the effectiveness of internal controls, and design new processes and controls for emerging and growing business activities\nDevelop and maintain up-to-date accounting procedural documentation\nPlan and perform monthly and quarterly close activities, including journal entries, balance sheet reconciliations, variance analyses, financial reporting deliverables, and analytical reviews\nProduce internal management analyses and reporting\nSupport external audit processes\nWho you are\nWe're looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. The preferred qualifications are a bonus, not a requirement.\nMinimum requirements\nAn accountancy qualification (e.g CA, CPA, ACA, ACCA, CIMA) with 3 -6 years of relevant accounting experience\nDegree in Accounting or Finance background\nProven experience in the monthly close process, journal preparation and posting, audit, regulatory reporting and exposure to accounting systems.\nExperience in month end reporting and financial statement preparation\nWorking knowledge of US GAAP - ASC 606, ASC326 & ASC450\nThe ability to bring structure to ambiguous areas of opportunity and thrive in an unstructured, fast-moving environment\nStrong analytical skills and strong knowledge of Excel\nAn enthusiastic “roll up your sleeves” mentality\nA passion for creating new systems and solving problems via infrastructure and automation\nDemonstrated ability to work cross-functionally and with different cultures\nDemonstrated experience with internal controls\nAbility to be flexible and comfortable with changing requirements\nPreferred qualifications\nCPA/ CA or similar qualification\nKnowledge of (or experience in) the technology or payments industry.\nExperience working with Oracle Suite\nExperience with Hubble and SQL\nExperience with Analytical Tools like- Power BI, Tableau, KNIME, Python, Alteryx",
    "job_link": "https://stripe.com/jobs/listing/accounting-analyst-revenue/7089532",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:51:17.146370"
  },
  {
    "title": "Accounting Technologist, Business Systems Program Manager",
    "location": "Seattle",
    "experience_required": null,
    "job_description": "Who we are\nAbout Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies—from the world’s largest enterprises to the most ambitious startups—use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone’s reach while doing the most important work of your career.\nAbout the team\nThe Product & Systems Integration (PSI) Accounting team is made up of accounting technologists at large across Stripe who bring Accounting to the table as a partner to Product and Engineering teams in the design, planning, and implementation of their roadmaps in line with the highest standards of compliant global financial reporting. The PSI Accounting team operates through a structured, consistent, observable, and repeatable model for roadmap launches across scoping, requirements definition, systems set up, testing, issue resolution, and sign off.\nWhat you’ll do\n Responsibilities\nAct as the lead Accounting partner to our Product and Systems teams to ensure all accounting requirements are identified, planned for and implemented for Stripe’s product launches\nPartner with all Accounting teams to manage the end-to-end definition and execution of Accounting requirements for product launches and keeping all stakeholders abreast of the progress \nSupport the integration of the product roadmap and setup of financial systems through the entire product/feature introduction lifecycle: feasibility through scoping, requirements definition through specification, testing, launch, and change management in transitioning to new processes\nOwn an extensive portfolio of new product launches ensuring that Accounting requirements are met while enabling our Product teams to move fast \nSynthesize product launch strategies and quickly identify impact and requirements \nBuild and maintain relationships across Product, Finance, and Systems teams to increase collaboration and productivity\nEffectively communicate and function to identify where resources or appropriate management attention/support is needed\nCommunicate the overall portfolio health through periodic status updates \nBuild processes and methodology to create predictable and repeatable launch mechanisms, ensure that best practices are identified, implemented, shared and followed, and identify metrics that help us drive action to control financial and operational risks related to new launches\nWho you are\nWe're looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. The preferred qualifications are a bonus, not a requirement.\nMinimum requirements\n7+ years of relevant relevant Finance experience with proven track record of leading large complex, cross-functional projects \nDemonstrated experience communicating financial concepts and processes in writing to cross-functional audiences\nExperience of system and process design\nStrong interpersonal, written and oral communication skills\nDesire to exceed expectations and drive positive change in the organization\nWorking understanding of an internal control framework and a solid understanding of the concepts of control design and operational efficiency\nStrong skills in Google Office Suite and Jira \nAbility to manage multiple projects at once, follow through, and meet deadlines\nAbility to demonstrate sound judgment and deliver results even in ambiguous situations\nAbility to thrive and adapt in fast-paced, changing environments \nAbility to work and think independently while being able to contribute successfully to cross-functional teams\nPreferred qualifications \nCPA or similar qualification\nExperience using SQL to self-service information\nStrong skills in Google Office Suite and Jira\nTech industry experience\nPrevious experience as an Accountant in a high-growth environment\nExperience with translating accounting conclusions into operational processes\nA demonstrated history of solving multiple and complex operation and accounting challenges",
    "job_link": "https://stripe.com/jobs/listing/accounting-technologist-business-systems-program-manager/7161275",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:51:18.496584"
  },
  {
    "title": "Accounts Receivable Manager",
    "location": "Bengaluru",
    "experience_required": null,
    "job_description": "Accounts Receivable (AR) Manager: Job Description\nAbout Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies—from the world’s largest enterprises to the most ambitious startups—use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone’s reach while doing the most important work of your career.\nAbout the team\nOur Finance teams don’t just provide and process data, but own strategy, use technology to drive solutions, influence their business partners and create company value. The Billing and Collections team operates in a fast-paced environment and collaborates significantly with cross-functional and international teams.\nWhat you’ll do\nIn this leadership role, will be responsible for supporting the entire billing and collections process, ensuring accurate and timely invoicing, managing outstanding receivables, implementing strategies to optimize cash flow, and resolving complex billing disputes, while collaborating with sales, customer success, and finance teams to maintain positive customer relationships and financial health within the company.\nResponsibilities\nBuild, develop and lead a team to support global billing and collections deliverables.\nParticipate in building scalable processes to support global growth.\nExecute efficient internal control documentation and sign-off procedures\nEnhance and maintain existing policies and procedural documentation\nDrive end to end improvement of input processes to enable scale and productivity\nDevelop, manage and improve process metrics utilizing automation, lean practices and process optimization to scale\nEscalate collection issues to relevant stakeholders when necessary\nNurture deep, trusted partnerships with leaders across Stripe showcasing the value of the Billing and Collections function and how it aligns with broader business goals\nCreate global best practice documentation and facilitate sharing across the globe.\nCreate a culture consistent with Stripe Operating and Leadership principles and an inspiring work environment that brings the best out of people at work.\nProvide robust feedback on process health and performance, identifying and remediating errors and delivering scale over time\nPartner with global process owners and functional leaders to demonstrate impeccable performance across multiple workflows and set a high bar for consistent improvement over time\nLead cross functional projects and reporting that drive performance improvement, visibility and automation throughout financial services.\nDrive strong operational delivery and process improvement helping to mitigate risk while balancing operational efficiency and user impact\nIdentify gaps in current systems, policies and strategies, and recommend enhancements and process improvements to mitigate risks\nWe are looking for:\nDemonstrated knowledge of key business financial metrics, providing metrics inputs to various reporting venues, and communicating key performance indicators to stakeholders in support of business objectives\nAdvanced finance operations experience of leading large operational processes\nAbility to set goals, financial plans and effectively influence leaders across Stripe\nWho you are\nWe’re looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. The preferred qualifications are a bonus, not a requirement.\nMinimum requirements\n15+ years of experience out of which 3+ years of managing operational teams dealing with high volume and complex workflows.\nLed teams in multi-location and exposure to working in multicultural, location and dynamic business environment\nA. or B.S degree in Accounting or Finance with fluency in the U.S. GAAP\nExcellent communication and organizational skills, both written and verbal.\nExcellent problem-solving skills and demonstrated ability to work independently, analyze problems and data sets to make complex investigation decisions\nStrong knowledge of gSuite tools, Salesforce and MS-Office products and experience working with/analyzing contracts and large data sets.\nIndependently analyze and evaluate information from various data sources to determine a course of action for a matched case\nDemonstrated experience partnering with cross-functional stakeholders\nDemonstrated history of taking on various types of challenging projects and producing results\nSolution-oriented mindset with enthusiasm for establishing best practices\nSelf-disciplined, diligent, proactive and detail oriented\nExperience working cross-functionally with multiple teams to deliver high impact initiatives\nExperience in delivering weekly and monthly business metrics and reporting\n   Preferred qualifications\nGood understanding of finance processes including AR and SOX controls.\nStrong operational background including experience with new process launch and service delivery in a high growth technology company\nExperience with written and verbal communications for both technical and non-technical audiences at the senior leadership level\nProficient in obtaining, organizing, and analyzing data to challenge conventional wisdom, make fact-based decisions, and drive root cause analysis, and evaluate outcomes",
    "job_link": "https://stripe.com/jobs/listing/accounts-receivable-manager/7118945",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:51:20.270864"
  },
  {
    "title": "Administrative Business Partner",
    "location": "New York",
    "experience_required": null,
    "job_description": "Who we are\nAbout Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies—from the world’s largest enterprises to the most ambitious startups—use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone’s reach while doing the most important work of your career.\nAbout the team\nThe administrative business partner team works with Stripe’s Executive leaders to strategically manage their day-to-day administrative and operational needs, while also contributing significantly to projects and initiatives that help drive the company’s strategic priorities.\nWhat you’ll do\nIn this role, you will be a critical part of supporting our business function by offering administrative support to one leader. This role will be based out of either or Chicago or NYC office.\nResponsibilities\nProvide highly integrated support for your Executive and help to optimize their teams and direct reports\nStrategically calendar and make recommendations for your Executive with regard to their time management, prioritization, delegation, and organization\nManage your Executive’s email, including responding on your Executive’s behalf\nServe as a conduit between your Executive, the larger team and cross-functionally throughout the organization. Increase alignment and speed of execution by providing feedback and insights to both sides\nTrack, manage and complete critical aspects of deliverables with a hands-on approach in order to facilitate the Executives ability to focus on top priorities\nContribute to team meetings and offsites by assisting with the production of materials and pre-reads, taking notes, and tracking action items\nPartner with your Executive to track key project milestones as well as progress against personal, team, and company goals/targets. Jump in to project manage as needed\nIdentify opportunities for process optimization throughout team and company processes.  Establish new—and improve existing—administrative systems and processes\nOwn and manage ad hoc projects, events and travel arrangements as needed\nWho you are\nWe’re looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. \nMinimum requirements\n7+ years of administrative experience and/or operational experience at a quickly-scaling or large company\nYou interact easily with all levels of staff from CEOs to investors in a fast-paced, changing environment while remaining flexible, proactive, resourceful, and efficient\nYou are incredibly organized, with superb attention to detail and a strong ability to execute\nYou are excellent with time management, and organizational skills, handling everything with a high-level of professionalism and confidentiality. You are able to quickly shift tasks and priorities as needed\nYou communicate, perform, and react well under pressure or ambiguity\nYou have strong project management experience with a track record of driving things to completion\nYou enjoy optimizing processes to make them more efficient\nYou are adept at handling sensitive information and situations with care and confidence\nYou have emotional intelligence and an ability to establish strong and trusting relationships\nYou are able to anticipate and respond to the needs of others before they arise\nYou would describe yourself as meticulous, patient, hardworking, reliable, tenacious, and a self-starter\nYou have an extreme growth mindset, driven by intense curiosity\nYou are accessible to work outside of regular business hours\nExperience in a high-growth technology startup is a plus",
    "job_link": "https://stripe.com/jobs/listing/administrative-business-partner/7008682",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:51:21.566995"
  },
  {
    "title": "Administrative Coordinator",
    "location": "Mexico City",
    "experience_required": null,
    "job_description": "Who we are\nAbout Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies—from the world’s largest enterprises to the most ambitious startups—use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone’s reach while doing the most important work of your career.\nAbout the team\nThe administrative team works with Stripe’s leaders to support their day-to-day administrative and operational needs.\nWhat you’ll do\nIn this role, you will be a critical part of supporting our business function.\nResponsibilities\nProvide complex and proactive calendar support for multiple leaders\nMake recommendations for your leaders with regard to their time management, prioritization, delegation, and organization\nCoordinate domestic and international travel and manage all related details  \nPrepare and submit expense reports on behalf of your leaders\nWho you are\nWe’re looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. The preferred qualifications are a bonus, not a requirement.\nMinimum requirements\n1+ years of administrative experience at a quickly-scaling or large company\nYou are incredibly organized, with superb attention to detail and a strong ability to execute\nYou are excellent with time management and able to quickly shift tasks and priorities as needed\nYou have a knack for working across various roles and teams in a fast-paced, changing environment while remaining flexible, proactive, resourceful, and efficient\nYou communicate, perform, and react well under pressure or ambiguity\nYou are adept at handling sensitive information and situations with care and confidence\nYou are able to anticipate and respond to the needs of others before they arise\nPreferred qualifications\nYou have experience in a high-growth technology startup\nExperience with Google Suite\nExperience supporting multiple complex calendars\nExperience booking and managing both domestic and international travel arrangements\nExperience with expense reporting",
    "job_link": "https://stripe.com/jobs/listing/administrative-coordinator/6334756",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:51:22.858832"
  },
  {
    "title": "Advertising Operations Associate",
    "location": "Bengaluru",
    "experience_required": null,
    "job_description": "Who we are\nAbout Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies—from the world’s largest enterprises to the most ambitious startups—use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone’s reach while doing the most important work of your career.\nStripe is growing quickly and along with that, so are its operational requirements. Stripe Delivery Centers (SDC) are a brand new initiative to accelerate and expand Stripe’s operational capabilities via the creation of centralized hubs or centers of operational excellence. SDC will be staffed with Stripes, not vendors - we want Stripes at SDC to have the same level of tools and systems access as Stripes in other locations.\nAbout the team\nStripe is investing in building out its Ad Operations team to scale our paid programs and effectively reach users across the globe through our paid channels.  \nThe Performance Marketing Ad Operations team is dedicated to optimizing current operations and ensuring that our performance engine runs efficiently. This includes campaign builds, ad builds, reporting, data uploads, scaling localization efforts, and conducting competitive analyses. With high ambitions for growing our paid channels (Facebook, LinkedIn, Google, Bing, etc.), we seek individuals who can operate within a global team, helping Stripe unlock efficiencies in our paid media operations.\nThe Ad Operations team will focus on delivering high-quality paid campaigns that support the performance marketing team’s goal of achieving strong business results. The team will manage ongoing tasks to keep our channels operating at optimal performance. We emphasize urgency and focus, ensuring timely launches while being curious about the campaigns to bring added value in the long run, whether it’s unlocking further operational efficiencies or providing recommendations for different approaches.\nWhat you’ll do\nWe are seeking a detail-oriented and proactive Performance Marketing Ad Operations professional to join our dynamic team. Your primary responsibilities will include:\nBuilding and managing ads across various platforms, including Meta, LinkedIn, Google, and Bing.\nOverseeing pacing and reporting for ongoing campaigns, pulling queries, and conducting data uploads.\nAccessing Stripe's marketing data tables and leveraging Google Sheets for analytics and reporting.\nCollaborating primarily with the performance marketing team while also interacting with creative agencies, campaigns, and marketing operations as necessary.\nQualifications:\nBachelor’s degree with a passion for learning about paid marketing.\n2-3 years of experience in paid marketing, either at an agency or in-house role.\nProficient with paid channels such as Meta, LinkedIn, Google, and Bing, with relevant certifications preferred.\nProficient in leveraging Excel or Google Sheets for data management; SQL experience is a plus.\nHave experience leveraging marketing technology tools and data visualization tools \nStrong attention to detail, ability to deliver quickly, and receptiveness to feedback.\nAbility to work collaboratively with cross-functional teams and adapt to changing project requirements.\nStrong time management and organizational skills to juggle multiple tasks and meet tight deadlines.\nExcellent communication skills and a collaborative mindset.\nPassion for staying up-to-date with ad platform trends, UI changes, and best practices.",
    "job_link": "https://stripe.com/jobs/listing/advertising-operations-associate/7185423",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:51:23.837625"
  },
  {
    "title": "AE Manager, Funded Startup Hunter (French Speaking)",
    "location": "Paris",
    "experience_required": null,
    "job_description": "Who we are\nAbout Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies - from the world’s largest enterprises to the most ambitious startups - use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone's reach while doing the most important work of your career.\nAbout the team\nThe Funded Startups team is dedicated to winning all top venture capital backed startups in EMEA. We achieve this by combining subject matter expertise with robust collaboration within the startup ecosystem. Our focus is on identifying and partnering with high-potential startups, assisting them in monetizing their products, scaling globally, and creating new revenue streams. \nBy bringing the next generation of high-potential users to Stripe, we aim to support Stripe’s mission to to increase the GDP of the internet while fostering sustainable growth.\n What you’ll do\nIn this role you and your team will create partnerships between Stripe and the most innovative and fastest-growing founders of funded startups in EMEA. As a Sales Manager at Stripe, you’ll play an instrumental role in fueling Stripe’s growth in this high priority segment through new customer acquisition. \nYou'll lead and coach high-performing account executives, helping them deliver on ambitious targets, as well as roll up your sleeves to work directly with users and prospects. We are looking for an individual who is keen to work alongside a high-performing team of individuals to navigate complex organizations.\nSimilar to founders, the segment requires you and your team to be able to pivot tactically while staying focused on the long-term goal, acquiring and activating the next cohort of top users for Stripe.\n Responsibilities\nRecruit, develop and lead a team of sales professionals, with a particular focus top funded startups\nHelp leadership to define and implement the long-term vision and strategy for the team and manage day-to-day operations, with a focus on performance against key sales metrics\nSupport your team to develop and implement full sales cycle strategies for driving product adoption, net new product sales, and client retention. \nCoach and guide the team in developing consultative and solution-based sales skills through all facets of the sales cycle\nWork together with the investment partnership team on VC portfolio analyses and founder-focused gatherings\nSolve complex client needs and work across product, sales, risk, and operations together with your team to improve our product\nMake sure that internal teams are set up for users’ success by coordinating with other Stripe teams such as Solution architects, SDRs, Marketing, Product and many more.\nInspire, motivate and enable personal and career development of team members, both to promote career growth and to increase impact for Stripe\n Who you are\nWe’re looking for a well-rounded individual who thrives in highly ambiguous environments. Our funded users are some of the most ambitious and demanding customers and a successful candidate will match their curiosity, speed and passion to build things by overcoming challenges.\nYou are solution-oriented, adaptable, have a keen interest in coaching and developing a team of high potential sellers. \nWe’re looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. The preferred qualifications are a bonus, not a requirement.\n Location\nDublin, Ireland; Paris France\n Minimum requirements\n8+ years of relevant sales experience\nFluency in French\nTrack record of overachieving against ambitious sales targets\nAbility to understand complex technical ecosystems and build great relationships with technical customers\nExperience consistently forecasting and managing a high growth business for multiple quarters\nAbility to hire, train, and coach a high-performance sales team\nAbility to build executive relationships with customers and ecosystem partners\nA knack for working well with a wide range of stakeholders, both internally and externally\nAbility and motivation to operate in a highly ambiguous and fast-paced environment\nSuperior verbal and written communication skills\nPreferred requirements\nPrior experience in payments\nPrior experience in a sales and/or customer-facing role at a high growth technology company\nPrior experience in the startup ecosystem, either as founder or operator in a fast-scaling company\nInterest in business models and monetization",
    "job_link": "https://stripe.com/jobs/listing/ae-manager-funded-startup-hunter-french-speaking/6862044",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:51:25.388395"
  },
  {
    "title": "AMER GTM Finance & Strategy Segment Lead",
    "location": "South San Francisco HQ",
    "experience_required": null,
    "job_description": "Who we are\nAbout Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies - from the world’s largest enterprises to the most ambitious startups - use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone's reach while doing the most important work of your career.\nAbout the team\nThe Finance & Strategy team is an integral thought partner to Stripe’s core functional leaders.  We bring understanding and predictability to Stripe’s bottom line financials.  We work cross functionally across many surfaces at Stripe and help steward Stripe’s resource investments to improve the durability of our long term financial performance.\nWhat you’ll do\nYou will partner directly with our Global Enterprise Sales team, playing a pivotal role in guiding Stripe’s go-to-market strategies and driving revenue performance across large customer segments. As a trusted advisor to senior sales leadership, you will use financial insights to shape investments, improve forecasting accuracy, and optimize how we build our GTM. Your work will support Stripe’s ambitious global expansion and help accelerate growth in our enterprise customer base.\nResponsibilities\nLead strategic finance support for the Global Enterprise Sales organization, driving insight into user-level performance, sales performance, pipeline conversion, quota attainment, and strategic account planning - contributing to recurring business performance reporting cadences.\nOwn forecasting, planning, and budgeting processes for Enterprise Sales; provide actionable insights that support investment decisions and sales efficiency.\nCollaborate with Sales, Sales Operations & Strategy, and Marketing to assess ROI of GTM initiatives and customer acquisition strategies.\nBuild dynamic financial and operating models to evaluate new sales strategies, pricing changes, large enterprise deals, and regional expansion opportunities.\nRefine, scale, and where necessary implement robust reporting and dashboards that track KPIs including our funnel and key investment drivers.\nIdentify and drive opportunities for process automation and data streamlining to improve reporting accuracy and decision velocity.\nServe as a key contributor to quarterly business reviews and long-range planning exercises, providing strategic recommendations and scenario analyses.\nTranslate complex financial and sales data into clear narratives for executive audiences.\nWho you are\nWe're looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. The preferred qualifications are a bonus, not a requirement.\nMinimum requirements\n10+ years of experience in FP&A, Sales Finance, or Strategic Finance roles supporting Enterprise Sales teams\nDemonstrated ability to analyze pipeline health, forecast revenue, and model user and sales dynamics in complex B2B environments\nProven track record of partnering with senior GTM leaders and influencing business decisions through financial insight\nStrong financial modeling skills and experience with large, multi-variable planning tools\nSome SQL skills to independently access and manipulate complex datasets\nExcellent communication and presentation skills, with the ability to distill complex concepts into clear, actionable insights\nComfortable operating in fast-paced, ambiguous environments and balancing strategic thinking with hands-on execution\nPreferred qualifications\nExperience working at a high-growth technology or financial services company\nAnaplan, Tableau or other equivalent application experience\nAdvanced SQL skills\nExperience in data visualization and dashboarding",
    "job_link": "https://stripe.com/jobs/listing/amer-gtm-finance-strategy-segment-lead/6917719",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:51:26.718059"
  },
  {
    "title": "Analytics Lead, Privy",
    "location": "New York Privy HQ",
    "experience_required": null,
    "job_description": "Who we are\nAbout Privy\nOur mission is to make privacy and user ownership the default online. We build simple, flexible developer tooling that make it easy to build products that put users first. By leveraging modern cryptography, we shift the status quo around digital ownership and protect the accounts and assets of millions of users.\nLearn more about Privy: Privy and Stripe: Bringing crypto to everyone\nWhat you’ll do\nAnalytics at Privy is not just about running queries or building reports. We transform messy, high-volume data into scalable systems and clear insights that guide product decisions and business strategy. We design pipelines that are resilient, models that are intuitive, and tools that make data accessible and trustworthy for everyone across the company. We believe in clean abstractions, transparency, and sharing our work so teammates can build on top of it. We push each other to ask sharper questions, test bold ideas, and follow the signal in the data so we can shape better products and empower our customers.\nWho you are \n8+ years in an analytics engineering or data engineering role, preferably in a SaaS environment.\nProficiency in SQL and data modeling techniques.\nExperience with ETL processes and tools (e.g., Airflow, dbt, or similar).\nFamiliarity with analytics tools like Looker, Tableau, or similar BI platforms.\nExperience working with cloud data storage solutions (AWS, GCP, etc.).\nFamiliarity with product analytics tools (e.g., Amplitude, Mixpanel). \nAbility to translate business requirements into analytical solutions.\nComfortable working with cross-functional teams, presenting technical insights to non-technical stakeholders.\nPreferred qualifications\nExperience in an API-based business and in payments, fintech, or crypto.\nExperience with usage-based pricing models and understanding of how complex queries impact customer billing.\nExperience in launching new products in fast-paced, scaling environments.\nExperience with data governance and ensuring data quality at scale.",
    "job_link": "https://stripe.com/jobs/listing/analytics-lead-privy/7195991",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:51:27.755388"
  },
  {
    "title": "APAC Demand Generation Manager, Platforms",
    "location": "Singapore",
    "experience_required": null,
    "job_description": "Who we are\nAbout Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies—from the world’s largest enterprises to the most ambitious startups—use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone’s reach while doing the most important work of your career.\nAbout the team\nAPAC Demand Generation is a team of marketers and channel specialists that drive strategies to engage prospects and customers and generate demand for our prioritized solutions. We partner closely with global and regional campaigns, product marketing, field marketing, sales development, and sales teams to bring full-funnel campaigns to life, optimize performance, and drive business impact. Our team works across APAC markets, all customer segments, and at each stage of the customer lifecycle journey. \nWhat you’ll do\nStripe serves SaaS Platforms from startups through to enterprises and defines SaaS Platforms as a B2B SaaS provider of software to businesses that also facilitates payments for their customers so they can collect payments from their end customers. You will sit at the center of the regional Platforms marketing hub, building Stripe’s Platforms marketing in collaboration with global and regional partners and stakeholders.You will facilitate bi-directional feedback, learnings, and best practices between regional and global teams and lead the pipeline performance for this segment, driving in-market activations and owning APAC campaigns and assets. \nThis role requires a highly collaborative individual who thinks both strategically and tactically to get things done. It is a business critical role and a great opportunity to build and have an impact across our GTM organization. \nResponsibilities\nDevelop and execute a multi-channel demand generation strategy to acquire SaaS platform companies across APAC - from startups to enterprises - in partnership with global and regional teams, facilitating bi-directional feedback, learnings, and best practices.\nBuild a cross-GTM coalition including Global Marketing, Regional Sales, Sales Development, and Sales Operations to jointly grow the pipeline.\nOwn key business and revenue metrics for Platforms across the full funnel while investigating business health issues such as conversion and lead quality.\nWork with local field marketers to align regional strategies and execution plans, communicating cross-region demand generation strategy and activities to the Head of APAC Platforms Sales. \nLand global campaigns in the focus APAC markets in conjunction with audience PMMs and global campaign leads to acquire and nurture leads at scale through digital content, paid placement, digital events, targeted nurture programs, etc.\nBe a Saas Platforms thought leader differentiating APAC leadership position as we grow across our campaigns and broader go-to-market at Stripe.\nWork with global and regional performance media experts to acquire and re-engage customers through a broad mix of paid media tactics.\nPartner with partner marketing to amplify the demand generation plan with the partner marketing channel in each region.\nDevelop account-based marketing strategies for named account lists.\nPartner cross-functionally to define regional requirements as Stripe refines our marketing capabilities, MarTech stack, and lead management.\nIdentify innovative new ways to reach and engage our users.\nContinually optimize for efficiency, scale for growth, and prioritize for focus.\nWho you are\nWe’re looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. The preferred qualifications are a bonus, not a requirement.\nMinimum requirements\n8+ years years of relevant experience running marketing programs in the SaaS industry.\nHave experience working in tech and marketing to SaaS organisations from digital natives to startups and marketplaces.\nExperience working closely with Sales teams, including joint planning and execution, driving disciplined lead follow-up, and earning trust as a strategic business partner.\nProven track record of defining and executing end-to-end, multi-channel programmes with a wide range of cross-functional stakeholders that deliver against funnel metrics and KPIs.\nStrong written and verbal communication skills; able to convey complex topics with simplicity.\nExcellent analytical skills and the ability to craft actionable insights from complex data.\nDeep understanding of paid media tactics, digital marketing strategies, marketing automation, email marketing tactics, account based marketing, and lead management.\nStrong ability to work cross functionally in a highly matrixed organization.\nSuperb organization and project management skills and the capacity to manage multiple complex projects at once.\nA startup mentality with a bias to action and the ability to flex in a fast-paced environment.\nPreferred qualifications\nB2B marketing experience owning a regional demand generation strategy across multiple countries, customer segments, and products.\nExperience in or exposure to the partner marketing function. \nExperience in the payments, financial technology, or adjacent industries, or marketing FinTech solutions or to FinTech companies.\nExperience at a highly dynamic, high-growth tech company or consulting firm.",
    "job_link": "https://stripe.com/jobs/listing/apac-demand-generation-manager-platforms/7006757",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:51:29.375875"
  },
  {
    "title": "APAC Product Marketing Lead",
    "location": "Singapore",
    "experience_required": null,
    "job_description": "About the team\nThe international product marketing team is responsible for increasing product awareness and adoption in key geographic regions. The team achieves this by gathering customer insights to inform stripe's product strategy, spearheading go-to-market strategy and product launches and collaborating with customer-facing and product teams to drive product adoption\n About the role \nWe're seeking a senior product marketing leader to drive stripe’s product growth and adoption across APAC. This is a pivotal role, responsible for leading a team of regional PMMs, shaping strategy, and driving high-impact execution across markets. you will act as a key partner to product, sales, and marketing leadership globally—translating stripe’s product vision into regional momentum and results.\nThis is a leadership role with broad strategic accountability across multiple markets, products, and channels. It’s ideally suited to a leader who brings deep functional expertise, strong people leadership, and the ability to operate at both 30,000 feet and ground level.\n What you’ll do\nVision & strategy\nDefine the APAC product marketing priorities in alignment with product and GTM strategies.\nIdentify and pursue growth opportunities across Stripe’s portfolio—especially in priority markets and high-potential segments.\nTranslate business priorities into actionable regional plans across strategy, messaging & launch, and enablement & growth.\n Market intelligence & product partnership\nLead the generation of regional market insights—across customer needs, vertical trends, competitive moves, and product performance.\nInfluence product strategy by advocating for APAC customer needs and surfacing regional opportunities to global PMM and product leaders.\n Go-to-Market excellence\nDrive regional launch strategy and execution for major products, features, and GTM initiatives.\nDevelop localised messaging frameworks and narratives that resonate deeply with buyers across segments and geographies.\nPartner with demand generation, comms and brand to align messaging and storytelling across touchpoints.\n GTM enablement & growth\nCollaborate with sales leaders to ensure teams are equipped to position and sell Stripe products effectively.\nDeliver enablement programs that accelerate regional product adoption, improve win rates, and deepen customer engagement.\nSupport programs that drive awareness and demand across both self-serve and sales-assisted motions, tailoring approaches to local maturity.\n Team development & management\nLead a high-performing team of product marketers across APAC priority markets.\nDevelop career paths and provide coaching for growth\n Performance, impact & reporting\nDefine success metrics and own reporting on product marketing impact—covering adoption, awareness, sales performance, and market share.\nCascade insights and strategy updates to global and regional stakeholders, including senior leadership.\nContinuously raise the bar through retrospectives, experimentation, and cross-functional feedback.\n Who you are \nStrategic leader: Ability to translate business strategy into actionable marketing plans\nPeople developer: Experience building and mentoring high-performing teams\nMarket expert: Deep understanding of international markets and regional nuances\nResults driven: Track record of driving measurable business impact\nCross-functional partner: Skilled at working across organizations and managing multiple stakeholders\nCommunications expert: Excellence in messaging development and storytelling\n We’re looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. \nQualifications\nMust have:\n10+ years of experience in product marketing, including 3+ years managing teams.\nDeep knowledge of B2B GTM motions across both sales-led and self-serve channels.\nStrong record of leading cross-functional initiatives that drove measurable product growth.\nProven ability to influence product direction with market data and customer insight.\nExperience leading in matrixed orgs and working with senior stakeholders across product, sales, and marketing.\nStrong communicator with high judgment and a bias for clarity and action.\nRegional expertise across APAC regions, with sensitivity to cultural, regulatory, and market nuances.\n Preferred:\nExperience marketing financial infrastructure, developer platforms, or fintech products.\nFamiliarity with Stripe’s customer segments—ranging from startups and SMBs to global enterprises.",
    "job_link": "https://stripe.com/jobs/listing/apac-product-marketing-lead/6982328",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:51:30.958086"
  },
  {
    "title": "APAC Renewals Specialist (Mandarin Speaking)",
    "location": "Singapore",
    "experience_required": null,
    "job_description": "Who we are\nAbout Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies - from the world’s largest enterprises to the most ambitious startups - use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone's reach while doing the most important work of your career.\nAbout the team\nThe Renewals Team focuses on facilitating contract renewals at Stripe. We partner with sales on the administrative and analytical aspects of a renewal, including identifying upcoming renewals, determining historical consumption and pricing, positioning value, surfacing upsell/cross-sell opportunities and helping close deals.\nWhat you’ll do\nThe Renewals Specialist will partner with AE’s, sales management, Customer Success and internal partners to retain and expand user revenue. The successful candidate will work with their sales team to produce and present compelling customer proposals, ensuring that large contracts are renewed on-time and quoted accurately. We are looking for a self-starter to join our team who has demonstrated success dealing with ambiguity, operating in a fast-growing environment, and solving problems with limited oversight. The ideal candidate will demonstrate that they can or have partnered closely with cross-functional teams, deliver tasks, project manage complex initiatives and make data-driven decisions. Our ideal candidates will have had experience crafting and structuring deals, and building scalable processes. \nA successful candidate will have a demonstrated ability to think strategically and analytically to identify cross-functional challenges and build consensus, within team and across functions, to execute against fluctuating volumes and complex projects. \nResponsibilities:\nWork with existing Stripe customers and Stripe Account Executives to develop and execute sales strategies to renew and expand Stripe’s revenue\nPartner on deal strategy and commercial negotiations for large, complex renewals\nResearch user purchase and renewal history and make recommendations based on prior activity\nGather requirements from Sales and User account signals for renewal, expansion and cross-sell/upsell opportunities\nAssist with complex quote creation\nIdentify and optimise repeatable and scalable processes, looking to automate, re-tool, process improve and vendorise as appropriate\nHelp cultivate a team culture that includes high ownership, customer-first focus, fast-paced, high integrity, and an optimistic and positive environment\nReport out on a regular weekly, monthly, and quarterly cadence to key stakeholders, with a strong analytical approach and crisp communication style\nWho you are\nWe're looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. The preferred qualifications are a bonus, not a requirement.\nMinimum requirements\n3+ years of experience in Renewals, Account Management, or Customer Success ideally in a tech environment\nStrong analytical skills, and an enjoyment for crunching through data to extract insights and make commercial recommendations\nStrong verbal and written communication skills in English and Mandarin; to engage with some of our China-based merchants and analyze Mandarin documents\nAbility to understand technical requirements and propose solutions across multiple products\nA knack for working well with a wide range of people, both internally and externally\nProven ability to lead complex negotiations involving bespoke commercial agreements\nExperience working within a high-growth, technology company with the ability to operate successfully in a lean, fast-paced organization\nPreferred qualifications:\nExperience working in the financial services/payments industry",
    "job_link": "https://stripe.com/jobs/listing/apac-renewals-specialist-mandarin-speaking/7230693",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:51:32.463719"
  },
  {
    "title": "APAC Solutions Architect (Mandarin Speaking)",
    "location": "Singapore",
    "experience_required": null,
    "job_description": "Who we are\nAbout Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies - from the world’s largest enterprises to the most ambitious startups - use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone's reach while doing the most important work of your career.\nAbout the team\nThe Solutions Architecture Team partners with our users to realize their full potential through the adoption of prescriptive solutions that drive their growth and success. We influence revenue growth across Stripe’s product portfolio, and collaborate with sales, support, product management, and Stripe’s executive team to provide the best experience to our most valued customers. \nWhat you’ll do\nAs a member of the team, the Solutions Architect will uncover the deepest levels of customer pain and desired outcomes, going beyond surface-level requirements. By truly understanding their strategic business objectives, you will architect and tailor Stripe's solutions as the definitive answer to their most pressing challenges. You will be instrumental in mapping the customer's transformation journey, crafting future-state roadmaps and solution architectures that inherently factor in complex third-party integrations.\nResponsibilities\nExecute meticulous technical discovery, conducting in-depth business analysis and background research on customer operations, industry dynamics, and competitive landscapes to build a foundational understanding that informs every proposed solution. This goes beyond fact-finding; it's about understanding their \"why.\"\nLead strategic engagements, guiding users through a structured discovery process to align with their core business priorities. You will design compelling, technically sound solutions and master the \"technical win\" by evangelizing these proposals through executive briefings, comprehensive readouts, tailored presentations, and impactful solution demonstrations that resonate with the customer's specific challenges and desired future state.\nIdentify and articulate expansion opportunities, strategically extending Stripe’s footprint within existing accounts into new global markets and business units. This involves introducing new capabilities and local payment methods, always with a clear focus on the technical feasibility and the value delivered at each touchpoint.\nAct as the \"Voice of the Customer\" within Stripe's product and engineering teams, meticulously capturing insights, emerging trends, and new opportunities from the field. You will champion these requirements, ensuring they are accurately prioritized and inform future product development.\nServe as the critical technical counterpoint to the sales executive, providing invaluable technical insight and designing robust solutions for both prospective and existing platform users. You will be the expert guide on Stripe's technical merits and strategic benefits for both platforms and their end-user base.\nCraft and deliver compelling technical demonstrations that don't just show features, but powerfully showcase how Stripe's platform solves specific business problems, highlighting the unique value proposition, key differentiators, and potential for customization. Crucially, you will illustrate how these benefits cascade directly to the customer's own user base, driving their success.\nWho you are\nWe're looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. The preferred qualifications are a bonus, not a requirement.\nMinimum requirements\n7+ years of experience in a similar customer-facing engineering role such as sales engineer, pre-sale solution consultant or solutions architect for a global software enterprise.\nStrong verbal and written communication skills in English and Mandarin to work with enterprise Chinese merchants based in China\nExecutive engagement skills and presence, with an ability to establish strong relationships with key decision makers and build credibility at all levels.\nEffective group-facilitation skills and confidence in proposing and leading customer meetings to gain strategic footing and pursue opportunities.\nThorough understanding of the software development lifecycle and API architectures. A background in writing code in any of Stripe’s primary deployment languages (Ruby, Python, JavaScript, Java, Go, etc.) is a plus.\nOutstanding spoken and written communication skills, presentation skills, and confident in explaining complex concepts to both technical and non-technical audiences.\nAbility to operate independently in a highly ambiguous and fast-paced environment\nPassion to take on ownership and drive change in a constantly evolving environment. \nAbility to travel per business needs\nPreferred qualifications\nExperience in the payments/ billing / invoicing / issuing / banking / Fintech space\nPrior experience in consulting\nExperience at a growth stage internet/software company",
    "job_link": "https://stripe.com/jobs/listing/apac-solutions-architect-mandarin-speaking/7079944",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:51:34.068313"
  },
  {
    "title": "Backend Engineer, Billing",
    "location": "Toronto",
    "experience_required": null,
    "job_description": "Who we are\nAbout Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies—from the world’s largest enterprises to the most ambitious startups—use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone’s reach while doing the most important work of your career.\nAbout the team\nThe Billing organization at Stripe builds and operates Stripe Billing, a growing core product of Stripe. Hundreds of thousands of businesses of all sizes and types use Stripe Billing to collect revenue for recurring and one-time payments across a variety of different pricing models—from selling SaaS subscriptions, to orchestrating multi-stage contracts, delivering Usage-Based Billing, and providing recovery and retention tools to prevent customer churn.\nTo support even the most unique and complex business models, our technology and products must be configurable and programmable. This requires our team to innovate in how we model different types of businesses, and how we use technology to enable customers to piece together Stripe’s Billing’s platform primitives into holistic solutions that support any type of business. Through this work, Stripe Billing allows worry-free innovation and evolution of any customer’s business model. Stripe is defining the industry’s approach to Billing solutions; we’re looking for innovators to join us.\nWhat you’ll do\nAs an engineer on the team, you’ll be responsible for shaping and building a suite of products that let our users model and operate their business more efficiently. You will work on projects that span technologies, systems, and processes where you will design, build, test, and ship great code every day. In this cross functional role, you will collaborate with experts in infrastructure, security, design, and operations to build mission critical internal and external features that power Stripe users around the world. \nResponsibilities\nWork with a wide range of systems, processes, and technologies to own and solve problems.\nWork closely with engineers, designers, and product managers to build new features and products.\nUphold our high engineering standards and bring consistency to the many codebases and processes you will encounter.\nBuild elegant APIs and user experiences that enable merchants to run and scale their businesses on top of Stripe\nContribute to the design and architecture of the next generation of Stripe’s infrastructure, to meet the high growth needs of our company and customers for years to come.\nWho you are\nWe’re looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. The preferred qualifications are a bonus, not a requirement.\nMinimum requirements\nYou have 3-10+ years of experience as a Backend or Software Engineer.\nTake pride in solving complex backend or distributed systems work at scale. \nHave a high bar for keeping your solutions expressive yet simple to use, and can put yourself in the shoes of your users.\nThrive in a collaborative environment involving different stakeholders.\nYou’re obsessed with product quality and don’t settle for “good enough.”",
    "job_link": "https://stripe.com/jobs/listing/backend-engineer-billing/5932585",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:51:35.688009"
  },
  {
    "title": "Backend Engineer, Core Tech, Canada",
    "location": "Toronto",
    "experience_required": null,
    "job_description": "Who we are\nAbout Stripe \nStripe is a financial infrastructure platform for businesses. Millions of companies—from the world’s largest enterprises to the most ambitious startups—use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone’s reach while doing the most important work of your career.\nAbout the organization \nStripe Infrastructure is responsible for the reliability, scale, performance, and cost of Stripe’s systems and the productivity and sentiment of Stripe’s people. \nYou may work on a wide variety of critical business areas including: \nCore Infrastructure - We’re the home for Stripe's critical tier0 infrastructure systems (Compute, Networking, DocumentDB, Distributed Caching and High assurance engineering). We build the foundational platform for Stripe products and services to allow them to operate at scale. We drive reliability, availability, efficiency and scalability of these systems.\nDeveloper Infrastructure - We’re responsible for the productivity of all developers at Stripe. Ensure Stripe’s engineers have a reliable, fast, and easy-to-use inner dev loop to maximize productivity while building everything from low-latency microservices to large-scale data pipelines and machine learning models\nData Platform -  We’re responsible for offering data serving infrastructure spanning across data warehouse analytics, streaming analytics and search capabilities. The stack is supported by a collection of internally developed large scale distributed services and several popular open source technologies like Trino/Presto, Apache Pinot, Hive Metastore, ElasticSearch etc. The systems we own support all of the data serving needs of high scale services and thousands of individual Stripes across the company. \nAdmin Platform - We empower Stripes to quickly build secure and delightful internal products in service of their users.\nSupport Experience - We build and improve our 24x7 email, phone, and chat support channels, our Premium Support and Enterprise Services products, our Support Site, and more. This includes how users get help within our products, how they get in touch with us when they have questions, and how our teams use internal tools to answer those questions.\nService Platform - We enable engineering teams at Stripe to easily write and ship useful services that correctly, reliably, and efficiently leverage platform capabilities. \nTeam Matching: exact team matching for one of the subteams will begin during final stages. Please note we may also consider you for different orgs based on your experience, location, etc. More information on our team matching process can be found here.\nWhat you’ll do\nYou will work on projects that span technologies, systems, and processes where you will design, build, test, and ship great code every day.\nResponsibilities\nBuild a great customer experience for internal and external Stripe teams using our infrastructure\nParticipate in roadmap planning and prioritization\nDeliver value through a strong collaborative approach with multiple customers and stakeholders across Stripe\nDebug production issues across services and several levels of the stack\nWho you are\nWe’re looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. The preferred qualifications are a bonus, not a requirement.\nMinimum Requirements \nStrong software engineering skills and a passion for one of the areas above.\nAbility to write high quality code (in programming languages like Go, Java, C/C++ etc)\n2-12+ years of professional hands-on software development experience, able to write well-factored algorithms and have experience with commonly used data structure and algorithms\nHands-on experience contributing to or building large scale distributed systems\nStrong collaboration skills, can work across workstreams within your team and contribute to your peers’ success\nCustomer obsession, ability to articulate and represent customer experience in various forums to drive the right outcome\nHave the ability to thrive on a high level of autonomy, responsibility, and think of yourself as entrepreneurial\nPreferred Qualifications\nExperience optimizing the end to end performance of distributed systems\nFocuses on the needs of our users, both internal and external\nHolds yourself and others to a high bar when working with production",
    "job_link": "https://stripe.com/jobs/listing/backend-engineer-core-tech-canada/6567253",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:51:37.113764"
  },
  {
    "title": "Backend Engineer, Core Technology",
    "location": "Dublin HQ",
    "experience_required": null,
    "job_description": "Note: if you are an intern, new grad, or staff applicant, please do not apply using this link and visit our jobs page for those specific postings.\nWho we are\nAbout Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies - from the world’s largest enterprises to the most ambitious startups - use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone's reach while doing the most important work of your career.\nAbout the Organization \nCore Infrastructure: We’re the home for Stripe's critical tier0 infrastructure systems (Compute, Networking, DocumentDB, Distributed Caching and High assurance engineering). We build the foundational platform for Stripe products and services to allow them to operate at scale. We drive reliability, availability, efficiency and scalability of these systems.\nDeveloper Infrastructure: We’re responsible for the productivity of all developers at Stripe. Ensure Stripe’s engineers have a reliable, fast, and easy-to-use inner dev loop to maximize productivity while building everything from low-latency microservices to large-scale data pipelines and machine learning models. \nReliability Insights and Excellence: We build tools and frameworks to introspect and improve reliability across Stripe.\nApplication and Revenue Platform: Building the powerful and scalable infrastructure that powers the company’s innovative application offerings and supports the seamless processing and management of Stripe’s global transaction volumes.\nFinance Systems: Our mission is to enable effective financial decisions through reliable data, increased efficiency and automation. We support Accounting, Tax, Finance & Strategy (F&S), Finance Operations (FinOps) and Treasury functions across Automation, Data insights and process improvements.\nService Platform: We enable engineering teams at Stripe to easily write and ship useful services that correctly, reliably, and efficiently leverage platform capabilities. \nTeam Matching: exact team matching for one of the subteams within one of these orgs will begin during final stages. Please note we may also consider you for different orgs based on your experience, location, etc. More information on our team matching process can be found here. \nWhat you’ll do\nWe’re looking for Software Engineers who are interested in building software services and platforms that impact thousands of employees and millions of Stripe users, regardless of whether they’re an end user, developer, or partner. You will work on projects that span technologies, systems, and processes where you will design, build, test, and ship great code every day.\nResponsibilities\nBuild a great customer experience for internal and external Stripe teams using our infrastructure\nParticipate in roadmap planning and prioritization\nDeliver value through a strong collaborative approach with multiple customers and stakeholders across Stripe\nDebug production issues across services and several levels of the stack\nWho you are\nWe're looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. The preferred qualifications are a bonus, not a requirement.\nMinimum requirements\n2-12+ years of industry software engineering experience (does not include internships or co-ops)\nAbility to write well-factored algorithms and have experience with commonly used data structures and algorithms\nHands-on experience contributing to or building large scale distributed systems\nStrong coding skills in any programming language (we understand new languages can be learned on the job so our interview process is language agnostic)\nStrong collaboration skills, can work across workstreams within your team and contribute to your peers’ success\nHave the ability to thrive on a high level of autonomy, responsibility, and think of yourself as entrepreneurial\nInterest in working as a generalist across varying technologies and stacks to solve problems and delight both internal and external users\nPreferred Qualifications\nExperience optimizing the end to end performance of distributed systems\nFocuses on the needs of our users, both internal and external\nHold yourself and others to a high bar when working with production",
    "job_link": "https://stripe.com/jobs/listing/backend-engineer-core-technology/6686634",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:51:38.488320"
  },
  {
    "title": "Backend Engineer, Core Technology",
    "location": "Chicago",
    "experience_required": null,
    "job_description": "Who we are\nAbout Stripe \nStripe is a financial infrastructure platform for businesses. Millions of companies—from the world’s largest enterprises to the most ambitious startups—use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone’s reach while doing the most important work of your career.\nAbout the organization \nStripe Infrastructure is responsible for the reliability, scale, performance, and cost of Stripe’s systems and the productivity and sentiment of Stripe’s people. \nYou may work on a wide variety of critical business areas including: \nCore Infrastructure - We’re the home for Stripe's critical tier0 infrastructure systems (Compute, Networking, DocumentDB, Distributed Caching and High assurance engineering). We build the foundational platform for Stripe products and services to allow them to operate at scale. We drive reliability, availability, efficiency and scalability of these systems.\nDeveloper Infrastructure - We’re responsible for the productivity of all developers at Stripe. Ensure Stripe’s engineers have a reliable, fast, and easy-to-use inner dev loop to maximize productivity while building everything from low-latency microservices to large-scale data pipelines and machine learning models\nData Platform -  We’re responsible for offering data serving infrastructure spanning across data warehouse analytics, streaming analytics and search capabilities. The stack is supported by a collection of internally developed large scale distributed services and several popular open source technologies like Trino/Presto, Apache Pinot, Hive Metastore, ElasticSearch etc. The systems we own support all of the data serving needs of high scale services and thousands of individual Stripes across the company. \nAdmin Platform - We empower Stripes to quickly build secure and delightful internal products in service of their users.\nApplication & Revenue Platform - We are responsible for the systems that allow automated billing of Stripe's users, and for building data platforms and pipelines needed for Stripe’s regulatory reports across global markets. This team owns an unusual mix of platform, infrastructure, and product problems. \nService Platform - We enable engineering teams at Stripe to easily write and ship useful services that correctly, reliably, and efficiently leverage platform capabilities. \nFinancial Systems - We build the platforms used to automate accounting, tax and finance functions at stripe. We power critical business decisions and ensure Stripe's compliance. We process all Stripe transactions to build the source of truth of money movement.\nTeam Matching: exact team matching for one of the subteams will begin during final stages. Please note we may also consider you for different orgs based on your experience, location, etc. More information on our team matching process can be found here.\nWhat you’ll do\nYou will work on projects that span technologies, systems, and processes where you will design, build, test, and ship great code every day.\nResponsibilities\nBuild a great customer experience for internal and external Stripe teams using our infrastructure\nParticipate in roadmap planning and prioritization\nDeliver value through a strong collaborative approach with multiple customers and stakeholders across Stripe\nDebug production issues across services and several levels of the stack\nWho you are\nWe’re looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. The preferred qualifications are a bonus, not a requirement.\nMinimum Requirements \nStrong software engineering skills and a passion for one of the areas above.\nAbility to write high quality code (in programming languages like Go, Java, C/C++ etc)\n2-12+ years of professional hands-on software development experience, able to write well-factored algorithms and have experience with commonly used data structure and algorithms\nHands-on experience contributing to or building large scale distributed systems\nStrong collaboration skills, can work across workstreams within your team and contribute to your peers’ success\nCustomer obsession, ability to articulate and represent customer experience in various forums to drive the right outcome\nHave the ability to thrive on a high level of autonomy, responsibility, and think of yourself as entrepreneurial\nPreferred Qualifications\nExperience optimizing the end to end performance of distributed systems\nFocuses on the needs of our users, both internal and external\nHold yourself and others to a high bar when working with production",
    "job_link": "https://stripe.com/jobs/listing/backend-engineer-core-technology/6042172",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:51:40.088157"
  },
  {
    "title": "Backend Engineer, Infrastructure",
    "location": "Bucharest",
    "experience_required": null,
    "job_description": "Who we are\nAbout Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies—from the world’s largest enterprises to the most ambitious startups—use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone’s reach while doing the most important work of your career.\nAbout the organization \nWe provide leveraged and usable infrastructure for Stripes to explore innovative, new products while concurrently extending secure, reliable and cost-effective mature business lines.\nOur mission is to:\nEnable Stripe product teams to rapidly build new products, and quickly iterate on existing products, to drive value for our users and Stripe.\nProvide Stripe’s product teams a secure, performant, and efficient platform for creating and maintaining their products and services\nEnable Stripe’s engineers to build scalable applications with high speed, quality and performance\nEnable Stripe’s largest users to scale their businesses on Stripe.\nYou may work on a wide variety of critical business areas including: \nDeveloper Infrastructure - We are responsible for making Stripe’s developers happy and productive. We work on tools, processes, and code refactoring to accelerate Stripe engineering as Stripe scales. You’ll collaborate closely with partner teams in Europe, such as CI Infra and CI Services, Test Environments and Frameworks, as well as partner teams based in the US who provide language specific tooling for Engineers who develop in any of Stripe’s supported languages (Ruby, Java, Golang, Python and more).\nOperator tooling - At Operator Tooling, we're on a mission to eliminate the burdensome manual processes that weigh down our operators, freeing them to focus on the impactful, meaningful work they were hired to do. We're building a platform to tackle the daily frustrations head-on, from those endless Excel files, unstructured email chains, and repetitive, time-draining tasks.\nCompliance Foundations - Internal Controls Engineering owns systems and tools to measure and increase operational efficiency of all internal controls throughout Stripe. We build tools for owners of financial, business, and technology controls. We are part of a larger Compliance Foundations engineering organization, and work closely with our partner engineering teams to increase efficiency and predictability of compliance.\nInternal Developer Toolings - The team is responsible for accelerating Stripe’s developers and providing a positive experience. We work on tools, processes, and code refactoring to enhance Stripe's engineering as it scales.The team has three main areas of responsibility. Our mission encompasses optimizing day-to-day engineering work in regards to our QA infrastructure, advancing the capabilities of the Synthetics tool, and facilitating effective service-to-service testing. Through these efforts, we aim to improve the reliability of Stripe's systems and platforms, enhance the quality of deliverables, and ultimately foster a more efficient and innovative development process.\nPrivileged Access Tooling - This team improves security by providing secure alternatives to unrestricted access, safeguarding sensitive systems and data. We develop robust tools and interfaces to minimize risks associated with privileged access, ensuring data integrity and confidentiality. Teams use our tools as they provide safe, intuitive and simple interfaces for their operational workflows minimizing the need for default, extreme privileged access.\nWhat you’ll do\nYou will work on projects that span technologies, systems, and processes where you will design, build, test, and ship great code every day.\nResponsibilities\nBuild a great customer experience for internal and external Stripe teams using our infrastructure\nParticipate in roadmap planning and prioritization\nDeliver value through a strong collaborative approach with multiple customers and stakeholders across Stripe\nDebug production issues across services and several levels of the stack.\nWho you are\nWe’re looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. The preferred qualifications are a bonus, not a requirement.\nMinimum Requirements \nStrong software engineering skills and a passion for one of the areas above.\n2+ years of professional hands-on software development experience, able to write well-factored algorithms and have experience with commonly used data structure and algorithms\nHands-on experience contributing to or building large scale distributed systems\nStrong collaboration skills, can work across work streams within your team and contribute to your peers’ success\nCustomer obsession, ability to articulate and represent customer experience in various forums to drive the right outcome\nHave the ability to thrive on a high level of autonomy, responsibility, and think of yourself as entrepreneurial\nPreferred Qualifications\nAbility to write high quality code (in programming languages like Python, Java, Go, Javascript, C#, Go, PHP, Kotlin, Ruby, C++) Experience optimizing the end to end performance of distributed systems\nFocuses on the needs of our users, both internal and external\nHolds yourself and others to a high bar when working with production",
    "job_link": "https://stripe.com/jobs/listing/backend-engineer-infrastructure/6623777",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:51:41.744350"
  },
  {
    "title": "Backend Engineer, Revenue and Financial Automation",
    "location": "Remote in Canada",
    "experience_required": null,
    "job_description": "Who we are\nAbout Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies—from the world’s largest enterprises to the most ambitious startups—use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone’s reach while doing the most important work of your career.\nAbout the team\nThe Revenue and Financial Automation (RFA) team at Stripe is building a modern, revenue-focused, financial management platform for fast growing, digital native companies. \nAtlas: Atlas makes starting an internet company faster and simpler by decreasing the complexity and bundling everything you need. Founders, from anywhere in the world, can create a company, open a bank account, and be ready to charge customers, fundraise, and hire a team—in a few clicks.\nBusiness Network: We are building the \"N\" in the GPTN -- enabling businesses on Stripe to discover and conduct commerce with other businesses using cheaper faster rails.\nTax: You know how everyone loves taxes? And it's such a simple, stable, and well-understood area? We handle all the sales-related taxes (across Checkout & Billing) and make it super easy to register, auto-collect the right amount of tax, and access the reports you need to file returns globally\nBilling: Hundreds of thousands of businesses of all sizes and types use Stripe Billing to collect revenue for recurring and one-time payments across a variety of different pricing models—from selling SaaS subscriptions, to orchestrating multi-stage contracts, delivering Usage-Based Billing, and providing recovery and retention tools to prevent customer churn.\nRADS: Building user-facing products to deliver a best-in-class analytics, data services, and reporting and analytics platform for all Stripe users. \nNote: exact team matching for one of the pods will begin during final stages. Please note we may also consider you for different orgs based on your experience, location, etc. More information on our team matching process can be found here. \nWhat you’ll do\nAs an engineer on the team, you’ll be responsible for shaping and building a suite of products that let our users model and operate their business more efficiently. You will work on projects that span technologies, systems, and processes where you will design, build, test, and ship great code every day. In this cross functional role, you will collaborate with experts in infrastructure, security, design, and operations to build mission critical internal and external features that power Stripe users around the world. \nResponsibilities\nDesign the next generation of Stripe products, to meet the high growth needs of our company and customers for years to come.\nDeliver value through a strong collaborative and users-first approach with stakeholders and customers.\nParticipate in roadmap planning and prioritization.\nDebug production issues across services and several levels of the stack.\nWho you are\nWe’re looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. The preferred qualifications are a bonus, not a requirement.\nMinimum requirements\n2-12+ years of experience in backend software development\nAbility to write high quality code (in programming languages like Go, Java, C/C++, etc.)\nHands-on experience contributing to or building large scale distributed systems\nStrong collaboration skills, can work across workstreams within your team and contribute to your peers’ success\nHave the ability to thrive on a high level of autonomy, responsibility, and think of yourself as entrepreneurial\nPreferred Qualifications\nFamiliarity with event-driven architectures\nExperience with subscription management, usage-based billing, or financial reporting systems\nInterest in financial infrastructure and how businesses manage their revenue operations\nDirect leadership and mentorship experience",
    "job_link": "https://stripe.com/jobs/listing/backend-engineer-revenue-and-financial-automation/7217048",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:51:43.056703"
  },
  {
    "title": "Backend Engineer/API, Payments and Risk",
    "location": "Dublin HQ",
    "experience_required": null,
    "job_description": "Note: if you are an intern, new grad, or staff applicant, please do not apply using this link and visit our jobs page for those specific postings.\nWho we are\nAbout Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies - from the world’s largest enterprises to the most ambitious startups - use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone's reach while doing the most important work of your career.\nAbout the Organization \nThe Payments organization focuses on developing products and platforms that enable users to accept payments from customers efficiently. This includes building APIs for processing payments, enabling regional, non-card payment options, and extending Stripe's capabilities to make it easy for businesses to accept in-person payments. The Risk Engineering team develops products that minimize financial and regulatory risks while ensuring a seamless user experience, thereby safeguarding Stripe’s brand and financial stability. \nTeam Matching: exact team matching for one of the subteams within this org will begin during final stages. Please note we may also consider you for different orgs based on your experience, location, etc. More information on our team matching process can be found here.  \nWhat you’ll do\nWe’re looking for Backend engineers who want to make an impact on managing money at a global scale with a passion for building ergonomic APIs. You’ll play a key role in extending our balance management platform and in building out a new funds accessibility platform leveraged by enterprises and SMBs alike. Our team collaborates with many cross-functional teams – from Infrastructure to Product –  at Stripe to deliver innovative solutions that address evolving user needs.\nResponsibilities\nScope, design, build, and maintain APIs, services, and large-scale systems that reliably and efficiently handle billions of money movement requests\nDebug and solve critical production issues across services and multiple levels of the stack\nMentor engineers to help them grow\nCollaborate with stakeholders across the company to build new features at large-scale, while improving internal engineering standards, tooling, and processes\nCollaborate effectively in a distributed and hybrid team, maintaining open communication and strong connections with colleagues\nWho you are\nWe're looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. The preferred qualifications are a bonus, not a requirement.\nMinimum requirements\n2-12+ years of industry software engineering experience (does not include internships nor includes co-ops)\nStrong coding skills in any programming language (we understand new languages can be learned on the job so our interview process is language agnostic)\nStrong collaboration skills, can work across workstreams within your team and contribute to your peers’ success\nHave the ability to thrive on a high level of autonomy, responsibility, and think of yourself as entrepreneurial\nInterest in working as a generalist across varying technologies and stacks to solve problems and delight both internal and external users\nPreferred Qualifications\nExperience with large-scale financial tracking systems\nGood understanding and practical knowledge in cloud based services (e.g. gRPC, GraphQL, Docker/Kubernetes, cloud services such as AWS, etc.)",
    "job_link": "https://stripe.com/jobs/listing/backend-engineer-api-payments-and-risk/4921361",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:51:44.958655"
  },
  {
    "title": "Backend/API Engineer, Money as a Service",
    "location": "Dublin HQ",
    "experience_required": null,
    "job_description": "Note: if you are an intern, new grad, or staff applicant, please do not apply using this link and visit our jobs page for those specific postings.\nWho we are\nAbout Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies - from the world’s largest enterprises to the most ambitious startups - use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone's reach while doing the most important work of your career.\nAbout the Organization \nMoney as a Service (MaaS) oversees a diverse portfolio of Stripe's core products and platforms. These offerings facilitate the global movement and management of funds for users. We ensure Stripe users have the robust financial infrastructure and tools they need to power their businesses on a global scale.\nTeam Matching: exact team matching for one of the subteams within this org will begin during final stages. Please note we may also consider you for different orgs based on your experience, location, etc. More information on our team matching process can be found here. \nWhat you’ll do\nWe’re looking for Backend Engineers who want to make an impact on managing money at a global scale with a passion for building ergonomic APIs. You’ll play a key role in extending our balance management platform and in building out a new funds accessibility platform leveraged by enterprises and SMBs alike. Our team collaborates with many cross-functional teams – from Infrastructure to Product –  at Stripe to deliver innovative solutions that address evolving user needs.\nResponsibilities\nScope, design, build, and maintain APIs, services, and large-scale systems that reliably and efficiently handle billions of money movement requests\nDebug and solve critical production issues across services and multiple levels of the stack\nMentor engineers to help them grow\nCollaborate with stakeholders across the company to build new features at large-scale, while improving internal engineering standards, tooling, and processes\nCollaborate effectively in a distributed and hybrid team, maintaining open communication and strong connections with colleagues\nWho you are\nWe're looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. The preferred qualifications are a bonus, not a requirement.\nMinimum requirements\n2-12+ years of industry software engineering experience (does not include internships nor includes co-ops)\nStrong coding skills in any programming language (we understand new languages can be learned on the job so our interview process is language agnostic)\nStrong collaboration skills, can work across workstreams within your team and contribute to your peers’ success\nHave the ability to thrive on a high level of autonomy, responsibility, and think of yourself as entrepreneurial\nInterest in working as a generalist across varying technologies and stacks to solve problems and delight both internal and external users\nPreferred Qualifications\nExperience with large-scale financial tracking systems\nGood understanding and practical knowledge in cloud based services (e.g. gRPC, GraphQL, Docker/Kubernetes, cloud services such as AWS, etc.)",
    "job_link": "https://stripe.com/jobs/listing/backend-api-engineer-money-as-a-service/7168716",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:51:46.292459"
  },
  {
    "title": "Backend/API Engineer, Money as a Service (Canada)",
    "location": "Toronto",
    "experience_required": null,
    "job_description": "Note: if you are an intern, new grad, staff, frontend or fullstack applicant, please do not apply using this link and visit our jobs page for those specific postings.\nWho we are\nAbout Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies - from the world’s largest enterprises to the most ambitious startups - use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone's reach while doing the most important work of your career.\nAbout the Organization \nMoney as a Service (MaaS) Sub-orgs within MaaS: Accounts and Connect, Money Movement and Storage (MMS), Stripe’s Banking-as-a-Service (BaaS), Crypto\nMoney as a Service (MaaS) oversees a diverse portfolio of Stripe's core products and platforms. These offerings facilitate the global movement and management of funds for users. The teams that fall under the MaaS umbrella include: Accounts and Connect, Money Movement and Storage (MMS), Crypto and Banking as a Service (BaaS). Together, these teams work to ensure Stripe users have the robust financial infrastructure and tools they need to power their businesses on a global scale.\nTeam Matching: exact team matching for one of the subteams will begin during final stages. Please note we may also consider you for different orgs based on your experience, location, etc. More information on our team matching process can be found here. \nWhat you’ll do\nWe’re looking for Backend Engineers who want to make an impact on managing money at a global scale with a passion for building ergonomic APIs. You’ll play a key role in extending our balance management platform and in building out a new funds accessibility platform leveraged by enterprises and SMBs alike. Our team collaborates with many cross-functional teams – from Infrastructure to Product –  at Stripe to deliver innovative solutions that address evolving user needs.\nResponsibilities\nScope, design, build, and maintain APIs, services, and large-scale systems that reliably and efficiently handle billions of money movement requests\nDebug and solve critical production issues across services and multiple levels of the stack\nMentor engineers to help them grow\nCollaborate with stakeholders across the company to build new features at large-scale, while improving internal engineering standards, tooling, and processes\nCollaborate effectively in a distributed and hybrid team, maintaining open communication and strong connections with colleagues\nWho you are\nWe're looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. The preferred qualifications are a bonus, not a requirement.\nMinimum requirements\n2-12+ years of industry software engineering experience (does not include internships nor includes co-ops)\nStrong coding skills in any programming language (we understand new languages can be learned on the job so our interview process is language agnostic)\nStrong collaboration skills, can work across workstreams within your team and contribute to your peers’ success\nHave the ability to thrive on a high level of autonomy, responsibility, and think of yourself as entrepreneurial\nInterest in working as a generalist across varying technologies and stacks to solve problems and delight both internal and external users\nPreferred Qualifications\nExperience with large-scale financial tracking systems\nGood understanding and practical knowledge in cloud based services (e.g. gRPC, GraphQL, Docker/Kubernetes, cloud services such as AWS, etc.)",
    "job_link": "https://stripe.com/jobs/listing/backend-api-engineer-money-as-a-service-canada/6176763",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:51:48.005131"
  },
  {
    "title": "Backend/API Engineer, Money as a Service (US)",
    "location": "Seattle",
    "experience_required": null,
    "job_description": "Note: if you are an intern, new grad, staff, frontend or fullstack applicant, please do not apply using this link and visit our jobs page for those specific postings.\nWho we are\nAbout Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies - from the world’s largest enterprises to the most ambitious startups - use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone's reach while doing the most important work of your career.\nAbout the Organization \nMoney as a Service (MaaS) Sub-orgs within MaaS: Accounts and Connect, Money Movement and Storage (MMS), Stripe’s Banking-as-a-Service (BaaS), Crypto\nMoney as a Service (MaaS) oversees a diverse portfolio of Stripe's core products and platforms. These offerings facilitate the global movement and management of funds for users. The teams that fall under the MaaS umbrella include: Accounts and Connect, Money Movement and Storage (MMS), Crypto and Banking as a Service (BaaS). Together, these teams work to ensure Stripe users have the robust financial infrastructure and tools they need to power their businesses on a global scale.\nTeam Matching: exact team matching for one of the subteams will begin during final stages. Please note we may also consider you for different orgs based on your experience, location, etc. More information on our team matching process can be found here. \nWhat you’ll do\nWe’re looking for Backend Engineers who want to make an impact on managing money at a global scale with a passion for building ergonomic APIs. You’ll play a key role in extending our balance management platform and in building out a new funds accessibility platform leveraged by enterprises and SMBs alike. Our team collaborates with many cross-functional teams – from Infrastructure to Product –  at Stripe to deliver innovative solutions that address evolving user needs.\nResponsibilities\nScope, design, build, and maintain APIs, services, and large-scale systems that reliably and efficiently handle billions of money movement requests\nDebug and solve critical production issues across services and multiple levels of the stack\nMentor engineers to help them grow\nCollaborate with stakeholders across the company to build new features at large-scale, while improving internal engineering standards, tooling, and processes\nCollaborate effectively in a distributed and hybrid team, maintaining open communication and strong connections with colleagues\nWho you are\nWe're looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. The preferred qualifications are a bonus, not a requirement.\nMinimum requirements\n2-12+ years of industry software engineering experience (does not include internships nor includes co-ops)\nStrong coding skills in any programming language (we understand new languages can be learned on the job so our interview process is language agnostic)\nStrong collaboration skills, can work across workstreams within your team and contribute to your peers’ success\nHave the ability to thrive on a high level of autonomy, responsibility, and think of yourself as entrepreneurial\nInterest in working as a generalist across varying technologies and stacks to solve problems and delight both internal and external users\nPreferred Qualifications\nExperience with large-scale financial tracking systems\nGood understanding and practical knowledge in cloud based services (e.g. gRPC, GraphQL, Docker/Kubernetes, cloud services such as AWS, etc.)",
    "job_link": "https://stripe.com/jobs/listing/backend-api-engineer-money-as-a-service-us/6176758",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:51:49.337466"
  },
  {
    "title": "Benefits Specialist",
    "location": "Atlanta",
    "experience_required": null,
    "job_description": "Who we are\nAbout Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies—from the world’s largest enterprises to the most ambitious startups—use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone’s reach while doing the most important work of your career.\nAbout the team\nThe Benefits team is fundamental to the Stripe experience and enablement, directly supporting our global workforce. The Benefits team ensures our offerings are competitive, clearly understood, and fully compliant with local regulations across 27 countries, consistently evolving our benefits strategy to meet the diverse needs of our employees.\nWe are seeking a Benefits Specialist, experienced in benefits administration, to join our team in the U.S. This position requires a strong background in addressing benefits-related inquiries from employees in multinational technology organizations, significant experience with US benefits operations, leave administration, file integrations, and billing and reconciliation.\nWhat you’ll do\nResponsibilities\nLead and execute compliance related projects such as ACA reporting, HCSO, and 5500 reporting.\nRespond to questions regarding benefit enrollment status, Workday assistance, general benefits coverage details, retirement or pension contributions, time off, leaves of absences, benefit new hire questions, and more.   \nAdminister benefit enrollments, approvals, and reports within Stripe’s vendor portals.\nProactively review process and policy documentation to identify opportunities and streamline operations.\nProcess Workday events such as qualified life events, time off corrections, event corrections, leave of absence requests, etc.\nManage vendor eligibility files and error reporting / corrections to ensure timely and accurate eligibility data to all carriers.\nManage benefits invoices by inputting data for invoice generation, reconcile and review invoices for accuracy, and work with finance ops to ensure timely payment and efficient processes are in place. \nExecute open enrollment operations including Workday testing, employee meetings, and file feed and integration updates and processing.\nWho you are\nWe’re looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. The preferred qualifications are a bonus, not a requirement.\nMinimum requirements\n1-3 years of experience in an employee-facing benefits operations role with US-based insurance, Workday, and benefits experience required.\nA strong understanding of employee benefits programs and the ability to explain complex information in a clear, empathetic way to Stripes.\nExperience using Workday (specifically the Benefits and Time Off modules).\nEnjoy problem-solving and are comfortable working across teams to resolve issues and drive process improvements.\nExperienced in maintaining accuracy regarding benefits enrollments and invoicing to enable vendors to access accurate eligibility and payment data\nStrong english communication skills (written and verbal required).\nDetail-oriented, analytical, and adaptable, with a continuous improvement mindset.\nStrong operational execution and organizational skills.\nDiscretion and judgment handling confidential and sensitive data.\nPreferred qualifications\nExperience in working on AMER benefit portals like - Forma, HMSA, Risco etc would be a plus.\nExperience working in a fast paced, growing environment, preferably in a technology company or large scale organization.\nExperience utilizing company policies and practices to determine appropriate recommendations. \nExperience with benefits operations and programs in EMEA and APAC are a plus.",
    "job_link": "https://stripe.com/jobs/listing/benefits-specialist/7190448",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:51:50.752175"
  },
  {
    "title": "Benefits Specialist",
    "location": "Dublin HQ",
    "experience_required": null,
    "job_description": "Who we are\nAbout Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies - from the world’s largest enterprises to the most ambitious startups - use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone's reach while doing the most important work of your career.\nAbout the team\nThe Benefits team is fundamental to the Stripe experience and enablement, directly supporting our global workforce. The Benefits team ensures our offerings are competitive, clearly understood, and fully compliant with local regulations across 28 countries, consistently evolving our benefits strategy to meet the diverse needs of our employees.\nWhat you’ll do\nWe are seeking a Benefits Specialist, experienced in benefits administration, to join our team in Dublin, Ireland. This position requires a strong background in addressing benefits and leave of absence-related inquiries from employees in multinational technology organizations, experience in benefits and/or People operations, process optimization, and documenting and executing processes.\nResponsibilities\nRespond to questions regarding benefit enrollment status, Workday assistance, general benefits coverage details, pension contributions, time off, leaves of absence, benefit new hire questions, and more.\nProvide a positive user experience as you answer questions and address issues for Stripes.\nManage benefits reporting for Payroll.\nAdminister employee benefit programs such as health and risk insurance, retirement plans, leave of absence, and disability programs. \nAdminister benefit enrollments and terminations.\nDocument benefits processes and proactively seek and take initiative for process improvements and automation.\nProcess Workday events such as qualified life events, time off corrections, event corrections, leave of absence requests, etc.\nAssist with global benefits programs in EMEA and APAC.\nManage the completion of EMEA and APAC-specific compliance items.\nWork closely with partner teams from HR, Payroll, Legal, Mobility, Systems and People Operations to administer benefits and time off programs.\nSupport with ad-hoc projects within the regions.\nWho you are\nWe're looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. The preferred qualifications are a bonus, not a requirement.\nMinimum requirements\n1-3 years of experience in an employee-facing benefits operations role with EMEA/APAC-based insurance, Workday, and benefits experience required.\nA strong understanding of employee benefits programs and the ability to explain complex information in a clear, empathetic way to Stripes.\nExperience using Workday (specifically the Benefits and Time Off modules).\nEnjoy problem-solving and are comfortable working across teams to resolve issues and drive process improvements.\nExperience in maintaining accuracy with benefits data processing, reporting, and analysis.\nStrong communication skills (written and verbal required). \nDetail-oriented, analytical, and adaptable, with a continuous improvement mindset.\nStrong operational execution and organizational skills.\nDiscretion and judgment handling confidential and sensitive data.\nPreferred qualifications\nExperience in working with benefits vendors and brokers/consultants.\nExperience working in a fast paced, growing environment, preferably in a technology company or large scale organization.\nExperience utilizing company policies and practices to determine appropriate recommendations. \nExperience with benefits operations and programs in the U.S., Canada, and LATAM is a plus.",
    "job_link": "https://stripe.com/jobs/listing/benefits-specialist/7228678",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:51:52.045288"
  },
  {
    "title": "Billing Solutions Architect",
    "location": "South San Francisco HQ",
    "experience_required": null,
    "job_description": "Who We Are\nAbout Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies—from the world’s largest enterprises to the most ambitious startups—use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone’s reach while doing the most important work of your career.\nAbout The Team\nThe Billing Solutions Architects (SA) team is a group of specialists with a deep understanding of Stripe's products and the broader subscription, billing, and payments industry. They excel at using Stripe's platform to solve complex customer problems and collaborate with sales teams to create custom solutions and provide strategic guidance to merchants. Their contributions extend to helping achieve revenue and pipeline goals, offering insights on go-to-market plans, and providing valuable feedback to product and engineering teams.\n What You'll Do\nYou will be a key technical advisor and solutions expert, driving the adoption of our billing solutions with new and existing customers. You'll collaborate closely with sales, marketing, product, and engineering teams to ensure successful customer go-lives and influence our product roadmap based on market trends and customer needs. This involves building deep relationships with customer stakeholders, developing and delivering technical solutions, and scaling the organization's expertise through training and knowledge sharing. You’ll have the opportunity to shape the future of internet commerce - working on challenging problems at a global scale in a collaborative and innovative work environment.\nResponsibilities:\nTechnical Expertise: Serve as the subject matter expert on our billing and revenue recognition solutions, demonstrating deep understanding of order-to-cash processes, customer journeys, and the competitive landscape.\nSolution Development: Architect elegant solutions addressing specific customer challenges, including complex integrations and customizations.\nCustomer Success: Partner with sales and alliances teams to drive opportunities for our largest customers, leading solution strategy and laying groundwork for successful implementations.\nProduct Influence: Act as the \"voice of the customer,\" providing actionable insights to influence product development and feature prioritization.\nKnowledge Scaling: Create and share best practices, reusable assets, and training materials to enhance go-to-market efficiency.\nTechnical Support: Help resolve complex technical issues for key customers, working with customer success and engineering teams.\nSales Support: Represent technical aspects in sales forecasts, identify potential blockers, and propose solutions.\nMarket Engagement: Participate in marketing events, including executive briefings, conferences, and trade shows.\nWho you are\nIf you’re passionate about people, ideas, and embracing the unknown; if you see setbacks as chances to learn and grow; and if you believe in the power of focused effort to drive progress—then this is the place for you! You're encouraged to apply even if your experience doesn't precisely match the job description. At Stripe, we welcome diverse perspectives and people who think rigorously and aren't afraid to challenge assumptions.\nMinimum Requirements:\n10+ years of experience in technical sales or pre-sales roles, focusing on solution architecture and best practices\n5+ years of current experience in the payments, fintech, or closely related industry\nStrong technical acumen in API integrations, SaaS platforms, and enterprise architectures, with particular emphasis on order-to-cash processes and billing systems\nExtensive experience with subscription, billing, and payment solutions\nSolid understanding of financial infrastructure industry trends and emerging technologies\nExcellent communication skills, with the ability to articulate complex technical concepts to diverse audiences\nExecutive presence and strong relationship-building skills\nPassion for customer success and dedication to championing the customer voice\nWillingness to travel up to 50% of the time",
    "job_link": "https://stripe.com/jobs/listing/billing-solutions-architect/7181979",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:51:53.609712"
  },
  {
    "title": "Billing Solutions Architect, DACH",
    "location": "London",
    "experience_required": null,
    "job_description": "Who we are\nAbout Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies - from the world’s largest enterprises to the most ambitious startups - use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone's reach while doing the most important work of your career.\nAbout the team\nThe Billing Solutions Architects (SA) team is a group of specialists with a deep understanding of Stripe's products and the broader subscription, billing, and payments industry. They excel at using Stripe's platform to solve complex customer problems and collaborate with sales teams to create custom solutions and provide strategic guidance to merchants. Their contributions extend to helping achieve revenue and pipeline goals, offering insights on go-to-market plans, and providing valuable feedback to product and engineering teams\nWhat you’ll do\nYou will be a key technical advisor and solutions expert, driving the adoption of our billing solutions with new and existing customers. You'll collaborate closely with sales, marketing, product, and engineering teams to ensure successful customer go-lives and influence our product roadmap based on market trends and customer needs. This involves building deep relationships with customer stakeholders, developing and delivering technical solutions, and scaling the organization's expertise through training and knowledge sharing. You’ll have the opportunity to shape the future of internet commerce - working on challenging problems at a global scale in a collaborative and innovative work environment. Your primary focus will be on expanding and strengthening Stripe's presence in the DACH region.\nResponsibilities \nTechnical Expertise: Serve as the subject matter expert on our billing and revenue recognition solutions, demonstrating deep understanding of order-to-cash processes, customer journeys, and the competitive landscape.\nSolution Development: Architect elegant solutions addressing specific customer challenges, including complex integrations and customizations.\nCustomer Success: Partner with sales and alliances teams to drive opportunities for our largest customers, leading solution strategy and laying groundwork for successful implementations.\nProduct Influence: Act as the \"voice of the customer,\" providing actionable insights to influence product development and feature prioritization.\nKnowledge Scaling: Create and share best practices, reusable assets, and training materials to enhance go-to-market efficiency.\nTechnical Support: Help resolve complex technical issues for key customers, working with customer success and engineering teams.\nSales Support: Represent technical aspects in sales forecasts, identify potential blockers, and propose solutions.\nMarket Engagement: Participate in marketing events, including executive briefings, conferences, and trade shows.\nRegional Expertise: Develop and maintain a deep understanding of the DACH region's market dynamics, regulatory environment, and business practices related to payments and billing solutions.\nWho you are\nIf you’re passionate about people, ideas, and embracing the unknown; if you see setbacks as chances to learn and grow; and if you believe in the power of focused effort to drive progress—then this is the place for you! You're encouraged to apply even if your experience doesn't precisely match the job description. At Stripe, we welcome diverse perspectives and people who think rigorously and aren't afraid to challenge assumptions.\nMinimum requirements\n10+ years of experience in technical sales or pre-sales roles, focusing on solution architecture and best practices\n5+ years of current experience in the payments, fintech, or closely related industry\nStrong technical acumen in API integrations, SaaS platforms, and enterprise architectures, with particular emphasis on order-to-cash processes and billing systems\nKnowledge of regional compliance and regulatory requirements related to payments and billing, including GDPR, PSD2, and local tax laws.\nExtensive experience with subscription, billing, and payment solutions\nSolid understanding of financial infrastructure industry trends and emerging technologies\nExcellent communication skills, with the ability to articulate complex technical concepts to diverse audiences\nExecutive presence and strong relationship-building skills\nPassion for customer success and dedication to championing the customer voice\nExcellent communication both in German and English\nWillingness to travel up to 50% of the time",
    "job_link": "https://stripe.com/jobs/listing/billing-solutions-architect-dach/7115730",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:51:55.216486"
  },
  {
    "title": "Brand Designer, Workplace",
    "location": "South San Francisco HQ",
    "experience_required": null,
    "job_description": "Who we are\nAbout Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies - from the world’s largest enterprises to the most ambitious startups - use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone's reach while doing the most important work of your career.\nAbout the team\nThe Brand Studio team works across most teams and projects at Stripe. We elevate high quality creative across brand standards, advertising campaigns, internal brand, global events, and more. \nThe Brand Identity team on Brand Studio collaborates both in-house and with agency partners to manage and define both internal and external brand systems and deliver assets across every part of Stripe. We define the design quality bar for Stripe’s brands and provide tools and services to deliver world class design. We focus both on evolving new creative ideas as well as building robust systems for scale. We sweat the details to ensure the highest quality experience for our users (and other Stripes).\nThe ideal candidate excels at working fast and scrappy without sacrificing the highest quality, has a growth mindset, and can bring fresh expressions within an internal brand sandbox. They understand the best practices of design for workplace settings, can hold their own in stakeholder reviews, and know how to drive work forward through layers of stakeholder alignment while maintaining energy and enthusiasm for the work.\nWhat you’ll do\nAs a designer working on internal brand workplace projects, you will collaborate with the Workplace team and other creatives at Stripe to ensure the Stripe offices are vibrant, inspiring places to work. You’ll be responsible for ideating, designing, and managing production across a variety of different kinds of creative ideas that elevate the Stripe culture inside Stripe offices around the world. Whether designing the work yourself, or working with selected partners and vendors, you are expected to raise the design quality and consistency of interactions with the Stripe brand.\nResponsibilities\nConceive of and execute on internal brand ideas across a wide range of deliverables: posters, art, branding, signage, and ideas that go beyond the expected \nDevelop and maintain our global wayfinding, signage, and artwork standards to align with real estate project needs \nBring the Stripe culture to life through interesting and inspiring creative ideas\nHave impeccable taste and an understanding of how to bring that taste to workplace projects\nBring design concepts to life through storyboarding, comps, and creative presentations \nIterate on creative based on stakeholder feedback and internal testing\nPresent ideas in a clear and focused way that builds consensus within the team\nCollaborate with writers, designers, animators, creative technologists and more to make interesting things\nDrive creative quality, collaboration, and cohesion across multiple external agencies in tandem\nPartner with cross functional teams including DEIB, local site leads, operations managers, Stripe Design team, Stripe Press, and Marketing to ensure standards evolve as our company branding does \nWho you are\nWe're looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. The preferred qualifications are a bonus, not a requirement.\nMinimum requirements\n5+ years experience at agency/in-house, concepting and designing ideas for brand and product advertising\nExperience working collaborating with and overseeing agencies and production partners to execute concepts at the highest level\nExperience designing and articulating creative decisions\nExperience bringing ideas to life with high quality comps and prototypes\nDemonstrated experience working on creative ideas that inspire audiences\nExperience bringing ideas to life through comps and creative presentations\nExperience in Figma and Adobe Creative Suite applications\nAre passionate about Stripe’s mission and are eager to build for the long term and drive global change\nHave excellent organization and presentation skills, and excel in written and verbal communication\nPreferred qualifications\nHas experience designing for physical spaces\nHas experience producing physical items from creative to production",
    "job_link": "https://stripe.com/jobs/listing/brand-designer-workplace/7017444",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:51:56.754755"
  },
  {
    "title": "Bridge - Operations Associate",
    "location": "Bengaluru",
    "experience_required": null,
    "job_description": "Who we are\nAbout Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies - from the world’s largest enterprises to the most ambitious startups - use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone's reach while doing the most important work of your career.\nBridge, a Stripe company, is a rapidly growing business and the number of developers integrating our APIs is growing quickly. We provide Slack-based support to our developers on a wide range of topics in close partnership with our internal engineering team. We’re a small but mighty team that’s expanding global coverage and is looking to make our first Product Support Specialists hires in Mexico City.\nAbout the team\nIn this role, you’ll be working directly with developers integrating Bridge APIs and helping them resolve their issues. You will take ownership of complex, technical user issues and work across teams to resolve them. As part of the team, you’ll have a big impact to grow the Product Support operation and enhance various aspects such as capacity planning and forecasting, operational tools and systems, workflow optimization and automation, metrics and reporting, quality control, and more.\nWhat you’ll do\nStripe is launching Stripe Delivery Centers - a brand new global team to design, implement and grow Stripe’s operations for the next decade. We are looking for dynamic and curious people that have a passion for solving global user issues, building operations, driving process improvements and want to play a front-line role in building this new operational capability for Stripe and accelerating Stripe’s growth. If you like challenging, scaled problems and are an amazing teammate, we want to hear from you!\n Responsibilities\nAnalyze and troubleshoot complex technical issues through direct user interaction (Slack) and leveraging your knowledge of API documentation.\nDevelop product and platform expertise, working closely with Engineering, Product, and Operations teams to diagnose and resolve user issues.\nStrategically optimize and scale support processes to enhance efficiency and improve the overall user experience, incorporating data-driven insights and metrics.\nLead continuous improvement initiatives aimed at hitting key performance metrics.\nCreate and refine documentation to empower users to resolve issues via self-service, reducing dependency on support teams.\nConstantly challenge the status quo and push for innovation in user support strategies and operational processes. \nWho you are\nWe're looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. The preferred qualifications are a bonus, not a requirement.\nMinimum requirements\n1-5 years of experience in a customer support role. \nYou have a user first mindset and are energized by the challenge of solving difficult problems.\nYou have excellent communication skills, both written and verbally.\nYou excel in analytical thinking and problem solving.\nYou might have prior experience in customer service or internal/external user facing operations processes, you are an organized, self-starter with passion for finding solutions to our user’s challenges.\nYou have a process-oriented mindset and ability to get things done.\nYou enjoy working in an in-office environment with strong cross team collaboration and support.\nYou are able to prioritize and enjoy working in a quick-moving environment.\nYou are humble and have a proven track record for working well across teams and with external partners.\nYou're willing to periodically work a weekend day for which you will receive a weekday off; the SDC operates during daytime hours with shifts from the morning through early evening. \nPreferred qualifications\nFamiliarity with SQL and ability to use template or premade SQL queries as part of investigations.\nPrior experience with cryptocurrency support.",
    "job_link": "https://stripe.com/jobs/listing/bridge-operations-associate/7179634",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:51:58.342333"
  },
  {
    "title": "Business Development Manager, Agentic Commerce",
    "location": "South San Francisco HQ",
    "experience_required": null,
    "job_description": "Who we are\nAbout Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies - from the world’s largest enterprises to the most ambitious startups - use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone's reach while doing the most important work of your career.\nWhat you’ll do\nIn this role, you will be at the forefront of a rapidly evolving space, helping to define and execute Stripe's strategy for enabling AI agents to thrive online. You will play a critical role in engaging early adopters, understanding key use cases, and driving the Stripe narrative on Agentic Commerce.\nResponsibilities\nEngage with early adopters among AI companies, marketplaces, and developers to understand their needs and challenges in leveraging financial services within agentic workflows. This includes companies focused on personal shopping agents and those building AI-powered applications.\nDevelop a deep understanding of agentic commerce use profiles, including traditional companies exploring AI, marketplaces with monetization needs, personal shopping agents requiring spend/hold/receive functionalities, and developers seeking Stripe integration.\nArticulate Stripe’s narrative on agentic commerce and its value proposition to various audiences, demonstrating how Stripe is solving key problems such as automating financial services, monetizing AI agent usage, enabling secure spending by AI agents, and simplifying integration.\nDevelop and recommend solutions in partnership with core Account Executives, Solutions Architects, Product, and Product Marketing tailoring Stripe's offerings to specific agentic commerce use cases.\nContribute to the development and execution of the go-to-market strategy for Agentic Commerce.\nHelp develop AI-specific sales plays and identify key use cases to drive adoption.\nEngage with strategic partners, particularly with networks like Visa, to explore collaborative opportunities and influence the future of AI-enabled commerce. This includes understanding Visa's Agentic Commerce program and identifying areas for joint efforts.\nGather and share user feedback and industry trends to inform Stripe's product strategy and roadmap for Agentic Commerce.\nCollaborate closely with Product Marketing to create educational content and enablement materials for internal teams and potential users.\nEvangelize Stripe's Agentic Commerce position in relevant forums such as EBCs, Sessions, Tours, and contribute to establishing Stripe as a leader in this space.\nWho you are\nWe're looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. The preferred qualifications are a bonus, not a requirement.\nMinimum requirements\n5+ years of experience in business development, sales, or partnerships within the technology or financial services industry.\nStrong understanding of the AI landscape, including LLMs, AI Agents, and their applications.\nFamiliarity with payments processing, financial services APIs, and usage-based billing models.\nProven ability to identify and develop new business opportunities and build strong customer relationships.\nExcellent communication, presentation, and interpersonal skills, with the ability to articulate complex technical concepts to both technical and non-technical audiences.\nExperience working cross-functionally with product, marketing, and sales teams.",
    "job_link": "https://stripe.com/jobs/listing/business-development-manager-agentic-commerce/7067252",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:51:59.615667"
  },
  {
    "title": "Business Recruiter (Fixed Term Contract)",
    "location": "Toronto",
    "experience_required": null,
    "job_description": "Who we are\nAbout Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies - from the world’s largest enterprises to the most ambitious startups - use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone's reach while doing the most important work of your career.\nAbout the team\nTo further this important mission, we are looking for a consultative and creative Recruiter to join us and work with Stripe to grow and scale our teams. You can expect high impact and wide-ranging responsibility: owning full-cycle recruiting, driving hiring strategy, leading first-in-kind searches, and delivering best-in-class candidate experience. This person must be a builder who thrives in a learning environment—unafraid to try new things, embrace new ideas, and welcome suggestions for how we can iterate on our processes. This is a 11 month fixed-term contract.\nWhat you’ll do\nResponsibilities\nPartner with senior leaders across the organization to understand their hiring objectives and develop team recruiting strategies to hit headcount goals\nHelp initiate creative and scalable changes to our existing recruiting strategy\nTrack and analyze metrics and report on hiring progress to business leadership on a regular cadence\nConcentrate on creating strategic plans for sourcing candidates with diverse backgrounds for each of your roles\nWork closely with cross-functional teams like Finance, People Ops, Benefits, Onboarding and Legal to deliver a high-quality and holistic candidate experience\nWho you are\nWe're looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. The preferred qualifications are a bonus, not a requirement.\nMinimum requirements\n5+ years of full-cycle Business and/or General Recruiting experience in a fast-paced, high-growth environment including in house experience\nExcellent verbal and written communication skills, with an appropriate blend of professionalism and friendliness\nProven abilities to attract passive senior candidates and build a diverse pipelines\nAn active and data driven approach to problem solving; you enjoy making sense of the trends and using the insights to better your process to make it more efficient\nPreferred qualifications\nA passion for building teams and delivering exceptional candidate experience\nA growth mindset and truly flexible. You can shift tasks and priorities when circumstances change (at a fast-growing startup, they often do)\nAn interest in working in a cross-functional and fluid environment, the ability to learn quickly, and no desire to take yourself too seriously",
    "job_link": "https://stripe.com/jobs/listing/business-recruiter-fixed-term-contract/7233201",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:52:01.153288"
  },
  {
    "title": "Business Systems Architect, Financial Systems",
    "location": "Bengaluru",
    "experience_required": null,
    "job_description": "Who we are\nAbout Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies - from the world’s largest enterprises to the most ambitious startups - use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone's reach while doing the most important work of your career.\nAbout the team\nAs a platform company powering businesses all over the world, Stripe processes payments, runs marketplaces, detects fraud, helps entrepreneurs start an internet business from anywhere in the world, builds world-class APIs, and more. As we aspire to be the world's financial infrastructure, we have to internally create a finance infrastructure that can scale to our aspirations.\nThe FinSys team owns one of Stripe’s internal financial infrastructure that enables us to operate our global business efficiently. We own the tools that help generate financial statements, manage finance operations, enable our F&S team partner with the broader business and so on.\nThis role will partner with the Finance team stakeholders to support features of our financial systems that include Oracle Fusion Cloud Applications, Anaplan and many other tools, automate finance processes and maintain our financial Applications.\nWhat you’ll do\nWork on Finance Systems including Oracle Financials Cloud Applications and Anaplan\nMaintain Oracle Cloud Applications, including -\nChange management\nUser security\nProduct configuration, including controls\nData protection & integrity\nReports management\nPatch Upgrades\nMonitor scheduled jobs\nData sync between Oracle cloud applications\nPartner with Accounting & Finance teams and support critical Month / Quarter End close\nSupport new modules or features implemented by Project team\nCreate and maintain standards, procedures, and documentation related to areas of responsibility\nParticipate in system audits and perform testing for disaster recovery or SOX controls\nAdminister access to Systems within approved IT security policies, guidelines, and standards\nAutomate manual finance processes\nWho you are\nBachelor's Degree or an Associate Degree with 6-8 years of work experience. \n5+ years of Oracle Financial Applications (EBusiness Suite / Fusion) experience as a techno functional resource\nKnowledge of finance operational processes, particularly period close & audit functions \nExperience in all phases of delivery lifecycle\nExcellent Communication, Interpersonal, Analytical skills and strong team collaboration\nCritical thinking, analysis, and a curiosity to dig deeper into requests to determine needs\nProven ability to deal with ambiguity in a rapidly changing business environment, resolve problems and offer impacting solutions\nAble to independently manage and prioritize workload and projects\nMinimum requirements\nHands-on Experience with Oracle Fusion Cloud Applications\nExperience with Oracle Account Reconciliation Cloud (ARCS), Financial Close and Consolidation (FCCS)\nExperience working with FAH (Fusion Accounting Hub) module\nExperience with reporting using OTBI & Finance Reporting Studio in Oracle Fusion Cloud environment \nData literacy & some w product integration",
    "job_link": "https://stripe.com/jobs/listing/business-systems-architect-financial-systems/6379820",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:52:02.469858"
  },
  {
    "title": "Capital Markets, Treasury Finance",
    "location": "New York",
    "experience_required": null,
    "job_description": "Who we are\nAbout Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies—from the world’s largest enterprises to the most ambitious startups—use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone's reach while doing the most important work of your career.\nAbout the team\nProduct Capital Markets Team\nStripe’s Product Capital Markets team within Capital Markets is responsible for building and executing the funding strategy for our Capital loans and other financial products. We partner closely with Stripe's engineering, data science, risk, product, and servicing teams to develop creative solutions to optimize our funding channels. We liaise with cross-functional partners across accounting, finance and strategy and tax to execute on our roadmap. \nWhat you’ll do\nWe’re looking for a creative, smart, and driven individual to execute on our funding strategy. Candidates should have broad experience with financing transactions, acquired either working at a bank or a fintech, as well as experience managing investor relationships and working with alternative lenders. The candidate should be curious and open to learning other capital markets areas, such as risk management, investments or corporate financing. The ideal candidate will have strong technical and interpersonal skills, and the desire to work closely with both internal and external stakeholders.\nIf you are interested in joining a fast-growing organization and applying your experience to shape the future of Stripe, we encourage you to apply.\nResponsibilities\nBuild and maintain relationships with investors, providing financing for merchant loans and other capital products.  Manage ongoing investor communications and information requests\nCoordinate with investors, lending partners and financing counterparties throughout the onboarding phase, and drive due diligence and internal review processes\nDevelop and update marketing materials for use with prospective investors\nBuild and monitor dashboards and reports to track sales, performance statistics and adherence to contractual requirements\nReview and assist in the development of transaction documents in collaboration with legal teams\nCoordinate across Product, Finance & Strategy, and Credit/Risk teams to drive Capital Markets initiatives\nSupport as needed other Capital Markets projects and initiatives\nWho you are\nWe're looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. The preferred qualifications are a bonus, not a requirement.\nMinimum requirements\n5+ years of exposure to debt capital markets at an ABS issuer (including online lending platforms), an investment bank (FIG/Fintech advisory or ABS banking/trading role), alternative lender, hedge fund, asset manager, rating agency, or law firm structuring and executing ABS financing transactions, including warehouse facilities, loan sales / forward flow, and/or securitizations\nAbility to think creatively and critically and thrive in a fast-paced and often ambiguous work environment\nClear communicator with strong cross-functional collaboration skills \nExcellent analytical skill; ability to leverage data insights into a dynamic narrative \nProject management capability and high attention to detail\nBachelor’s degree\nPreferred qualifications\nExperience with SQL or Python or additional background managing liquidity investments is a plus",
    "job_link": "https://stripe.com/jobs/listing/capital-markets-treasury-finance/5924235",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:52:04.018347"
  },
  {
    "title": "Channel Sales Executive, SaaS Platforms",
    "location": "Atlanta",
    "experience_required": null,
    "job_description": "About Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies - from the world’s largest enterprises to the most ambitious startups - use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. \nAbout the team\nWe are looking for a high potential candidate to join Stripe’s Alliances and Channels (A&C) team as a Channel Sales Executive. The Channel Sales Executive (CSE) is a key part of the Alliances and Channels team, supporting platform partners that embed Stripe technology into their solutions.\nWhat you'll do\nWe are seeking a dynamic Channel Sales professional to drive business growth with a portfolio of SaaS Platforms. You will identify high-value opportunities, develop demand with these platforms, and foster new business within our partner ecosystem. Working closely with Partner Development Managers and Stripe Account Executives, you will be responsible for delivering incremental growth of new users and revenue through your portfolio. \nResponsibilities\nDrive joint go-to-market and co-selling initiatives with a designated and diverse portfolio of SaaS platforms in a channel sales motion.\nCollaborate with platform counterparts to drive net new demand for partnerships.\nEnable Stripe and partner sales teams on the joint value proposition and lead account mapping workshops.\nDevelop and execute sales strategies to expand Stripe’s revenue with strategic platforms through.\nSupport the full deal cycle with partners, from sourcing new pipeline, opportunity progression to closing.\nServe as an advocate for partners within Stripe, representing Stripe within the partner's organization.\nMaintain accurate sales and partner activities in Salesforce. \nWho you are\nWe're looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply.\nMinimum requirements\n5+ years of technology sales experience with a proven track record of exceeding sales targets.\nExperience with the payments, commerce, and/or Q2C landscape.\nSales experience working in multi-party sales pursuits.\nExcellent communication and presentation skills, with the ability to speak to functional leadership both internally and externally.\nAbility to lead and be a team player on cross-functional deal pursuit teams.\nWillingness to travel (25%)\nAbility to build and execute territory and opportunity-specific plans leveraging tools such as Salesforce and Crossbeam.",
    "job_link": "https://stripe.com/jobs/listing/channel-sales-executive-saas-platforms/7172784",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:52:05.576351"
  },
  {
    "title": "Channel Sales Executive, SaaS Platforms",
    "location": "Dublin HQ",
    "experience_required": null,
    "job_description": "Who we are\nAbout Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies - from the world’s largest enterprises to the most ambitious startups - use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. \nAbout the team\nWe are looking for a high potential candidate to join Stripe’s Alliances and Channels (A&C) team as a Channel Sales Executive. The Channel Sales Executive (CSE) is a key part of the Alliances and Channels team, supporting platform partners that embed Stripe technology into their solutions.\n What you'll do\nWe are seeking a dynamic Channel Sales professional to drive business growth with a portfolio of SaaS Platforms. You will identify high-value opportunities, develop demand with these platforms, and foster new business within our partner ecosystem. Working closely with Partner Development Managers and Stripe Account Executives, you will be responsible for delivering incremental growth of new users and revenue through your portfolio. \nResponsibilities\nDrive joint go-to-market and co-selling initiatives with a designated and diverse portfolio of SaaS platforms in a channel sales motion.\nCollaborate with platform counterparts to drive net new demand for partnerships.\nEnable Stripe and partner sales teams on the joint value proposition and lead account mapping workshops.\nDevelop and execute sales strategies to expand Stripe’s revenue with strategic platforms through.\nSupport the full deal cycle with partners, from sourcing new pipeline, opportunity progression to closing.\nServe as an advocate for partners within Stripe, representing Stripe within the partner's organization.\nMaintain accurate sales and partner activities in Salesforce. \nWho you are\nWe're looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply.\nMinimum requirements\n5+ years of technology sales experience with a proven track record of exceeding sales targets.\nExperience with the payments, commerce, and/or Q2C landscape.\nSales experience working in multi-party sales pursuits.\nExcellent communication and presentation skills, with the ability to speak to functional leadership both internally and externally.\nAbility to lead and be a team player on cross-functional deal pursuit teams.\nWillingness to travel (25%)\nAbility to build and execute territory and opportunity-specific plans leveraging tools such as Salesforce and Crossbeam.",
    "job_link": "https://stripe.com/jobs/listing/channel-sales-executive-saas-platforms/7179677",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:52:07.409654"
  },
  {
    "title": "Communications Operations Lead",
    "location": "Chicago",
    "experience_required": null,
    "job_description": "Who we are\nAbout Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies - from the world’s largest enterprises to the most ambitious startups - use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone's reach while doing the most important work of your career.\nAbout the team\nStripe’s comms organization does more than the traditional: we produce films that get shown at festivals, sell over 300,000 books annually, run some of the fastest growing social media channels in tech, write talks and skits for external and internal events attended by thousands of people, build physical machines that track commerce in real-time, create podcasts in pubs, and much more besides. We believe in small, elite, high-taste teams and aim to run a tight operation. \nWhat you’ll do\nIn this new role, we’re looking for someone to lead our small comms operations group, to help us keep pushing creativity while driving equal excellence when it comes to operational rigor and efficiency. This is not a typical operations role, and we’re not looking to introduce heavy process or to eliminate unpredictability. \nYou’ll be operationally ambidextrous: excited by both creativity and the pursuit of operational excellence\nYou’ll have deep experience building structures, processes, and tools for creative groups, for example as a COO in an agency or as an operations lead within an equally ambitious company\nYou’ll be detail-oriented and hands-on when it comes to process design, and understand the ways in which small nuances totally change how these processes work in practice\nYou’ll have experience of a range of different ways to allocate resources, build operational plans, and measure impact, but will be a first principles thinker excited to figure out what’s right for Stripe\nYou’ll be a lifelong student of group dynamics, with a toolkit of techniques to run planning sessions, brainstorms, and other ways to surface novel ideas and build cohesive teams\nYou’ll be a proven manager, including of early-career talent\nYou’ll enjoy advising, debating, and developing perspectives together with company leadership. We’re figuring this out together\nResponsibilities \nPartner closely with the Head of Comms and the communications leadership team to drive strategy, operations and planning across the organization\nOversee the efficient running of the communications organization. Create processes and conditions that enable the comms teams to do their best work, efficiently\nPartner closely with the finance, people, and partner teams to drive planning processes including investment decisions, strategy updates, operational plans, targets and goals (OKRs), and build our model for resource allocation and impact evaluation\nLead our exploration and creation of new AI tools\nWrite clear and concise internal documents, slides, emails, and Slack messages to summarize plans, priorities and results to drive alignment, inform, and lead change with effective communication\nBring rapid clarity to ambiguous situations, resolve them effectively, communicate decisions efficiently, and enable teams to move towards implementing solutions \nYou’ll fine-tune our processes and invent new ones, develop and coach our operations team\nWho you are\nWe're looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. The preferred qualifications are a bonus, not a requirement.\nMinimum requirements\n10+ years of work experience\n5+ years of experience in a combination of program management, product management, business operations, strategy and operations, finance, and consulting\n3+ years of working directly with C-level executives and their direct reports\n3+ years of people management experience\nProven track record of defining and executing complex programs with global teams across multiple functions\nEffective communicating at all levels of an organization from executives to project teams\nExcellent written and verbal communication skills, with the ability to establish strong relationships with stakeholders and senior leaders\nA strong operator with experience making sound, data-driven decisions\nThrive in solving ambiguous problems and see opportunities where others see chaos\nRelentless focus on users and solving for their needs and wants",
    "job_link": "https://stripe.com/jobs/listing/communications-operations-lead/7164002",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:52:08.970077"
  },
  {
    "title": "Community Communications, Product/Developer",
    "location": "New York",
    "experience_required": null,
    "job_description": "Who we are\nAbout Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies - from the world’s largest enterprises to the most ambitious startups - use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone's reach while doing the most important work of your career.\nAbout the team\nWe’re looking for someone to join our small—and extremely online—Community Communications team, which manages Stripe’s social media channels and fosters community among our users. We work closely with product managers, engineers, and program leads to augment launches and announcements, increase awareness of products and features, and tell the stories of the companies building on Stripe.\nWhat you’ll do\nWe’re looking for a high-agency community-builder to further strengthen the network of startups and developers building on Stripe. The ideal candidate is allergic to #brands, feeling much more at home building authentic relationships with users, and creating scrappy demos to help them see and feel the power of our products. Day to day, the Community Comms Product/Developer lead will be responsible for enriching our network of startups and developers, keeping them keenly updated on what we’re building, and bringing their feedback and ideas back into Stripe to improve our products and processes.\nResponsibilities\nWrite and execute strategies to amplify product news and announcements for our startup and developer community via social channels, primarily X.\nEmbed deep within that community, building trusted, long-term relationships with startups and developers.\nMine within Stripe for stories and nuggets likely to enhance awareness, understanding or rapport in our community.\nBecome a conduit for feedback and advice on our products, routing suggestions to the relevant teams within Stripe.\nCreate and commission social content (e.g. videos, GIFs, demos) that aid awareness and/or understanding of our products.\nConjure internet-breaking moments and artifacts to send the community wild and draw focus to specific products or programs.\nTake accountability for iterative progress and improvement in all of the above.\nWho you are\nWe're looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. The preferred qualifications are a bonus, not a requirement.\nMinimum requirements\n7+ years of relevant work experience\nExperience in community building, social, or communications, preferably in tech\nAn extremely punchy social copywriter—with an ability to grasp the Stripe voice and tone\nExperience writing for thoughtful, engaged, high agency audiences\nCreative flair and an aversion to the hackneyed and obvious\nA sharp eye for design\nA passion for X and YouTube and an unusual interest in the intricacies of their cultures and dynamics\nExceptional judgment and ability to navigate ambiguity\nYou move with urgency; comfortable turning things around on tight timetables and pivoting quickly in response to new data\nPreferred qualifications\nAn excellent understanding of Stripe's technology and the developer community we are building for\nA basic or hobbyist understanding of coding\nAlready embedded in the startup and developer community on X\nHighest quality bar of anyone you know when it comes to great writing, stories, and content\nYour first instinct with new ideas or content is to test them with the people they reach\nA track record of planning and running creative, complex, data-driven campaigns, plus experience working closely with marketing and design team",
    "job_link": "https://stripe.com/jobs/listing/community-communications-product-developer/6831875",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:52:10.288728"
  },
  {
    "title": "Compensation Partner, Product & Engineering",
    "location": "South San Francisco HQ",
    "experience_required": null,
    "job_description": "Who we are\nAbout Stripe\nStripe is a financial infrastructure platform for businesses. Millions of companies—from the world’s largest enterprises to the most ambitious startups—use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone’s reach while doing the most important work of your career.\nAbout the team\nStripe's Compensation Team plays a pivotal role in driving the company's people strategy. As strategic partners to the business, we strive to demystify compensation programs and processes, enabling Stripes to focus on their core responsibilities. We take pride in our ability to design and implement compensation offerings that not only attract top-tier talent but also foster long-term engagement and retention. Our work ensures that Stripe remains competitive in the global talent market, empowering the organization to build and maintain a world-class workforce dedicated to advancing Stripe's ambitious goals.\nWhat you’ll do\nThe Compensation Partner, Product & Engineering will be responsible for the implementation and integration of our compensation strategy. Ideally, this person thrives in a fast-paced environment and naturally operates with a strategic mentality and an orientation towards problem-solving. They will closely partner with cross-functional teams, and align Stripe’s compensation philosophy with business strategy.\nResponsibilities\nImplement Stripe’s rewards philosophy and principles in compensation related decisions and processes\nAct as a strategic partner to HR Business Partners, Recruiters, Managers, and the Executive team on all compensation matters\nConduct analyses of market data in order to ensure compensation ranges are aligned to market and supporting the company’s people strategy\nBe data driven and stand for objectivity, independent decision taking, utmost credibility, and trustworthiness\nEnsure Stripe’s compensation programs are well communicated and understood across leadership, management, and individual contributors \nWho you are\nWe’re looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply.\nRequirements\nAt least 5+ years of work experience in developing and managing global compensation programs and processes for both public and private companies, preferably in a high-growth, scaling, technology environment\nA strong understanding of compensation best practices, current compensation trends, and market benchmark data\nApplies user-centered design principles to deliver improved processes and experiences\nProven analytical skills, keen eye for detail, and have truly in-depth knowledge of Excel/Google Sheets including building and maintaining complex models\nThe ability to communicate across diverse groups with clear, approachable, and collaborative style\nStrong influencing skills with the ability to communicate clearly and confidently when advising senior leaders\nA deep commitment to excellent customer service, empathy, and discretion\nCan balance multiple, sometimes conflicting priorities; approaching challenges with a positive, solution-oriented attitude",
    "job_link": "https://stripe.com/jobs/listing/compensation-partner-product-engineering/7203552",
    "posted_date": "Not specified",
    "company": "Stripe",
    "scraped_at": "2025-09-11T02:52:11.715602"
  }
]