[
  {
    "title": "Delivery Advisor - Mumbai/ Delhi",
    "location": "Not specified",
    "experience_required": null,
    "job_description": "Job description\nThe Role: \n\nTaking delivery of a Tesla is a milestone moment for customers, and the Delivery Advisor plays a crucial role in ensuring a seamless and engaging experience. Acting as the primary point of contact for customers post-sale, the Delivery Advisor is responsible for coordinating delivery scheduling, customer education, and final documentation. This role ensures that customers receive all necessary information about their new vehicle, guiding them through the features and onboarding process.\n\nResponsibilities:\n\nCustomer Engagement & Scheduling:\nAct as the primary liaison between Tesla and customers from the point of purchase to vehicle handover.\nCoordinate delivery scheduling based on vehicle readiness and customer availability.\nEnsure customers complete all pre-delivery requirements, including financing, registration, and trade-ins.\n\nCustomer Education & Training:\nConduct vehicle walkthroughs, explaining key features and functionality to ensure a smooth onboarding experience.\nGuide customers on Tesla’s digital ecosystem, including the Tesla app, charging solutions, and vehicle software updates.\n\nDelivery Execution & Administration:\nOversee and coordinate administrative tasks at the delivery center, ensuring all required documentation is prepared and processed accurately.\nWork cross-functionally with Sales, Logistics, and Registration teams to verify order details and ensure compliance with internal policies.\nRecord and maintain data quality across internal systems.\n\nPost-Delivery Support & Issue Resolution:\nServe as the primary contact for customers post-delivery, addressing initial questions and troubleshooting minor concerns.\nWork with the Service team to facilitate any early-stage support needs.\n\nRequirements:\n\n3+ years of relevant experience in customer service, automotive sales, or logistics.\nStrong organizational and communication skills, with a customer-first mindset.\nAbility to multitask and work in a fast-paced environment.\nExcellent attention to detail and problem-solving skills.\nComfortable working with multiple systems and tools to manage orders and deliveries.\nPrior automotive or registration experience is a plus.\nBusiness proficiency in English and local languages.\nValid driver’s license holder.\nBachelor’s degree preferred",
    "job_link": "https://hire-r1.mokahr.com/social-recruitment/tesla/100004142#/job/2a9abea0-b18c-42df-be0f-2b7e70d4aac3",
    "posted_date": "Not specified",
    "company": "Tesla",
    "scraped_at": "2025-09-11T02:52:45.067591"
  },
  {
    "title": "Service Advisor - Delhi",
    "location": "Delhi, India",
    "experience_required": null,
    "job_description": "Job description\nTesla is looking for an experienced Service Advisor to work on one of the most progressive vehicle brands in the world. This position requires a high level customer and employee interaction, so the ideal candidate will not only possess the technical acumen, but also the ability to provide a strong level of customer service. \n\nResponsibilities:\n·         Answer Phone Calls, Emails and Drive In’s to address any customer concern with the highest level of response and attention\n·         Return missed phone calls, email within shortest possible time\n·         Determine if technical solution can be resolved over the phone; escalate immediately to Shop Foreman / Service Manager to provide immediate attention\n·         Accurately record issues and data into system. Attention to detail critical\n·         Conduct Transactions w/ system; walk customer through correction and provide summary.\n·         Communicate estimated completion time, regular updates and follow through on each customer vehicle.\n·         Coordinate the detail of every vehicle prior to delivery.\n·         Coordinate the delivery time or pick up with each customer.\n·         Follow up with Customer on services provided; ensure they are satisfied with the work performed. \n\nRequirements:\n·         Methods, techniques, parts, tools and materials used in the maintenance and repair of vehicles\n·         Operation and maintenance of a wide variety of hand power tools, shop tools, and automotive and electrical test equipment\n·         Understanding of basic automotive techniques related to repair and servicing of automobiles\n·         Ability to follow oral and written instructions with attention to detail\n·         Willingness to learn new and innovative automotive technologies\n·         Establish and maintain cooperative working relationships with those contacted in the course of work to include the public\n·         Perform detailed daily record keeping and reporting\n·         Effectively handle multiple priorities, organize workload, and meet deadlines\n·         Work in a team-based environment and achieve common goals\n·         Dealer Management System(s), Outlook, and MS Office\n·         Associate Degree or certificate in Automotive Technology, preferred\n·         Retail automotive service experience, preferred\n·         Fluency in English and local languages\n·         Work Location: Delhi",
    "job_link": "https://hire-r1.mokahr.com/social-recruitment/tesla/100004142#/job/1865c111-fd38-4380-b890-46160389d713",
    "posted_date": "Not specified",
    "company": "Tesla",
    "scraped_at": "2025-09-11T02:52:50.654864"
  },
  {
    "title": "Service Advisor - Mumbai",
    "location": "Mumbai, India",
    "experience_required": null,
    "job_description": "Job description\nTesla is looking for an experienced Service Advisor to work on one of the most progressive vehicle brands in the world. This position requires a high level customer and employee interaction, so the ideal candidate will not only possess the technical acumen, but also the ability to provide a strong level of customer service. \n\nResponsibilities:\n·         Answer Phone Calls, Emails and Drive In’s to address any customer concern with the highest level of response and attention\n·         Return missed phone calls, email within shortest possible time\n·         Determine if technical solution can be resolved over the phone; escalate immediately to Shop Foreman / Service Manager to provide immediate attention\n·         Accurately record issues and data into system. Attention to detail critical\n·         Conduct Transactions w/ system; walk customer through correction and provide summary.\n·         Communicate estimated completion time, regular updates and follow through on each customer vehicle.\n·         Coordinate the detail of every vehicle prior to delivery.\n·         Coordinate the delivery time or pick up with each customer.\n·         Follow up with Customer on services provided; ensure they are satisfied with the work performed. \n\nRequirements:\n·         Methods, techniques, parts, tools and materials used in the maintenance and repair of vehicles\n·         Operation and maintenance of a wide variety of hand power tools, shop tools, and automotive and electrical test equipment\n·         Understanding of basic automotive techniques related to repair and servicing of automobiles\n·         Ability to follow oral and written instructions with attention to detail\n·         Willingness to learn new and innovative automotive technologies\n·         Establish and maintain cooperative working relationships with those contacted in the course of work to include the public\n·         Perform detailed daily record keeping and reporting\n·         Effectively handle multiple priorities, organize workload, and meet deadlines\n·         Work in a team-based environment and achieve common goals\n·         Dealer Management System(s), Outlook, and MS Office\n·         Associate Degree or certificate in Automotive Technology, preferred\n·         Retail automotive service experience, preferred\n·         Fluency in English and local languages\n·         Work Location: Mumbai",
    "job_link": "https://hire-r1.mokahr.com/social-recruitment/tesla/100004142#/job/4f2f8a63-d78e-48b8-84c6-a1e0a2784350",
    "posted_date": "Not specified",
    "company": "Tesla",
    "scraped_at": "2025-09-11T02:52:56.075227"
  },
  {
    "title": "Consumer Engagement Specialist - Delhi",
    "location": "Delhi, India",
    "experience_required": null,
    "job_description": "Job description\nWhat to Expect\nTesla is looking for a Consumer Engagement/ Leads Generation Specialist to support the marketing organization with various responsibilities including content creation, lead generation and retail marketing events in India. Our ideal candidate is a self-starter with strong communication (both verbal and written), negotiation and execution skills.\n\nWhat You’ll Do\nWork with the team to develop targeted marketing plans with a coherent integration of marketing tactics, event and activities to achieve business goals.\nAssist in the development, management and implementation of a comprehensive event calendar with centralized tracking of all regional marketing events including test drive events, lead generation events, brand partnership events and external corporate events (e.g. auto shows and product launches).\nAssist in the planning of regional activities including store openings, test drives and lead generation events.\nAssist in the development of in-store programs and campaigns to engage existing leads and create new leads.\nEvaluate and track the success of programs and campaigns.\nAssist in project management and initial content creative for external newsletters, collateral and customer communication (i.e. emails and letters).\nAssist in inbound and outbound communications including customer letters and email for relevant marketing inboxes.\nWork with communications team on consistent and effective messaging of external documents and promotional materials to support our marketing activities (e.g. collateral)\nManage outside agencies and vendors on a needed basis.\nEffectively deliver results of marketing objectives within the designated and agreed budgets.\nEnsure compliance with global brand strategy and corporate identity for Tesla Motors.\nAssist in project management and initial content creative for external newsletters, collateral and customer communication (i.e. emails and letters).\n\nWhat You’ll Bring\nMinimum 5 years+ in digital integrated marketing and communication, relevant experience in Event Marketing is preferred\nExperience in managing social media account and also ability in Adobe design suites, PowerPoint, IOS, Photoshop will be a plus\nExcellent communication skills and fluency in English and other local languages\nMaintain a high sense of urgency and entrepreneurial work ethic that is required to drive business outcomes\nExceptional strategic thinker and analytical skills; ability to address cross-functional and cross-organizational issues independently\nHighly organized with the ability to manage multiple projects while meeting deadlines.\nResult driven, hands-on, positive “can do” attitude, passionate and able to show commitment and to inspire others\nProven ability to work in a fast-paced, dynamic and deadline-oriented environment\nLarge company discipline with small company entrepreneurial attitude\nStrategically planning with strong execution and negotiation skills\nAsset management experience/ Good negotiation skills\nDigital Agency management/ Online to Office event coordination experience is preferred",
    "job_link": "https://hire-r1.mokahr.com/social-recruitment/tesla/100004142#/job/c67d0404-5510-4bbf-8ab4-183402bb9488",
    "posted_date": "Not specified",
    "company": "Tesla",
    "scraped_at": "2025-09-11T02:53:02.742302"
  },
  {
    "title": "Senior HR Partner/ HR Manager",
    "location": "Mumbai, India",
    "experience_required": null,
    "job_description": "Job description\nThe Role:\n\nWe are looking for an experienced Senior HR Partner or HR Manager to support our operation in our new market India, this role is ideally based in Mumbai and oversee our business in different states. The HR Partner drives our mission by working with leaders and employees across the business to ensure Tesla is a great place to work for everyone. Our team achieves results by being driven, innovative, collaborative and trustworthy. This role is both hands-on and strategic and provides expertise in the areas of employee relations, performance management, compensation and benefits, employee engagement, learning and development, and ad hoc projects as necessary. Tesla’s HR Partners are passionate about their work and help deliver positive change every day.\n\nResponsibilities:\n\nBe a leader and credible activist for your clients, your team and our mission; exert influence to create positive change\nDeliver both strategic and tactical HR support and programs to employees and managers, including performance management, organizational design, learning and development, compensation programs and employee relations\nPartner effectively with HR centers of excellence including Immigration, Compensation and Benefits, Tesla Talent and Employee Relations\nProactively identify opportunities to enhance the employee experience and partner with management to develop and implement innovative and sustainable solutions\nWork with leaders to develop effective organizational structures to drive organizational health\nConsult and coach all levels of management to build and serve high performing, diverse and inclusive teams\nBuild credibility and trust among employees; resolve employee concerns with compassion and follow-through\nConsult and advise on talent reviews and the annual merit planning cycle\n\n\nRequirements:\n\n8+ years’ experience in a HR Business Partner or other HR role including coaching, employee relations, recruiting, compensation, training & HR project management or program implementation\nExperience objectively coaching employees and management through complex and difficult situations\nApplied knowledge of federal, state and local laws and statutes for employment. Thorough understanding and hands-on application of internal and external HR principles, concepts, practices and standards\nDemonstrated experience in organizational development and change management is a plus\nResourceful and self-motivated with ability to work in changing environments\nStrong analytical and problem-solving skills; ability to assess situations and make decisions based on data while drawing from previous experience\nDemonstrated experience with coaching employees and management through complex and difficult issues\nDemonstrated ability to effectively partner and collaborate with all levels of the organization and positively influence teams\nProven organizational skills, attention to detail, and ability to handle multiple tasks\nStrong written and verbal communication in English and other local languages",
    "job_link": "https://hire-r1.mokahr.com/social-recruitment/tesla/100004142#/job/4a8315bd-251b-494d-91ad-b5aaad087ea5",
    "posted_date": "Not specified",
    "company": "Tesla",
    "scraped_at": "2025-09-11T02:53:08.581450"
  },
  {
    "title": "Parts Advisor - Delhi",
    "location": "Delhi, India",
    "experience_required": null,
    "job_description": "Job description\nTesla is looking for an experienced Parts Advisor to work on one of the most progressive vehicle brands in the world. This position requires a significant amount of customer interaction, so the ideal candidate will not only possess the customer service acumen, but also the ability to provide a basic level of technical support service. If you are interested in becoming a part of a world class service team supporting the latest EV technology, we are interested in hearing from you.\n\nResponsibilities\nReceive stock, pick, ship and transact materials inventory to support the needs of vehicle service.\nAccurately record parts transactions and data into Dealer Management System – attention to detail critical.\nConduct transactions w/ systems; walk customer through order and provide summary.\nEscalate any issues that need to be addressed to correct any inbound packaging issues from our internal and external suppliers.\nMaintain records of time, expenses, and materials.\nCommunicate estimated parts ship and arrival time, including regular updates.\nFollow up with customer on parts order and ensure complete satisfaction with the order.\nPerform other related duties as assigned.\nHelp maintain cleanliness of service center.\nEffectively handle multiple priorities, organize workload, and meet deadlines.\n\nRequirements\nDegree or Certificate from a University program in Automotive Technology a plus or the equivalent in experience and evidence of exceptional ability\nMethods, techniques, parts, tools and materials used in the maintenance and repair of vehicles.  \nUnderstand in basic automotive techniques related to repair and servicing of automobiles.\nAutomotive equipment and servicing methods.\nDealer Business Process and Best Practice.\nDMS Systems, SAP, MS Office Suite.\n1-3 yrs experience in the automotive industry\n2-5 years material service and distribution experience.\nExcellent oral and written communication skills as well as the ability to follow instructions required.\nAbility to establish and maintain cooperative working relationships with those contacted in the course of work, including the public.\nMaintain and perform top level professional integrity and appearance as a parts advisor.",
    "job_link": "https://hire-r1.mokahr.com/social-recruitment/tesla/100004142#/job/945ee481-d871-4bea-8b9e-6aaef4925b3d",
    "posted_date": "Not specified",
    "company": "Tesla",
    "scraped_at": "2025-09-11T02:53:14.132313"
  },
  {
    "title": "Parts Advisor - Mumbai",
    "location": "Mumbai, India",
    "experience_required": null,
    "job_description": "Job description\nTesla is looking for an experienced Parts Advisor to work on one of the most progressive vehicle brands in the world. This position requires a significant amount of customer interaction, so the ideal candidate will not only possess the customer service acumen, but also the ability to provide a basic level of technical support service. If you are interested in becoming a part of a world class service team supporting the latest EV technology, we are interested in hearing from you.\n\nResponsibilities\nReceive stock, pick, ship and transact materials inventory to support the needs of vehicle service.\nAccurately record parts transactions and data into Dealer Management System – attention to detail critical.\nConduct transactions w/ systems; walk customer through order and provide summary.\nEscalate any issues that need to be addressed to correct any inbound packaging issues from our internal and external suppliers.\nMaintain records of time, expenses, and materials.\nCommunicate estimated parts ship and arrival time, including regular updates.\nFollow up with customer on parts order and ensure complete satisfaction with the order.\nPerform other related duties as assigned.\nHelp maintain cleanliness of service center.\nEffectively handle multiple priorities, organize workload, and meet deadlines.\n\nRequirements\nDegree or Certificate from a University program in Automotive Technology a plus or the equivalent in experience and evidence of exceptional ability\nMethods, techniques, parts, tools and materials used in the maintenance and repair of vehicles.  \nUnderstand in basic automotive techniques related to repair and servicing of automobiles.\nAutomotive equipment and servicing methods.\nDealer Business Process and Best Practice.\nDMS Systems, SAP, MS Office Suite.\n1-3 yrs experience in the automotive industry\n2-5 years material service and distribution experience.\nExcellent oral and written communication skills as well as the ability to follow instructions required.\nAbility to establish and maintain cooperative working relationships with those contacted in the course of work, including the public.\nMaintain and perform top level professional integrity and appearance as a parts advisor.",
    "job_link": "https://hire-r1.mokahr.com/social-recruitment/tesla/100004142#/job/3cef6747-b264-4c0b-a933-3dc923e88326",
    "posted_date": "Not specified",
    "company": "Tesla",
    "scraped_at": "2025-09-11T02:53:19.540592"
  },
  {
    "title": "Inside Sales Advisor",
    "location": "Mumbai, India",
    "experience_required": null,
    "job_description": "Job description\nThe Role \nThe primary focus of the Inside Sales Advisor team is responding to customer inquiries about the purchase of new vehicles in a timely and accurate manner. The  Inside Sales Advisor team will focus on Vehicle Configurations and will be working with existing Reservation holders to convert their reservation in to a production order.  The Inside Sales Advisor is responsible for these customer service activities in order to deliver top quality customer service and customer satisfaction.\n Responsibilities\n ·        \nRespond to all reservation and new ownership inquiries from multiple contact channels in a timely and accurate manner.\n·        \nWork with existing Reservation holders to convert their reservation in to a production order in order to achieve expected build, shipment and delivery objectives.\n·        \nConduct business dealings in a way that creates a superior prospect experience that represents the Tesla brand values.  \n·        \nUtilize a consistent contact process to follow-up, nurture, and close leads generated by marketing campaigns.\n·        \nAchieve company aims for vehicle order levels.\n·        \nMaximize and leverage phone time, including pre-call planning, and adhere to activity metrics.\n·        \nKeep up with industry trends and best practices, including utilization of new technology and web resources.\n·        \nWork with the technical departments to understand current vehicle and production talking points.\n·        \nUtilize, update and maintain the integrity of information in Tesla’s CRM system.\n·        \nProvide suggestions for website improvements.\n·        \nEscalate matters that require senior management concurrence in a timely manner to line management.\n·        \nWork on the continuous improvement of processes and procedures related with the purchase of a Tesla.\n  Requirements\n ·        \nStrong team-player.\n·        \nExcellent Communication and relationship management skills, both oral and written.\n·        \nAbility to prioritize effectively and handle shifting priorities.\n·        \nAttention to quality and detail.\n·        \nValid driving license.\n·",
    "job_link": "https://hire-r1.mokahr.com/social-recruitment/tesla/100004142#/job/09cecfa0-f1cd-4f10-a4ef-f390276647d5",
    "posted_date": "Not specified",
    "company": "Tesla",
    "scraped_at": "2025-09-11T02:53:25.166638"
  },
  {
    "title": "Customer Support Specialist",
    "location": "Mumbai, India",
    "experience_required": null,
    "job_description": "Job description\nThe Role\nThe primary goal of Customer Support Specialist is to ensure Tesla meets its obligations and commitments by responding to Customer inquiries in an accurate and timely manner. The Customer Support team develops and maintains excellent working relationships with Tesla Owners and various internal departments to carefully and effectively address customer support concerns. The ideal candidate will not only possess the technical acumen, but also the ability to provide a strong level of customer service. Located in Mumbai, India this position requires collaboration with Tesla Sales, Vehicle Service and Executive Staff to proactively improve the owner experience for a rapidly growing customer base in our newest  market.\n\nResponsibilities\n\nDeliver highest level of customer support by answering inbound calls and emails, on technical support and roadside assistance related enquiry in a 7*24*365 environment\n        Educate our owners so they have optimal confidence in the operation of their vehicle\n\nProvide workable technical solutions in a professional manner, exceed customer expectation, ensure every aspect of ownership is a true pleasure\n       Communicate or escalate owner’s concern to relevant parties for further follow up whenever necessary\n Accurately record issues and data into CRM/ Vehicle Support Systems\n           \nRequirements\n·        \nMin. 2 years Technical Support/ call center experience in automotive industry is preferable\n       Flexible, proactive, attention to details, eager to contribute with strong common sense\n        Organize, sense of priority, adapt to work in a high pressure and fast pacing environment\n        Accept 7*24*365 shifts to accommodate customer’s needs\n        Establish and maintain positive, respect, cooperative working relationships\n        Willingness to learn new and innovative automotive technologies\n        Understanding of basic automotive techniques would be an added advantage\n        Familiar with Customer Management Systems-Outlook, and MS Office Suite\n\nLanguages Requirements\n        Fluent English and other local languages",
    "job_link": "https://hire-r1.mokahr.com/social-recruitment/tesla/100004142#/job/0e157d30-b8e6-43f1-bc99-daf7c87e2d20",
    "posted_date": "Not specified",
    "company": "Tesla",
    "scraped_at": "2025-09-11T02:53:30.562340"
  },
  {
    "title": "Supplier Industrialization Engineer – Electronics",
    "location": "Pune, India",
    "experience_required": null,
    "job_description": "Job description\nTesla's Electronics Supplier Industrialization Engineering team plays a crucial role in developing and qualifying critical component and electronic part top-level assembly processes with our suppliers. We provide regional support for New Product Introduction (NPI) and legacy product management within the supply chain. This encompasses everything from early supplier sourcing assessments (in collaboration with the Tesla sourcing and design teams) and make-sourcing decisions, to industrialization and quality control activities. This position demands excellent communication skills, strong supplier management expertise, a willingness to travel domestically and internationally, and the ability to make critical decisions in time-sensitive situations. The role supports a diverse product portfolio, including low/high voltage products, controllers, audio and sensing projects, and optical lens and camera projects.\n\nResponsibilities\n\nSupport Design for Manufacturing (DFM) principles during early product development, providing valuable feedback to NPI SIE (Supplier Industrialization engineer) and design teams.\nConduct onsite supplier audit and provide assessment for sourcing decision, develop new suppliers to meet Tesla sourcing requirements.\nDrive continuous improvement in supplier scalability, cost, and quality performance.\nManage and optimize supplier On-Time Delivery (OTD) performance.\nOversee supplier production capacity and operations management.\nFacilitate clear communication of technical requirements between suppliers and Tesla's GSM, SIE, and Design teams.\nConduct supplier audits to ensure compliance with part performance, delivery, and reliability expectations.\nCollaborate with Tesla supply chain teams to establish optimal performance specifications and supplier metrics.\nLead, track, and improve supplier manufacturing process development and launch readiness for new products and design changes.\nManage and enhance production and product quality. Guide suppliers in developing robust processes and procedures for efficient, high-quality product manufacturing.\nFollow up and drive SCAR (supplier corrective actions review) with supplier. Validate supplier corrective actions for design and/or process changes, ensuring they are sustainable and implemented across manufacturing lines and suppliers to prevent recurrence.\nContribute to the evaluation of new or alternative materials for improved design, manufacturability, or cost reduction.\n\nRequirements\n\nMinimum 5 years of experience in supply chain or mechanical engineering; experience with Printed Circuit Board Assemblies (PCBAs), Printed Circuit Boards (PCBs) and PCBA top-level assemblies (TLAs) is highly preferred.\nBS degree in Electrical, Mechanical, Industrial, or Manufacturing Engineering, or demonstrable equivalent experience and exceptional ability.\nProven experience with Design for Manufacturing (DFM) and Design for Assembly (DFA).\nPractical experience with Six Sigma methodologies; DAMIC experience is a plus.\nSolid hands-on experience of quality statistical analysis tools and applications (e.g., JMP, Minitab).\nStrong mechanical background, including statistical tolerance analysis, design quality assessment, and improvement techniques.\nProficiency in GD&T and 3D CAD software.\nDemonstrated supplier development and management skills.\nSelf-motivated and capable of working independently.\nHands-on and adaptable to a fast-paced environment.\nWillingness to travel domestically and internationally up to 50% of the time, often with short notice, to engage with Contract Manufacturers (CMs).",
    "job_link": "https://hire-r1.mokahr.com/social-recruitment/tesla/100004142#/job/c4ead4ac-a55c-4842-84a6-657ec34e576d",
    "posted_date": "Not specified",
    "company": "Tesla",
    "scraped_at": "2025-09-11T02:53:36.339654"
  },
  {
    "title": "Application Support Engineer",
    "location": "Not specified",
    "experience_required": null,
    "job_description": "Job description\nPosition:\n\nThe Application Support Analyst is responsible to provide successful implementation and management of Tesla services (applications) in the production environments and Provide Level II support to ensure the service meets the quality, security and compliance standards, providing the documentation for the ongoing support and maintenance of the systems.\n\n\nResponsibilities:\n\nResponsible for working in shifts to provide 24X7 Application Support across multiple Tesla applications.\nResponsible for applying operation break fixes and other proactive maintenance activities to keep the services up and running.\nDatabase Experience with advanced SQL Skills\nResponsible for evaluating the Issues reported by Tesla internal users and clients and providing ongoing solutions.\nResponsible for owning a specific production problem and provide active coordination between various groups including internal and external vendor support groups in resolving a specific problem.\nDetermine configuration and operational requirements for development team.\nParticipate and determine root cause for service failure and support escalation.\n\nRequirements:\n\nDesign and develop high quality, scalable and stable web applications and/or backend services using .NET with C#.\nDevelop client-side applications that connect with web services.\nDevelop back-end web services. \nEnsure highest standards met for security-best practices in all development using principles of Software design, algorithm development, data structures, code modularity and maintainability. \nPartner closely with security team for code analysis and design reviews using .NET Framework, .NET Core, package management, and dependency injection. \nPerform unit testing; process bug reports and release fixes; and participate in code reviews and Agile processes.\nGood verbal and written communication skills is preferred.\nBachelor of Science Degree in Engineering or equivalent in Computer Science or the equivalent in experience and evidence of exceptional ability",
    "job_link": "https://hire-r1.mokahr.com/social-recruitment/tesla/100004142#/job/3868c159-3050-465a-a882-20d5d6ad99ea",
    "posted_date": "Not specified",
    "company": "Tesla",
    "scraped_at": "2025-09-11T02:53:41.847416"
  },
  {
    "title": "Software Engineer - IT Application",
    "location": "Not specified",
    "experience_required": null,
    "job_description": "Job description\nPosition:\n\nAs a Software Engineer, you will take part in the design and development of software for the current and next generation of Tesla’s Enterprise Resource Planning systems. In this role, you’ll be developing highly complex applications with a goal of streamlining business operations while improving overall user experience. The ideal candidate is a self-starter with a strong desire to increase efficiencies and make an impact while contributing to a cross-functional team. Your ability to creatively collaborate and execute team goals will affect scalability and directly contribute to the company mission of accelerating the world’s transition to sustainable energy.\n\n\nResponsibilities:\n\n·    Work with engineers across many functional areas and deliver value to internal and external stakeholders. \n·    Design and develop new modules on the home-grown ERP application Warp which is used to plan, procure, and produce cars. \n·    Develop scalable solutions using tools like Angular, C#/.Net, MySQL and other open stack frameworks. \n·    Know your app! Seek to understand all aspects, business and technical, of the applications on which you work so you can be most effective. \n·    Contribute towards the timely completion of development tasks and small projects while applying company standards. \n·    Continually learn and apply relevant software development practices, patterns, tools, and technologies. \n·    Increase efficiency, reduce waste wherever and whenever possible.\n\n\nRequirements:\n\n·    4+ years in web application development, including implementing Application Programming Interfaces (APIs), Object-Oriented Programming and Design (OOP&D), and Object-Relational Mapping (ORM).\n·    Experience in frontend development using tools such as JavaScript, Angular, and React.\n·    Experience in backend development using tools such as C#, Java, and Go.\n·    Experience with relational databases, SQL, and NoSQL.\n·    Knowledge of Agile Development methodologies.\n·    Experience with distributed source control using tools such as Git.\n·    Education: BS/MS in Computer Science or equivalent degree/work experience",
    "job_link": "https://hire-r1.mokahr.com/social-recruitment/tesla/100004142#/job/33df493b-1dac-4f99-af22-d6462e04c605",
    "posted_date": "Not specified",
    "company": "Tesla",
    "scraped_at": "2025-09-11T02:53:47.493204"
  },
  {
    "title": "Supplier Industrialization Engineer – Battery Material Manufacturing",
    "location": "Pune, India",
    "experience_required": null,
    "job_description": "Job description\nTesla’s Supplier Industrialization team is responsible for critical raw materials, component production and qualification activities at suppliers. This role will be responsible for selecting, qualifying, scaling battery cell materials (such as NMC, LFP, precursor, graphite, LiOH, cathode electrode, PVDF, LiPF6, etc.) manufacturing processes and quality system at Tesla supplier locations. In this role, you will work closely with many organizations both internal and external to Tesla, taking new battery designs from initial concept through into full production.\n\nThe battery cell is a critical component in Tesla vehicles and storage systems. This role will have the opportunity to make meaningful contributions to our products. The work environment is demanding, fast-paced and incredibly exciting. The ideal candidate should be ready to push their limits, as they join in highly motivated and capable team to make unbelievable things into reality.\n\nResponsibilities\n\nReview/setup, qualify& scale process flow for battery cell material manufacturing.\nMonitor production output at existing facilities and support expansion programs with existing suppliers\nSetup In-process, OQC and corresponding IQC material quality controls; qualified required metrology for the same.\nWork together with suppliers on production process optimization and quality yield improvement. e.g. Metalic Impurity control.\nSupport material related FA @ Supplier location\nProject manage activities at supplier locations and ensure all required milestones are meeting Tesla product qualification on time\nAct as a technical contact point for battery cell material manufacturing processes and co-ordinate activities within internal and external teams.\n\nRequirements\n\nBS/MS in Chemical, Material Science & engineering, or related areas. 3+ years of industrial experience in battery material manufacturing process & quality control.\nExperience in characterizing materials using techniques like PSD, BET, GCMS, Titration, XRD, FTIR, SEM, EDS, Stress-strain diagram, DSC, DTA, hardness test, etc.\nExperience in developing OQC/IQC quality controls, metrology qualification for cell materials\nMust be well versed in statistical data analysis & process capability analysis\nWorking knowledge of battery cell manufacturing requirements, cell performance requirements and corresponding relationship to material characteristics. Experience in high volume manufacturing is desired.\nGood communication and presentation skills.\nAbility to travel domestically and internationally – 75%.",
    "job_link": "https://hire-r1.mokahr.com/social-recruitment/tesla/100004142#/job/ee4d1ede-3099-4264-9a5d-ad47d7104e9b",
    "posted_date": "Not specified",
    "company": "Tesla",
    "scraped_at": "2025-09-11T02:53:53.241090"
  },
  {
    "title": "Service Manager - Delhi",
    "location": "Delhi, India",
    "experience_required": null,
    "job_description": "Job description\nTesla Service Managers are the leaders of our service teams. In this role, you will be responsible for developing teams, managing day-to-day operations and preparing Tesla Service to meet the needs of our customers. We hire leaders who want to run a service business and be a part of a revolutionary and unprecedented part of history, as we transform the way we view service here at Tesla.\nYou will be responsible for developing, leading and driving critical regional business programs in a high growth and fast paced environment, taking on complex business challenges and setting targets that align with the strategic vision for Tesla. Due to our rapid growth, these targets will be extremely challenging. Most of what we are doing has not been done before and joining this team is a rare opportunity to set a standard that will continue to transform automotive transportation. \nWe need you to deliver excellent results, and think not only outside the box, but to forget about boxes altogether.\nThis role would be open in both Mumbai and Delhi\n\nResponsibilities:\nOur Service Managers must deliver excellent results and achieve goals month after month, quarter after quarter, on all aspects of customers, people, operations, and financials.\n Customer focused: Our customers are changing the world, and it is your responsibility to exceed their expectations of what a service experience should be. We expect you to exude energy and enthusiasm not only by going above and beyond for our existing customers, but also when engaging with new customers. You will actively monitor customer service trends to make necessary improvements, and assist the team in developing appropriate standards and processes to continuously elevate the overall service experience. The ideal candidate is solution oriented, demonstrating a high ability to identify root cause of problems and develop solutions when faced with adversity.\n People: Our Service Managers are people developers, thus should possess the ability to inspire! We expect you to be 100% committed to the success of your team, and actively involve yourself in your team members’ growth and development. Your team will look to you to set the standard for open communication, active problem solving, and a positive work environment. We will look to you, and your ability to coach and teach, to build a team of top talent and mentor the next generation of Tesla leaders. Our Service Managers are the coaches of their teams – you must provide regular coaching and feedback, and have a deep knowledge of your team’s strengths and opportunities. You will be responsible for leading change and inspiring your team every day.\n Operational excellence: As a Service Manager, you must understand and own every aspect of your service center’s performance. You will be responsible for driving continuous improvements to facilitate exceptional team output and customer service by partnering with operations teams on strategic execution. We expect you to champion safety, efficiency, quality, and overall excellence in all of your actions and decisions.\n Financials: Service Managers are expected to understand our business, know their numbers and lead the center’s daily operations to achieve specific goals in quality, productivity, output, cost as well as revenue / margin where applicable.\n\nRequirements:\nOur Service Managers act in the best interest of Tesla by demonstrating sound judgment. You must have a passion for our mission, our people, and our customers.\nTechnical acumen is required – you must develop a knowledge of all Tesla products, as well as Service systems, processes, and procedures.\nAttitude and approach is everything. You must:\nBe a leader and a team-player.\nTake ownership, and create a culture of accountability\nLove to change the status quo and work well in high-pressure situations. Exceptional prioritization and time management skills are essential for success.",
    "job_link": "https://hire-r1.mokahr.com/social-recruitment/tesla/100004142#/job/cb2048b7-1a44-479a-8d40-545ea00ade8b",
    "posted_date": "Not specified",
    "company": "Tesla",
    "scraped_at": "2025-09-11T02:53:58.766873"
  },
  {
    "title": "Vehicle Operator, Autopilot (Mumbai)",
    "location": "Mumbai, India",
    "experience_required": null,
    "job_description": "Job description\nWhat to Expect\nWe are looking for a highly motivated self-starter to join our vehicle data collection team. As a Prototype Vehicle Operator, you will be responsible for driving an engineering vehicle for extended periods, conducting dynamic audio and camera data collection for testing and training purposes. Access to the data collected is limited to the applicable development team. This role requires a high level of flexibility, strong attention to detail, excellent driving skills, and the ability to thrive in a fast-paced, dynamic environment.\nThis opportunity will require the flexibility of traveling to domestic or international destinations, as necessary.\nAbility to work a flexible schedule that includes at least one of your normal working days be a weekend day.\nAble to work a Day, Afternoon, or Night shift. The Afternoon and Night shift pays 10% in addition to the hourly base pay for the role.\nWhat You’ll Do\n•\nDrive an engineering vehicle for extended hours in a designated area for data collection, 5 to 8 hours daily\n•\nStart/Stop recording devices and perform minor equipment/software debugging as needed\n•\nAnalyze and report on the quality of data collected during each shift\n•\nProvide feedback and suggest process improvements to optimize data collection\n•\nWrite detailed daily drive reports documenting observations and issues\n•\nEnsure the vehicle’s safety and operational status before every shift\n•\nThis is a safety measure position which is subject to drug testing requirements per Tesla policy and in accordance with applicable law\nWhat You’ll Bring\n•\nA valid driver’s license is required\n•\nExcellent attention to detail and highly observant during data collection\n•\nStrong written and verbal communication skills in English\n•\nTech-savvy with experience managing tools for data collection and troubleshooting with advanced PC skills, particularly in Microsoft Office Suite\n•\nFamiliarity with Advanced Driver Assistance Systems (ADAS) and Autonomous Driving Systems (ADS)\n•\nOvertime is also typical for this position but not guaranteed",
    "job_link": "https://hire-r1.mokahr.com/social-recruitment/tesla/100004142#/job/bd4c034d-3203-46dc-a1fe-1e3a5e98e77f",
    "posted_date": "Not specified",
    "company": "Tesla",
    "scraped_at": "2025-09-11T02:54:04.167448"
  },
  {
    "title": "SailPoint Developer and Operations Specialist",
    "location": "Mumbai, India",
    "experience_required": null,
    "job_description": "Job description\nWe are looking for a SailPoint Developer and Operations Specialist to join our team. In this role you will help drive success in our day to day operations, supporting Tesla’s internal IAM customers, and ensuring platform resilience and stability. You will be a key part in helping to refine our operational workflow, and ensuring that our identity governance and compliance requirements are met. You will also have an opportunity to contribute to platform enhancements and feature development.\n\n\nResponsibilities:\n\nConfigure and deploy SailPoint IIQ Connectors for various target systems with hands-on with aggregation, workflows, tasks, rules and roles\nStrong understanding of role based Access Control, SOD and Access Certification in SailPoint IIQ\nIntegrate IAM systems with in-house applications, third party applications and SaaS applications for provisioning, identity authentication, and developing connectors between IAM tools and system resources\nBuild and Develop systems and processes to enforce least privilege in a transparent way\nWork across functions to improve IAM solutions to enhance compliance requirements and best practices\nWork with relevant compliance teams to research and translate global regulatory requirements pertaining to access management and identity governance into technical solutions\nLead emerging trend research, orchestrate product evaluations, and select the latest industry standards and tools\nConduct POCs of new Access Management products and services to validate integration needs\nManage all aspects of large, cross functional, globally distributed and complex projects\n\n\nRequirements:\n\nAt least 4 years of experience with SailPoint IIQ module\nStrong development experience in implementing the LCM events, workflows, rules and custom reports\nKnowledge of all the flavors of SailPoint installation and deployment\nAbility to manage project constraints, time, and quality\nAbility to collaborate across many participating teams",
    "job_link": "https://hire-r1.mokahr.com/social-recruitment/tesla/100004142#/job/8efaa81c-eebd-4719-9b41-3d7bd6812ba4",
    "posted_date": "Not specified",
    "company": "Tesla",
    "scraped_at": "2025-09-11T02:54:09.951655"
  },
  {
    "title": "Senior Voice and Contact Center Engineer",
    "location": "Not specified",
    "experience_required": null,
    "job_description": "Job description\nPosition Description:\n\nThe Voice and Contact Center Senior Engineer is responsible for design, implementation, and support of highly available contact center technologies, in partnership with Tesla's Customer Support, Sales and Service organizations. The Voice and Contact Center Technology team provides voice and contact center solutions that utilize API/Event Based technologies in conjunction with multiple service providers around the globe. Our services are provided in call center locations, retail service/sales centers, manufacturing environments and general office locations. We are responsible for providing voice and omni-channel solutions that are always-on, highly reliable and with exceptional performance. Tesla is a fast-paced and dynamic environment that can pivot directions quickly, so the ability to quickly respond to changes in direction is critical.\n\nResponsibilities:\n\nPartner closely with customer facing contact center teams to develop and implement technical solutions. \nDevelop and deploy contact center technical standards across all call center locations globally\nPerform as a subject matter expert in complex, multi-phase platform migration.\nIdentify opportunities to leverage existing technology solutions to improve customer and agent experiences. \nIdentify and advocate for new technical solutions that solve critical business problems.\nDesign and documentation of technical solutions, including architectural documents, engineering design documents and operational documentation\nServe as Tech Lead on the UC Operations team\nMentor and develop team members on contact center technologies\nDevelop standard operating procedures for support of technical solutions\nEnsure adequate system capacity to support business growth projections\n\n\nRequirements:\n\n5+ years designing and deploying complex contact center solutions leveraging Avaya platforms and technologies\nDemonstrated knowledge of Avaya Product Suite, Microsoft ACS product suite, and other API/Event Based Contact Center Platforms\nExperience with large-scale, multi-phased migrations. \nStrong understanding of supporting and troubleshooting complex, global VOIP deployments including SBCs, SIP trunking and multiple carriers\nDemonstrated experience in troubleshooting complex technology issues across various technologies\nStrong analytical background with focus on developing data-driven solutions\nStrong interpersonal and communications skills with the ability to communicate complex technology into business terminology. \nDesign solutions that balance both customer's needs and IT's technology roadmap\nAbility to work in a fast-paced and dynamic environment that can quickly change direction\nExposure to Voice and Contact Center Automation Tools",
    "job_link": "https://hire-r1.mokahr.com/social-recruitment/tesla/100004142#/job/477b5235-ee9f-4d92-9367-218d949cfbfa",
    "posted_date": "Not specified",
    "company": "Tesla",
    "scraped_at": "2025-09-11T02:54:15.583288"
  },
  {
    "title": "Regional Sales Manager/ Sales General Manager",
    "location": "Mumbai, India",
    "experience_required": null,
    "job_description": "Job description\nThe Role:\n\nThe Regional Sales Manager is responsible for the sales results, delivery execution and team development within their designated market. The Regional Sales Manager will achieve high yield by leading, developing, and hiring effective local teams, ensuring operational standards are met on a consistent basis and leading strategic business planning within their market. They will communicate effectively and be able to translate strategic themes into concrete action plans while providing clear and consistent feedback. Ultimately, the Regional Sales Manager is responsible and accountable for the operational success of their market, driving brand awareness, market share, profitability and customer experience. The role requires a strong people leader with superior problem solving skills, self-motivation, and agility to prioritise and shift focus as needed. \n\nResponsibilities:\n\nLead, develop, coach and motivate high performing teams \nDirectly manage a team of people-leaders across field retail and delivery locations\nReinforce a culture of leadership and team excellence: training standards, succession planning, talent acquisition and employee retention\nSpend time on locations to provide coaching, and in-the-moment feedback to management and senior team leaders\nSet clear team targets and individual goals; hold teams accountable by driving performance\nSource, recruit, hire, and on-board top talent\nCreate a culture of employee engagement and recognition of high performers\nDevelop and reinforce high operational standards by coaching through and reinforcing targets\nMaintain and reinforce Safety and Security standards by partnering with EH&S, Workplace and Security teams\nDevelop and execute strategy to drive sales growth in the region\nCreate a continuous improvement culture by actively collecting feedback, testing strategies, and improving vehicle and customer flow in each sales and delivery location\nDemonstrate fluency and reinforce requirements in the local market’s Sales and Registration requirements and processes\nSeek out opportunities to increase delivery yield through campaigns targeting our existing order backlog to increase conversion rate.\nReview and implement opportunities to operate more efficiently, reduce costs, and improve employee productivity.\nPartner with senior leadership to optimise sales and delivery processes that enhance the customer experience\nUtilise reports and dashboards to provide feedback to management on strategic direction, as well as execute process management changes\nKeep senior leadership informed through a regular clear and concise updates\nEnsure operational teams across the market are aligned with HQ directives, processes and system training programs.\nDevelop and implement best practices for customer communication and education pre-delivery to increase team productivity and drive efficient, high-yielding sales and delivery operations. \n\n\nRequirements:\n\nAt least 5 years of experience leading large teams in a high-growth, retail or service-focused industry with multi-site experience\nDemonstrated ability to inspire, influence, and hold teams accountable to business goals \nAbility to prioritise, manage multiple projects, and adhere to business-critical deadlines\nInnovative – unfazed by change, hungry to learn, resourceful\nDriven – effective at using data, logic, and instincts to identify problems and execute solutions; Experience running complex processes",
    "job_link": "https://hire-r1.mokahr.com/social-recruitment/tesla/100004142#/job/d6c0578d-eae0-40e1-b6ea-becee80ff2af",
    "posted_date": "Not specified",
    "company": "Tesla",
    "scraped_at": "2025-09-11T02:54:21.995085"
  },
  {
    "title": "Site Reliability Engineer",
    "location": "Pune, India",
    "experience_required": null,
    "job_description": "Job description\nThe Role:\n\nWe are seeking a highly skilled Site Reliability Engineer (SRE) to join our team, responsible for ensuring the reliability, efficiency, and scalability of our large-scale systems and applications. As an SRE, you will work closely with cross-functional teams to identify and resolve complex issues, drive infrastructure optimization, and improve overall system reliability. Your focus will be on designing, building, and maintaining systems that meet the highest standards of performance, uptime, and user experience.\n\nResponsibilities:\n\nDesign, build, and maintain large-scale systems and applications, ensuring high reliability, efficiency, and scalability.\nOptimize system performance, focusing on CPU thread management, memory optimization, and kernel tuning.\n Develop and implement scalable DNS architectures, utilizing protocols such as DNSSEC, DHCP, and BIND.\nConfigure and manage TCP/L7 proxy technologies, including NGINX, HAProxy, and Squid, to ensure efficient traffic management and content delivery.\nUtilize configuration management tools like Ansible, Puppet, or Chef to automate and manage DNS and proxy configurations, ensuring consistency and reliability across the environment.\nMonitor and analyze system performance using tools like Prometheus, Grafana, Telegraf, and Splunk, identifying areas for improvement and implementing optimizations.\nWork with containerization technologies like Kubernetes to deploy and manage applications.\nTroubleshoot and resolve critical issues across multiple layers, including CDN, Load balancers, storage, OS, network, K8S, virtualization, and application/DB stack.\nBuild, maintain, and optimize CI/CD pipelines using tools like Jenkins, Github CI/CD to ensure efficient and reliable software delivery.\nCollaborate with development teams to design and implement efficient and scalable systems, ensuring alignment with business objectives.\nDevelop and maintain automation scripts to streamline system management and reduce manual errors.\nParticipate in on-call rotations, providing 24/7 support for critical systems and ensuring prompt resolution of issues.\n\nRequirements:\n\nProficiency in Linux fundamentals, including performance optimizations, kernel concepts, and tuning.\nDeep understanding of DNS and TCP/L7 proxy technologies, including configuration and management using tools like Ansible, Puppet, or Chef.\nExperience with DNS protocols such as DNSSEC, DHCP, and BIND, as well as TCP/L7 proxy technologies like NGINX, HAProxy, and Squid.\nHands-on experience with containerization technologies like Kubernetes.\nProficiency in general programming and scripting languages, including Python, Shell, and Golang.\nStrong troubleshooting and problem-solving skills, with the ability to identify root causes across multiple layers.\nExperience with CI/CD pipeline tools and hands-on experience in configuring and monitoring them.\nStrong understanding of software development principles, including testing, validation, and deployment.\nExcellent communication and collaboration skills, with the ability to work effectively with cross-functional teams.\nBachelor’s degree in computer science, Computer Engineering, or a related field, or equivalent experience.",
    "job_link": "https://hire-r1.mokahr.com/social-recruitment/tesla/100004142#/job/6b402eb3-2bb2-4c93-8669-70fd294d94e5",
    "posted_date": "Not specified",
    "company": "Tesla",
    "scraped_at": "2025-09-11T02:54:27.438485"
  },
  {
    "title": "Frontend Software Engineer",
    "location": "Mumbai, India",
    "experience_required": null,
    "job_description": "Job description\nPosition Description\nYou will be working with fellow software engineers focused on building out Tesla's internal tools that facilitate process management of the design, permitting, and installation of energy products and systems. This team is focused on building a stable and scalable platform that can be extended and configured for all Tesla Energy and Vehicle products that are sold and supported today, and any that will be introduced in the future. The goal of this role and team is to enable our internal employees with ways to track, standardize, automate, and ultimately optimize all steps taken on an energy installation job from start to finish.\nResponsibilities\nDesign, develop and support applications and systems under the team’s scope\nWrite clean, maintainable, performant, and well-tested code to implement new features and fix bugs\nWrite unit tests, integration tests, and work with QA to coordinate timely regression for new features\nMonitor live system metrics, respond to alerts, and troubleshoot production issues\nInvestigate and understand existing system technical functionality and propose technical improvements\nCollaborate with Product, Design, and Business stakeholders to plan and prioritize new feature development\nCommunicate changes in project estimates, dependencies, and blockers with affected stakeholders quickly\nOwn feature development and projects through design, development, testing, and release to production\nUnderstand and improve the scalability, maintainability, availability, and visibility of applications\nDocument newly implemented technologies and application functionality\nRequirements\nDegree in Computer Science or related field, or equivalent experience\nSolid understanding of fundamental web technologies such as HTTP, REST, AJAX and JSON. Strong proficiency in HTML, CSS and JavaScript / ES6, including DOM manipulation and the JS object model\nSolid understanding of database principles, particularly how to query and update SQL databases\nThorough understanding of REST principles and best practices of building and using RESTful APIs\nThorough understanding of core design principles and common design patterns of Angular\nExperience with common front-end development tools such as Vite, NPM, Yarn, etc.\nExperience with GraphQL is a big plus",
    "job_link": "https://hire-r1.mokahr.com/social-recruitment/tesla/100004142#/job/bf825a3d-2cd4-42c3-8963-1603db650912",
    "posted_date": "Not specified",
    "company": "Tesla",
    "scraped_at": "2025-09-11T02:54:32.849310"
  },
  {
    "title": "Vehicle Technician - Mumbai/ Delhi",
    "location": "Not specified",
    "experience_required": null,
    "job_description": "Job description\nTesla is looking for an experienced Vehicle Technician to work on one of the most progressive vehicle brands in the world. This position requires a significant amount of customer interaction, so the ideal candidate will not only possess the technical acumen, but also the ability to provide a strong level of customer service. If you are interested in becoming a part of a world class service team supporting the latest EV technology, we are interested in hearing from you. \nThis role is open for both Mumbai and Delhi\n\nResponsibilities:\n·         Performs entry-level work in the inspection, repair, and service of Tesla electric vehicles\n·         Operate a variety of hand, power, and shop tools\n·         Perform equipment inspections, adjustments and certifications\n·         Perform Pre-Delivery Inspections (PDI) of new cars\n·         Maintain records of time, expenses and materials\n·         Order shop supplies and parts as and when needed\n·         Perform other related duties as assigned\n·         Help maintain cleanliness of vehicles and service center\n·         Effectively handle multiple priorities, organize workload, and meet deadlines\n·         Support journeymen technicians as needed\n·         Support sale events when required\n\nRequirements:\n·         Methods, techniques, parts, tools and materials used in the maintenance and repair of vehicles including testing, diagnosis, HVAC service, hydraulic, brakes, testing and repair of electronic systems and modules\n·         Operation and maintenance of a wide variety of hand and power tools, shop tools, test equipment\n·         Automotive equipment and servicing methods\n·         Experience using scan tools, following diagnostics and operating scopes/DVOM equipment\n·         Chemicals and lubricants used in automotive servicing\n·         Degree or Certificate from a Technical school / University program in Automotive Technology or equivalent experience\n·         1-3 yrs experience in a dealership environment, 3-5 years in the automotive industry\n·         Factory Trained Status / OEM Training, Hybrid Experience a plus\n·         Certification to repair A/C systems and handle refrigerant desired\n·         Valid driver’s license and insurance required\n·         Excellent oral and written communication skills as well as the ability to follow instructions required\n·         Ability to establish and maintain cooperative working relationships with those contacted in the course of work, including the public\n·         Maintain and perform top level professional integrity and appearance as an automotive technician",
    "job_link": "https://hire-r1.mokahr.com/social-recruitment/tesla/100004142#/job/00c06284-8ea0-4f47-a1a2-52ce5b9d963e",
    "posted_date": "Not specified",
    "company": "Tesla",
    "scraped_at": "2025-09-11T02:54:38.292732"
  },
  {
    "title": "Service Manager - Mumbai",
    "location": "Not specified",
    "experience_required": null,
    "job_description": "Job description\nTesla Service Managers are the leaders of our service teams. In this role, you will be responsible for developing teams, managing day-to-day operations and preparing Tesla Service to meet the needs of our customers. We hire leaders who want to run a service business and be a part of a revolutionary and unprecedented part of history, as we transform the way we view service here at Tesla.\nYou will be responsible for developing, leading and driving critical regional business programs in a high growth and fast paced environment, taking on complex business challenges and setting targets that align with the strategic vision for Tesla. Due to our rapid growth, these targets will be extremely challenging. Most of what we are doing has not been done before and joining this team is a rare opportunity to set a standard that will continue to transform automotive transportation. \nWe need you to deliver excellent results, and think not only outside the box, but to forget about boxes altogether.\nThis role would be open in both Mumbai and Delhi\n\nResponsibilities:\nOur Service Managers must deliver excellent results and achieve goals month after month, quarter after quarter, on all aspects of customers, people, operations, and financials.\n Customer focused: Our customers are changing the world, and it is your responsibility to exceed their expectations of what a service experience should be. We expect you to exude energy and enthusiasm not only by going above and beyond for our existing customers, but also when engaging with new customers. You will actively monitor customer service trends to make necessary improvements, and assist the team in developing appropriate standards and processes to continuously elevate the overall service experience. The ideal candidate is solution oriented, demonstrating a high ability to identify root cause of problems and develop solutions when faced with adversity.\n People: Our Service Managers are people developers, thus should possess the ability to inspire! We expect you to be 100% committed to the success of your team, and actively involve yourself in your team members’ growth and development. Your team will look to you to set the standard for open communication, active problem solving, and a positive work environment. We will look to you, and your ability to coach and teach, to build a team of top talent and mentor the next generation of Tesla leaders. Our Service Managers are the coaches of their teams – you must provide regular coaching and feedback, and have a deep knowledge of your team’s strengths and opportunities. You will be responsible for leading change and inspiring your team every day.\n Operational excellence: As a Service Manager, you must understand and own every aspect of your service center’s performance. You will be responsible for driving continuous improvements to facilitate exceptional team output and customer service by partnering with operations teams on strategic execution. We expect you to champion safety, efficiency, quality, and overall excellence in all of your actions and decisions.\n Financials: Service Managers are expected to understand our business, know their numbers and lead the center’s daily operations to achieve specific goals in quality, productivity, output, cost as well as revenue / margin where applicable.\n\nRequirements:\nOur Service Managers act in the best interest of Tesla by demonstrating sound judgment. You must have a passion for our mission, our people, and our customers.\nTechnical acumen is required – you must develop a knowledge of all Tesla products, as well as Service systems, processes, and procedures.\nAttitude and approach is everything. You must:\nBe a leader and a team-player.\nTake ownership, and create a culture of accountability\nLove to change the status quo and work well in high-pressure situations. Exceptional prioritization and time management skills are essential for success.",
    "job_link": "https://hire-r1.mokahr.com/social-recruitment/tesla/100004142#/job/2d4a5972-a9d5-4af5-a884-405b64acb230",
    "posted_date": "Not specified",
    "company": "Tesla",
    "scraped_at": "2025-09-11T02:54:43.859476"
  },
  {
    "title": "Store Manager - Mumbai",
    "location": "Mumbai, India",
    "experience_required": null,
    "job_description": "Job description\nAs a Store Manager at Tesla you are a seasoned and charismatic retail leader, responsible for overseeing and driving sales and sales operations at your location. In this role, you will be responsible for leading the overall management and sales execution, recruitment, training, and development of a dynamic store team. Your team will look to you to set the standard for open communication, active problem solving, and a positive work environment. We expect you to be 100% committed to the success of your team, and actively involve yourself in your team members’ growth and development. You are a hands-on coach with a strong business acumen. You seek constant improvement of performance and have a strong understanding of numbers and KPIs. This role would be based in Mumbai and Delhi\n\nResponsibilities:\n·         Help drive business and maximize sales through customer service, product knowledge, merchandise presentation and promotion\n·         Implement all operational policies and procedures in order to satisfy the needs of the customer while helping Tesla achieve its goals\n·         Lead the interviewing and recruitment of candidates who possess the skills necessary to help achieve store goals\n·         Train and develop a staff to consistently perform to company standards\n·         Lead in the planning, implementation, and follow up of store operational tasks and projects including but not limited to outbound events and sales networking activities\n·         Control store expenses, including staffing, supplies, and services\n·         Adhere to processes regarding merchandise display and physical inventory\n·         Experiment with and promote daily workflow efficiency improvements within local team, share proven best practices with peers and management\n·         Represent Tesla in a professional and responsible manner when communicating with others both inside and outside the company\n·         Your performance will be measured by your ability to manage a productive team of Tesla Advisors who are demonstrating strong sales performance and maintaining robust and active potential customer pipelines and who are actively engaging and signing up potential customers for sales follow up all while maintaining excellent customer satisfaction ratings for your store\n·         Employee must seriously learn about the company and products related knowledge, and pass internal testing; otherwise he/she will not be able to meet the full time employee’s requirement\n·         Other Responsibilities: Perform other related duties as assigned, based on the business need\n\nRequirements:\n·         8+ years working experience in retail , industry and key account sales with proven track record to meet or exceed targets and goals , 3 years above team management experience\n·         Excellent business development ability and business negotiation skills\n·         Logic thinker. Sensitive to facts and sales data, excellent logic analysis ability\n·         Self-starter who possesses exceptional time management skills and has great attention to detail \n·         Highly appreciate Tesla’s startup culture and equip with a startup mentality \n·         Able to work under pressure, ability to manage team member and meet sales target in a fast-paced working environment\n·         Exceptional self-management and self-learning ability \n·         Ability to prioritize, manage multiple projects, and adhere to business-critical deadlines \n·         Excellent written and verbal communication skills\n·         Ability to communicate relevant information to all levels of the organization\n·         Passionate dedication and ethical approach to sales management and operations\n·         Team player. Ability to develop collaborative relationships and act as a well-respected, trusted partner that others want to work with\n·         Strong knowledge and proven work experience with retail store operations and systems",
    "job_link": "https://hire-r1.mokahr.com/social-recruitment/tesla/100004142#/job/ed52bc66-8fbc-4291-bd59-e0573c33dfec",
    "posted_date": "Not specified",
    "company": "Tesla",
    "scraped_at": "2025-09-11T02:54:49.380957"
  },
  {
    "title": "Application Product Engineer",
    "location": "Mumbai, India",
    "experience_required": null,
    "job_description": "Job description\nPosition Description\nTesla aims to accelerate world’s transition to a sustainable energy by ensuring we provide a seamless and frictionless experience to our customers. To meet this goal, Tesla is constantly striving to innovate and provide best in class services through introduction of pioneering new products and services. To that end, Tesla is seeking a hardworking and passionate Senior Product Engineer. This Product Engineer will be part of a core team that is focused on delivering a highly scalable platform that enables growth of current and future products and services to our customers. \n\nResponsibilities\n·         Deliver a product vision and strategy for global Workforce management solutions focusing on payroll, time and attendance, scheduling, compliance, leave and accruals.\n·         Define roadmap and customer scenarios for a global application.\n·         Work with cross function teams such as engineering, legal, and business stakeholders including finance/ HR to deliver business specific value.\n·         Work with Legal, HR and Payroll teams to understand localized processes and data requirements in depth for each market.\n·         Work closely with engineering team to deliver a scalable architecture that not just meets current needs but considers future growth scenarios and scalability in complex global domain.\n·         Work closely with business stakeholders in identifying opportunities for enhancements, automation and simplified work flows.\nA solid grasp of HR processes and procedures especially in Leave administration, allowing you to provide informed support and guidance to stakeholders.\nReview common payroll, Time & Attendance system issues and questions. Provide timely resolution in conjunction with Help Desk/ Answer Bar and escalate as needed.\n·         Define a set of KPIs to measure customer satisfaction and business impact with the ability to analyze them and utilize them in decision making processes\n·         Prioritize between existing versus new customers, and between features, architectural improvements and operational excellence\n\nRequirements\n·         Bachelor’s or Master’s degree in Engineering or MBA, or equivalent in experience\n·         5+ years of experience in product management, product development or functional role that had customer impact with evidence of exceptional ability\n·         Prior experience in HRIS/ Payroll/ Timekeeping domain such as ADP, Kronos, SAP, Peoplesoft, Workday, UKG Dimensions in a global setting is a must.\n·         Gathering business requirements, documentation, user stories, functional specifications and building system design with Engineering teams.\n·         Proven history of converting learnings from customer insights into tangible product features that customers love\n·         Entrepreneurial instincts with clear bias for informed action and track record of leading new initiatives with limited resources and support\n·         Strong analytical and quantitative skills with ability to use data and metrics for making assumptions and decisions\n·         Ability to successfully work with cross range of teams including engineering, UX, legal, finance, sales and operations\n·         Good understanding and working experience in technology development best practices (such as, Agile, etc.) and product management technologies\n·         Excellent written and verbal communications across technical and non-technical stakeholders\n·         Experience presenting to senior executives.",
    "job_link": "https://hire-r1.mokahr.com/social-recruitment/tesla/100004142#/job/9b38b5cc-adb6-411a-9896-720cc3e8898d",
    "posted_date": "Not specified",
    "company": "Tesla",
    "scraped_at": "2025-09-11T02:54:55.252560"
  },
  {
    "title": "Tesla Advisor - Mumbai",
    "location": "Mumbai, India",
    "experience_required": null,
    "job_description": "Job description\nThe Role:\n\nAt Tesla, our Tesla Advisor consistently deliver on an incredible educational, immersive, and exciting experience to all of our current and future customers. They constitute Tesla’s front line and are our brand ambassadors, supporting our mission to accelerate the world’s transition to sustainable energy by creating memorable experiences for our customers.\nAs a Tesla Advisor, you will support customers from the moment they walk into our showrooms to learn about Tesla. We’ve created one of the most innovative vehicles ever made, and you will help deliver an equally innovative buying experience. \nThis role would be open in both Mumbai and Delhi\n\nResponsibilities: \n\n·         Engage walk in guests promptly, personally and with the goal of opening the conversation and ensuring they feel welcome\n·         Help drive business and maximize sales through customer service, product knowledge, merchandise presentation and promotion.\n·         Implement all operational policies and procedures in order to satisfy the needs of the customer while helping Tesla achieve its goals.\n·         Understand who our guests are, what brought them to Tesla, their intent and timeline to purchase, thus creating a robust Customer Profile\n·         Educate and excite guests by answering their questions and providing a tailored experience based upon their interests and agenda\n·         Demonstrate a mastery of all Tesla products and services, as well as local incentives for EV owners\n·         Help Tesla maintain a healthy sales pipeline by collecting customer contact information and scheduling Test Drives for individuals who exhibit purchase intent or potential\n·         Regularly update the CRM system to ensure accurate and timely sales and delivery information is available to management\n\nRequirements:\n\n·         Customer service experience required\n·         Positive, enthusiastic and passionate about the changes in the personal transportation industry\n·         Self-starter who possesses exceptional time management skills and has great attention to detail.\n·         Ability to prioritize, manage multiple projects, and adhere to business-critical deadlines.\n·         Passionate dedication and ethical approach to sales management and operations.\n·         Ability to understand and convey business issues and technical concepts\n·         Strong sense of team mentality and reliability\n·         Strong communication skills and attention to detail\n·         Demonstrate a mastery of all Tesla products and services. Keep up with EV industry trends and local incentives\n·         Ability to work on shift and flexible schedule\n·         MUST have and maintain a valid driver’s license and an acceptable and safe driving record.",
    "job_link": "https://hire-r1.mokahr.com/social-recruitment/tesla/100004142#/job/b90d6a05-700f-4237-9a5a-b807bd9abfa4",
    "posted_date": "Not specified",
    "company": "Tesla",
    "scraped_at": "2025-09-11T02:55:00.847457"
  },
  {
    "title": "Assistant Trade Manager/ Trade Manager",
    "location": "Mumbai, India",
    "experience_required": null,
    "job_description": "Job description\nThe Role: \n\nTesla is looking for an experienced Assistant Manager / Manager based in India to support customs and trade matters in APAC, with primary focus on India. The role will be responsible for facilitating the timely customs clearance of goods, minimizing Tesla’s risk profile, and driving cost savings programs. \n\nResponsibilities:\n\nServe as India Customs Subject Matter Expert for any issues and inquiries raised by external or internal parties.\nManage day-to-day India trade operations and resolve customs clearance issues.\nCoordinate with internal stakeholders and customs brokers to ensure efficient and timely clearance of shipments.\nManage customs brokers’ performance.\nAssess import and export requirements.\nIdentify trade compliance risks areas and savings opportunities.\nAnalyze trade metrics data for management reporting.\nEnsure the accurate payments of import duties and taxes.\nSupport the management of customs audits and verifications.\n\nRequirements:\n\nBachelor's degree with over 5 years of Customs Brokerage/Trade Consulting/In-house Trade Management experience.\nWell-versed with all trade and customs technical matters (HS code classification, customs valuation, trade schemes, incoterms, Free Trade Agreements, export controls, etc.).\nExperience working in a collaborative and cross-functional environment.\nAbility to manage tight timeline.",
    "job_link": "https://hire-r1.mokahr.com/social-recruitment/tesla/100004142#/job/453ba889-9ab0-4adb-83c8-f623afa3663e",
    "posted_date": "Not specified",
    "company": "Tesla",
    "scraped_at": "2025-09-11T02:55:06.739120"
  },
  {
    "title": "Global Supply Manager, International Logistics",
    "location": "Mumbai, India",
    "experience_required": null,
    "job_description": "Job description\nThe Role:\n\nWe’re looking for highly motivated logistics professional to support Global Logistics procurement. \nThe ideal candidate will be responsible for developing the strategy, running RFP’s, vendor management, understanding and procuring services per operations and business requirements. \nThe candidate will be looking after all logistics activities related to business verticals for Tesla Motors and Energy as well as spare parts and service logistics.\nThe candidate must have a track record of significant achievements, tremendous drive, and a willingness to roll up their sleeves.\n\nResponsibilities:\n\n·       Owner of RFI's, RFP's and RFQ's - ensuring all commercial terms are agreed and documented\n·       Ensures NDA, SOW's and Master Purchase Agreement are positioned appropriately before business is initiated\n·       Develop strategies around the Finished Vehicle, Warehousing, Customs and Service Parts Logistics industries to drive price negotiations processes and ensure best in-class pricing\n·       Knowledge of vehicle transport, ground trucking market, 3PL's, Air, Ocean and LTL contracts \n·       Responsible for maintaining productive global transportation and ancillary service contracts\n·       Drive continual cost reduction and avoidance initiatives through strategic price negotiations\n·       Address all areas of Special Equipment management related to category business plans, global market and pricing analysis and procurement support\n·       Lead purchasing activities with internal stakeholders: Finance, Energy Distribution, Logistics Operations, Trade Teams and Engineering departments and develop bid specifications, negotiate contracts, and consolidate results to deliver sourcing recommendations\n·       Analyse current spend and evaluate current suppliers\n·       Consolidate spend across supply base to create leverage, analyse purchasing trends and develop sourcing alternatives. Identify new high potential suppliers on global basis\n·       Conduct negotiations and secure comprehensive agreements with suppliers\n·       Maintain a high level of industry expertise and supplier/market conditions Manage respective supplier relationships and performance, including but not limited to dispute resolution\n·       Develop key performance measures for chosen suppliers and negotiate on multiple variables to award longer-term strategic contracts that result in significant cost reduction and improved service levels\n·       Evaluate supplier business proposals and present recommendations that will result in cost savings, avoidance, or containment\n·       Develop sourcing and negotiation strategies that deliver against business objectives and achieves sustainable relationships with suppliers\n·       Create competitive environments with suppliers to support a negotiation strategy\n·       Evaluate and provide guidance on final selection of suppliers; Perform value analysis for final selection of suppliers\n·       Evaluate supplier core competencies and competitive positioning using industry cost models\n\nRequirements:\n\n·       Bachelor’s degree in business, Supply Chain, Operations Management, Engineering and/or equivalent experience in Supply Chain or evidence of exceptional ability\n·       Ability to multi-task, prioritize and work in an extremely fast-paced environment Project related experience in Special Logistic Equipment Services\n·       5-6+ years of related experience in Vendor management\n·       Master’s in supply chain and / or related field or MBA in supply chain preferred\n·       Track record in planning, execution, and delivery of projects.\n·       Program management expertise\n·       Knowledge of purchasing processes (SOP's, RFP / RFQ / RFI's, PO's etc.)",
    "job_link": "https://hire-r1.mokahr.com/social-recruitment/tesla/100004142#/job/74b82b35-850e-4825-82de-f9c586f7aad9",
    "posted_date": "Not specified",
    "company": "Tesla",
    "scraped_at": "2025-09-11T02:55:12.296448"
  },
  {
    "title": "Vehicle Operator, Autopilot (Delhi)",
    "location": "Delhi, India",
    "experience_required": null,
    "job_description": "Job description\nWhat to Expect\nWe are looking for a highly motivated self-starter to join our vehicle data collection team. As a Prototype Vehicle Operator, you will be responsible for driving an engineering vehicle for extended periods, conducting dynamic audio and camera data collection for testing and training purposes. Access to the data collected is limited to the applicable development team. This role requires a high level of flexibility, strong attention to detail, excellent driving skills, and the ability to thrive in a fast-paced, dynamic environment.\nThis opportunity will require the flexibility of traveling to domestic or international destinations, as necessary.\nAbility to work a flexible schedule that includes at least one of your normal working days be a weekend day.\nAble to work a Day, Afternoon, or Night shift. The Afternoon and Night shift pays 10% in addition to the hourly base pay for the role.\n\nWhat You’ll Do\n•Drive an engineering vehicle for extended hours in a designated area for data collection, 5 to 8 hours daily\n•Start/Stop recording devices and perform minor equipment/software debugging as needed\n•Analyze and report on the quality of data collected during each shift\n•Provide feedback and suggest process improvements to optimize data collection\n•Write detailed daily drive reports documenting observations and issues\n•Ensure the vehicle’s safety and operational status before every shift\n•This is a safety measure position which is subject to drug testing requirements per Tesla policy and in accordance with applicable law\n\nWhat You’ll Bring\n•A valid driver’s license is required\n•Excellent attention to detail and highly observant during data collection\n•Strong written and verbal communication skills in English\n•Tech-savvy with experience managing tools for data collection and troubleshooting with advanced PC skills, particularly in Microsoft Office Suite\n•Familiarity with Advanced Driver Assistance Systems (ADAS) and Autonomous Driving Systems (ADS)\n•Overtime is also typical for this position but not guaranteed",
    "job_link": "https://hire-r1.mokahr.com/social-recruitment/tesla/100004142#/job/48fdecc9-b703-4a5a-a546-0cfdd188b449",
    "posted_date": "Not specified",
    "company": "Tesla",
    "scraped_at": "2025-09-11T02:55:18.017451"
  },
  {
    "title": "Tesla Advisor - Delhi",
    "location": "Delhi, India",
    "experience_required": null,
    "job_description": "Job description\nThe Role:\n\nAt Tesla, our Tesla Advisor consistently deliver on an incredible educational, immersive, and exciting experience to all of our current and future customers. They constitute Tesla’s front line and are our brand ambassadors, supporting our mission to accelerate the world’s transition to sustainable energy by creating memorable experiences for our customers.\nAs a Tesla Advisor, you will support customers from the moment they walk into our showrooms to learn about Tesla. We’ve created one of the most innovative vehicles ever made, and you will help deliver an equally innovative buying experience. \nThis role would be open in both Mumbai and Delhi\n\nResponsibilities: \n\n·         Engage walk in guests promptly, personally and with the goal of opening the conversation and ensuring they feel welcome\n·         Help drive business and maximize sales through customer service, product knowledge, merchandise presentation and promotion.\n·         Implement all operational policies and procedures in order to satisfy the needs of the customer while helping Tesla achieve its goals.\n·         Understand who our guests are, what brought them to Tesla, their intent and timeline to purchase, thus creating a robust Customer Profile\n·         Educate and excite guests by answering their questions and providing a tailored experience based upon their interests and agenda\n·         Demonstrate a mastery of all Tesla products and services, as well as local incentives for EV owners\n·         Help Tesla maintain a healthy sales pipeline by collecting customer contact information and scheduling Test Drives for individuals who exhibit purchase intent or potential\n·         Regularly update the CRM system to ensure accurate and timely sales and delivery information is available to management\n\nRequirements:\n\n·         Customer service experience required\n·         Positive, enthusiastic and passionate about the changes in the personal transportation industry\n·         Self-starter who possesses exceptional time management skills and has great attention to detail.\n·         Ability to prioritize, manage multiple projects, and adhere to business-critical deadlines.\n·         Passionate dedication and ethical approach to sales management and operations.\n·         Ability to understand and convey business issues and technical concepts\n·         Strong sense of team mentality and reliability\n·         Strong communication skills and attention to detail\n·         Demonstrate a mastery of all Tesla products and services. Keep up with EV industry trends and local incentives\n·         Ability to work on shift and flexible schedule\n·         MUST have and maintain a valid driver’s license and an acceptable and safe driving record.",
    "job_link": "https://hire-r1.mokahr.com/social-recruitment/tesla/100004142#/job/5ff183bc-c02c-40a5-af23-445f29cee004",
    "posted_date": "Not specified",
    "company": "Tesla",
    "scraped_at": "2025-09-11T02:55:24.274118"
  },
  {
    "title": "Store Manager - Delhi",
    "location": "Delhi, India",
    "experience_required": null,
    "job_description": "Job description\nAs a Store Manager at Tesla you are a seasoned and charismatic retail leader, responsible for overseeing and driving sales and sales operations at your location. In this role, you will be responsible for leading the overall management and sales execution, recruitment, training, and development of a dynamic store team. Your team will look to you to set the standard for open communication, active problem solving, and a positive work environment. We expect you to be 100% committed to the success of your team, and actively involve yourself in your team members’ growth and development. You are a hands-on coach with a strong business acumen. You seek constant improvement of performance and have a strong understanding of numbers and KPIs. This role would be based in Mumbai and Delhi\n\nResponsibilities:\n·         Help drive business and maximize sales through customer service, product knowledge, merchandise presentation and promotion\n·         Implement all operational policies and procedures in order to satisfy the needs of the customer while helping Tesla achieve its goals\n·         Lead the interviewing and recruitment of candidates who possess the skills necessary to help achieve store goals\n·         Train and develop a staff to consistently perform to company standards\n·         Lead in the planning, implementation, and follow up of store operational tasks and projects including but not limited to outbound events and sales networking activities\n·         Control store expenses, including staffing, supplies, and services\n·         Adhere to processes regarding merchandise display and physical inventory\n·         Experiment with and promote daily workflow efficiency improvements within local team, share proven best practices with peers and management\n·         Represent Tesla in a professional and responsible manner when communicating with others both inside and outside the company\n·         Your performance will be measured by your ability to manage a productive team of Tesla Advisors who are demonstrating strong sales performance and maintaining robust and active potential customer pipelines and who are actively engaging and signing up potential customers for sales follow up all while maintaining excellent customer satisfaction ratings for your store\n·         Employee must seriously learn about the company and products related knowledge, and pass internal testing; otherwise he/she will not be able to meet the full time employee’s requirement\n·         Other Responsibilities: Perform other related duties as assigned, based on the business need\n\nRequirements:\n·         8+ years working experience in retail , industry and key account sales with proven track record to meet or exceed targets and goals , 3 years above team management experience\n·         Excellent business development ability and business negotiation skills\n·         Logic thinker. Sensitive to facts and sales data, excellent logic analysis ability\n·         Self-starter who possesses exceptional time management skills and has great attention to detail \n·         Highly appreciate Tesla’s startup culture and equip with a startup mentality \n·         Able to work under pressure, ability to manage team member and meet sales target in a fast-paced working environment\n·         Exceptional self-management and self-learning ability \n·         Ability to prioritize, manage multiple projects, and adhere to business-critical deadlines \n·         Excellent written and verbal communication skills\n·         Ability to communicate relevant information to all levels of the organization\n·         Passionate dedication and ethical approach to sales management and operations\n·         Team player. Ability to develop collaborative relationships and act as a well-respected, trusted partner that others want to work with\n·         Strong knowledge and proven work experience with retail store operations and systems",
    "job_link": "https://hire-r1.mokahr.com/social-recruitment/tesla/100004142#/job/1af21c14-4233-46b4-991a-731497c72a8e",
    "posted_date": "Not specified",
    "company": "Tesla",
    "scraped_at": "2025-09-11T02:55:29.643049"
  },
  {
    "title": "Field Service Technician - Charging & Energy",
    "location": "Not specified",
    "experience_required": null,
    "job_description": "Job description\nPosition:\n\nTesla is looking for an experienced and dynamic Field Service Technician to work in one of the most progressive companies in the world. We are seeking experienced service technicians with excellent oral and written communication skills to work within the Charging and Energy Products team. Tesla needs a diversely talented and highly mobile technician ready to move quickly in order to keep our systems fully operational. The primary job is to service, troubleshoot, or upgrade stationary battery equipment and Tesla charging infrastructures as needed. Applicants should be self-motivated team players with a positive attitude! As stated, this role will require a significant amount of travel set around the service and upkeep our stationary battery network.\n\n\nResponsibilities:\n\nTroubleshoot and repair equipment as defined by the service engineering team.\nBe ready to travel for extended periods of time covering multiple locations.\nPerform complex and precise electro-mechanical debug, rework and repair.\nPerform tasks requiring a high level of skill and patience.\nOperate a variety of hand tools, power tools, diagnostic and measuring equipment (including DMMs and oscilloscopes).\nDevelop and follow best practices and procedures for various maintenance activities related to Tesla Charging and Energy equipment.\nMaintain high levels of communication and feedback within the Tesla Charging and Energy service organization; prepare daily updates of work completed, problems identified, and future timelines.\nHave flexibility to provide support outside your region and possibly outside the country as required.\nPerform other related duties as assigned per our growth and diversity across applications.\nActively work across Tesla sites, ensuring they stay online and performing at an optimal level.\n\nRequirements:\n\nCertified Electrician \nMinimum 3+ years’ electrical experience’ within the Commercial, Industrial or Utility sector. (Solar/Wind experience is preferred)\nMust have up to date Electrical Registration/Licence.\nMust be able to work from complex and detailed documentation and/or verbal and written instructions depending on situation.\nStrong computer skills. Comfort with Microsoft office and cloud-based computing programs. Ability to communicate and function well in a mobile office setting.\nAbility to read and understand manufacturing instructions, electrical diagrams, and mechanical drawings.\nMust be reliable, have good initiative, committed, and quality focused.\nWillingness to work outdoors, on the road, at unusual hours.\nAbility to lift 20-25kg.\nValid driver’s license required.\nKnowledge of operation and maintenance of a wide variety of hand and power tools, shop tools, test equipment.\nAbility to follow oral and written instructions.\nAbility to establish and maintain cooperative working relationships with those contacted in the course of work, including the public.\nAbility to effectively handle multiple priorities, organize workload, and meet deadlines.\nAbility to maintain and perform top level professional integrity and appearance.",
    "job_link": "https://hire-r1.mokahr.com/social-recruitment/tesla/100004142#/job/b3e6a1ad-c55f-4420-b8ee-8dc00fe794b9",
    "posted_date": "Not specified",
    "company": "Tesla",
    "scraped_at": "2025-09-11T02:55:38.696577"
  },
  {
    "title": "Senior Software Engineer - Firebolt",
    "location": "Mumbai, India",
    "experience_required": null,
    "job_description": "Job description\nThe Role:\n\nWe are looking for a highly motivated and experienced engineer to join our team in developing the next-generation AI Agent enhanced Communications platform capable of seamlessly integrating and expanding across various channels such as voice calls, mobile applications, texting, email, and social media posts. As a unified communication platform, it enables message delivery to customers and internal staff across several channels like Email, SMS, In-App messaging, and Social Media. This platform is utilized by applications that cover areas such as discovery, sales, orders, ownership, and service across all business sectors, including Vehicle, Energy, Insurance, and more. The platform guarantees the effective delivery of marketing campaigns and interactions between advisors and customers.\n\nResponsibilities:\n\nDesign, development, and implementation of scalable applications that involves problem solving\nMust have - Leverage technologies like Golang, Apache Kafka, Postgress, Opensearch\nExperience with integrating with LLM and inferring responses\nNice to have - Java, Apache Flink, Clickhouse\nPromote software engineering best practices via code reviews, building tools and documentation\nLeverage your existing skills while learning and implementing new, open-source technologies as Tesla grows.\nWork with product managers, content producers, QA engineers and release engineers to own your solution from development to production\nDefine and develop unit tests and unit test libraries to ensure code development is robust and production ready.\nDrive software process improvements that enable progressively increased team efficiency.\n\nRequirements:\n\nBS or MS in Computer Science or equivalent discipline\nExpert Experience in developing scalable golang applications including SQL and NOSQL daatabases and other opensource technologies.\nDesign software architecture based on business requirements, strategy, and priorities\nGood unit testing and integration testing practices\nExperience with message queue architecture    \nExperience with Docker and Kubernetes\nAgile/SCRUM Software Development Process experience",
    "job_link": "https://hire-r1.mokahr.com/social-recruitment/tesla/100004142#/job/72290d41-7bcd-46e9-bea8-d0f2a60fedd7",
    "posted_date": "Not specified",
    "company": "Tesla",
    "scraped_at": "2025-09-11T02:55:44.426819"
  },
  {
    "title": "Delivery Operations Program Manager - Mumbai/ Delhi",
    "location": "Not specified",
    "experience_required": null,
    "job_description": "Job description\nThe Role:\n\nAt Tesla, we continuously challenge our operational setup in pursuit of the most optimal ways of working and enhancing the experience of our customers. The Delivery Operations Program Manager will be responsible for overseeing and optimizing the entire vehicle delivery function for the region. This role will involve strategic planning, cross-functional coordination, and execution of initiatives aimed at accelerating the fulfilment process and enhancing the customer experience.\nA successful candidate will play a pivotal role in scaling delivery operations, ensuring seamless coordination between internal teams, and planning logistics and events to support peak delivery periods.\n\nResponsibilities:\n\nStrategic Planning & Delivery Optimization:\nDevelop and manage delivery programs and initiatives that align with Tesla’s overall strategy, with a focus on customer experience, operational efficiency, and cost optimization.\nAnalyze data, trends, and feedback to identify operational bottlenecks and implement improvements.\n\nCross-Functional Coordination:\nCollaborate with Customer Engagement Managers, Sales, Service, and Logistics to streamline the full end-to-end delivery journey.\nPlan and coordinate delivery events, ensuring alignment with cross-functional stakeholders.\nEnsure proper planning for vehicle staging, parking capacity, and logistics coordination.\n\nDelivery Execution & Resource Planning:\nForecast manpower requirements and allocate additional support during peak delivery days.\nEstablish scalable processes to improve delivery efficiency and optimize available resources.\n\nProcess & Compliance Management:\nAct as the Subject Matter Expert (SME) for back-end processes related to vehicle operations and fulfilment.\nDefine and track program KPIs, report on program success, and provide regular updates to senior leadership.\nEnsure compliance with regulatory requirements and Tesla’s operational policies.\n\nTeam Management & Leadership:\nLead and manage a team of Delivery Advisors, ensuring they have the necessary tools, knowledge, and guidance to deliver an exceptional customer experience.\nProvide ongoing coaching, performance management, and development opportunities for the team.\nEstablish best practices for customer interactions, vehicle handovers, and issue resolution\n\n\nRequirements:\n\n7+ years of relevant experience in project management, operations, or logistics.\nStrong analytical and problem-solving skills, with experience in data-driven decision-making.\nProven track record of managing cross-functional projects and delivering operational improvements.\nExcellent communication and stakeholder management skills, including the ability to present to senior leadership.\nExperience in field/market operations is a plus.\nExperience managing teams",
    "job_link": "https://hire-r1.mokahr.com/social-recruitment/tesla/100004142#/job/5c9b53c9-a356-4b88-9731-bcef25da3fde",
    "posted_date": "Not specified",
    "company": "Tesla",
    "scraped_at": "2025-09-11T02:55:49.683313"
  },
  {
    "title": "Desktop Support Technician",
    "location": "Mumbai, India",
    "experience_required": null,
    "job_description": "Job description\nPosition Description\nTesla is currently seeking a Desktop Support Technician to join our team in India. This position within the IT Operations team will be on the front lines of Tesla’s IT support. Via Phone and Ticketing system. The primary task of this position will be to troubleshoot and resolve endpoint issues, install and support the systems, and assist with the day-to-day operations for Tesla’s global IT infrastructure to support the growth of Tesla’s initiatives. The ideal candidate will have a strong passion for technology and customer service in a fast-paced corporate environment and be able to learn quickly.\nResponsibilities\n·         Provide day-to-day delivery and technical support for end-users of desktop applications, telephones, handheld email devices, printers, computer hardware, mobile device, AV system and familiar with retail store support via Ticketing and Phone support and onsite support as required\n·         Support Windows and MAC\n·         Diagnose and troubleshoot computer and general network issues\n·         Provide timely resolution of end user problems as per SLA\n·         Provide support for field personnel remote communications and connectivity\n·         Basic administration of phone systems\n·         Perform other duties as required by company management and outside business associates\n·         Exercise independent judgment consistent with department guidelines / standards\n·         Organize and prioritize workflow and to meet established timeframes\n·         Maintain updated knowledge of policies, procedures, products and activities of assigned area\n·         Participate in on call activities and follow escalation process to provide 24/7 support on weekdays and weekend\nRequirements\n·         Ability to troubleshoot and resolve issues with PC’s, Powerful Workstations, Laptop hardware and software onsite and remote\n·         Knowledge of Windows and OS X environment and computer hardware and software at an intermediate or advanced level\n·         Experience in provisioning & support with Avaya VOIP hardware/software or an equivalent VOIP ecosystem\n·         Must have experience working with ticket-based systems for registering incidents and requests\n·         Knowledge of IP networks, DNS, DHCP and experience with troubleshooting all aspects of wired and wireless configurations\n·         Experience with MS SCCM/Jamf or equivalent computer imaging\n·         Experienced in remote customer support including wireless LAN access, VPN, DSL, and Cable services\n·         Experience in Backups, Active Directory, O365, and Windows server environment\n·         Configure & troubleshoot endpoint devices, operating system, POS, desktop / kiosk applications, telephony, and all IT hardware located at site\n·         General knowledge of AV system support including, operation, installation, and configuration of projectors, amplifiers, AV matrix routers, control systems and touch panels\n·         Excellent oral and written communication skills and able to communicate, read, and write effectively in English and other local language\n·         Excellent customer service skills, strong attention to details with excellent follow up\n·         General understanding of server computing, networking, phone setup- support, storage, virtualization, and business applications",
    "job_link": "https://hire-r1.mokahr.com/social-recruitment/tesla/100004142#/job/1878bd7a-aa90-493d-98fe-9010691995f2",
    "posted_date": "Not specified",
    "company": "Tesla",
    "scraped_at": "2025-09-11T02:55:55.072331"
  },
  {
    "title": "Application Support Analyst",
    "location": "Mumbai, India",
    "experience_required": null,
    "job_description": "Job description\nPosition Description\nWe are looking for a highly motivated Application Support Analyst to join Tesla's Application Support team. The ideal candidate will have a good balance of building relationships with business users, solving technical problems and knowledge of enterprise level systems.\nResponsibilities\nUnderstand and own the end-to-end integration of Tesla's Software Application systems\nWork directly with software developers and business users to understand issues and provide solutions in real-time\nWork through tickets received from business users of globally distributed locations\nCreate workarounds for issues that require immediate solutions if a permanent one is not immediately available, and document troubleshooting guides\nSetup automation and monitoring process to optimize utilization of Software Application systems\nWork as an incident commander of production critical calls that require coordination between cross-functional teams\nRequirements\nDegree in an engineering field or equivalent experience and evidence of exceptional ability\n+2 years of support engineering experience working in a globally distributed enterprise level systems\n+2 years of working knowledge of SQL and relational database management system\n+1 years of experience with Python, Go or other software development language\n+1 years of experience with monitoring tools like Prometheus, Grafana, Splunk\n+1 years of experience with Incident management and Defect management ticketing tools\nMust be able to understand integrated systems, API concepts and their dependencies\nExcellent interpersonal skills, energetic and a self-starter\nStrong organizational skills, demonstrated ability to manage multiple tasks simultaneously, and ability to meet deadlines and commitments\nIndividual must be well versed in all Microsoft Applications (Excel, Word, PowerPoint)",
    "job_link": "https://hire-r1.mokahr.com/social-recruitment/tesla/100004142#/job/3521e73e-bdb4-4c5b-ae47-c46b54267986",
    "posted_date": "Not specified",
    "company": "Tesla",
    "scraped_at": "2025-09-11T02:56:00.342095"
  }
]